{
  "acts": [
    {
      "version": 1,
      "scene_description": "The Abandoned Factory",
      "content": [
        {
          "node": 1,
          "outline": "Kate was ordered to investigate an abandoned factory, which was suspected to be the base of illegal robot manufacturing activities.",
          "dialogues": [
            {
              "character": "commander",
              "line": "Kate, we've receive intelligence that an abandoned factory on the outskirts may be a front for illegal android production. Your mission is to infiltrate, confirm the intel, and collect any relevant evidence."
            },
            {
              "character": "Kate",
              "line": "Understood."
            },
            {
              "character": "commander",
              "line": "The site may be guarded by heavily armed personnel. Avoid direct confrontation unless absolutely necessary. Your priority is gathering evidence."
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate was discovered by patrol officers when he sneaked into the factory and was attacked by them. He used cover and his superb marksmanship to defeat them one by one.",
          "dialogues": [
            {
              "character": "patrol Guard",
              "line": "Do we really have to pull night shifts in this dump? Even the rats won't come near this place."
            },
            {
              "character": "patrol Guard B",
              "line": "Stop bellyaching. I heard there's an important operation going on. We can't afford any mistakes."
            },
            {
              "character": "Narration",
              "line": "Rustling sounds in the distance…"
            },
            {
              "character": "patrol Guard B",
              "line": "Did you hear that?!"
            },
            {
              "character": "patrol Guard A",
              "line": "Relax, it's probably just a rat. This place is crawling with them."
            },
            {
              "character": "patrol Guard B",
              "line": "No way! Orders are orders—nothing suspicious gets ignored!"
            },
            {
              "character": "patrol Guard A",
              "line": "Ugh, fine! I'll go check it out. Happy now?"
            },
            {
              "character": "Narration",
              "line": "The ventilation shaft is empty, except for some rat droppings."
            },
            {
              "character": "patrol Guard A",
              "line": "See? You're just paranoid—wait, what the—?!"
            },
            {
              "character": "Narration",
              "line": "A man in a detective's coat stands by the doorway. A fallen guard lies unconscious beside him."
            },
            {
              "character": "patrol Guard A",
              "line": "Who the hell are you?! How did you get in here?!"
            },
            {
              "character": "Narration",
              "line": "Before the guards can react, the man smashes the alarm system and pulls out a hacking device."
            },
            {
              "character": "Kate",
              "line": "Sigh... What a pain."
            },
            {
              "character": "Narration",
              "line": "Battle begins. Kate activates her hacking device."
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate used hacking techniques to erase the patrol officers' short-term memories, then quickly cleaned up the scene and proceeded to the destination.",
          "dialogues": [
            {
              "character": "patrol Guard A",
              "line": "Ah!!!!"
            },
            {
              "character": "Kate",
              "line": "(In an age where machines and humans coexist, hackers have become a profession that kills people. How ironic... But it doesn't matter. I'll just delete your short-term memory, and it will be restored soon.)"
            },
            {
              "character": "Kate",
              "line": "I'm so sorry, this is all for the greater good..."
            },
            {
              "character": "Narrator",
              "line": "After Kate apologized, he immediately dealt with the scene and headed to his destination."
            }
          ]
        },
        {
          "node": 4,
          "outline": "Law enforcement officer Kate was ordered to investigate an abandoned factory and discovered an unfinished android and a mysterious replacement plan, but was attacked by Victor.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Deeper inside the factory, Kate finds a fully operational assembly line. Half-assembled robots hang from the conveyor belts, lifeless yet eerie."
            },
            {
              "character": "Kate",
              "line": "Looks like these robots aren't complete yet..."
            },
            {
              "character": "commander",
              "line": "Copy that. Snap some photos for analysis."
            },
            {
              "character": "Kate",
              "line": "On it."
            },
            {
              "character": "Narration",
              "line": "While taking photos, Kate spots a document on a nearby workstation."
            },
            {
              "character": "Kate",
              "line": "Replacement Project?"
            },
            {
              "character": "Narration",
              "line": "Before he can process the information, a man in a suit steps out from the shadows, his gaze filled with disdain."
            },
            {
              "character": "Victor",
              "line": "So, an enforcer, huh? You guys sure have a knack for showing up uninvited. Too bad you're early—our product isn't quite ready yet. But I don't mind giving you a preview."
            },
            {
              "character": "Narration",
              "line": "Victor activates the unfinished robots."
            },
            {
              "character": "Victor",
              "line": "Go on, clean up the mess."
            },
            {
              "character": "Kate",
              "line": "'Half-finished', huh...? "
            },
            {
              "character": "Narration",
              "line": "Kate hacks into the conveyor belt's robotic arms to fight Narration."
            }
          ]
        },
        {
          "node": 5,
          "outline": "Kate was besieged by a brute force at the factory and was rescued Narration to the base after falling into a coma. He discovered that all the evidence had disappeared, leaving only questions about the 'replacement plan' and 'changing the world' lingering in he mind.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Time passes... When Kate finally regains consciousness, he finds herself Narration at base."
            },
            {
              "character": "commander",
              "line": "You're awake…"
            },
            {
              "character": "commander",
              "line": "When we found you in the ruins, all the data you collected was gone. The only things left were you and your hacking device. What exactly happened in that factory?"
            },
            {
              "character": "Narration",
              "line": "Kate remains silent for a moment."
            },
            {
              "character": "Kate",
              "line": "I saw… a lot of robots. Other than that… nothing."
            },
            {
              "character": "commander",
              "line": "I see. Well, get some rest—you've done enough."
            },
            {
              "character": "Narration",
              "line": "The commander exits the medical room."
            },
            {
              "character": "Kate",
              "line": "'Replacement Project,'changing the world... Justice... Forget it. Thinking wont change anything. Might as well just rest for now…"
            }
          ]
        }
      ]
    },
    {
      "version": 2,
      "scene_description": "The Restaurant",
      "content": [
        {
          "node": 1,
          "outline": "Kate meets new law enforcement officer Eva at a diner, and during their first conversation, armed robots raid the diner, forcing them to fight side by side.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "A few days later, Kate walked into the familiar restaurant, exhausted from his recently completed mission. He thought he could quietly enjoy a sugar-free latte, but unexpectedly, a stranger sat down across from him."
            },
            {
              "character": "Eva",
              "line": "Excuse me, is this seat taken?"
            },
            {
              "character": "Kate",
              "line": "Yes."
            },
            {
              "character": "Eva",
              "line": "Great, now it's mine."
            },
            {
              "character": "Narration",
              "line": "Kate didn't respond, simply looking down at his coffee, but his vigilance did not decrease. He discreetly scanned his surroundings and realized that this woman was not just an ordinary customer."
            },
            {
              "character": "Eva",
              "line": "You don't seem like someone who enjoys coffee. More like… someone who overworks and only drinks it out of necessity."
            },
            {
              "character": "Kate",
              "line": "None of your business."
            },
            {
              "character": "Eva",
              "line": "You guessed right. I'm very interested in you. Or rather, your reputation is too well-known."
            },
            {
              "character": "Narration",
              "line": "Kate put down his cup and carefully examined the woman. There was a hint of provocation in her eyes, but even more curiosity. His hand unconsciously moved toward his waist, ready to react at any moment."
            },
            {
              "character": "Kate",
              "line": "Who exactly are you?"
            },
            {
              "character": "Eva",
              "line": " Eva, newly enforcer. Headquarters sent me to partner with you. Honestly, I'm quite curious to see what kind of sparks we'll create together."
            },
            {
              "character": "Narration",
              "line": "Kate frowned but didn't say much. He simply nodded and continued drinking his coffee, while Eva leaned Narration in her chair, seemingly satisfied with his reaction."
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "Just as Kate was about to get up and leave, the shattering sound of glass broke the restaurant's calm. Several armed robots stormed in, raising their weapons and opening fire."
            },
            {
              "character": "Androids",
              "line": "Target locked—Kate."
            },
            {
              "character": "Kate",
              "line": "What a hassle"
            },
            {
              "character": "Eva",
              "line": "Looks like I arrived just in time."
            },
            {
              "character": "Kate",
              "line": "A little later wouldn't have made a difference."
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate and Eva teamed up to defeat the android, showing a tacit cooperation in battle.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Eva used her specially modified electromagnetic cannon, taking down one of the enemies with a single shot. The two coordinated seamlessly, covering each other and quickly clearing out the remaining Androids."
            },
            {
              "character": "Eva",
              "line": "Not thrilling enough for you?"
            },
            {
              "character": "Kate",
              "line": "Enough."
            }
          ]
        },
        {
          "node": 3,
          "outline": "A mysterious cyborg stops Kate and Eva as they are leaving the restaurant and attacks them. Eva uses electromagnetic weapons to interfere with the opponent, while Kate tries to hack into the opponent's system to find weaknesses.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Just as they were about to leave the restaurant, the roar of an engine echoed from outside. A black sedan screeched to a halt in the middle of the street, and a man in a suit coat stepped out."
            },
            {
              "character": "Narration",
              "line": "His movements were steady, exuding a sense of danger. He surveyed the surroundings before fixing his gaze on Kate and Eva."
            },
            {
              "character": "Mysterious Man",
              "line": "So this is the standard of law enforcement? How disappointing."
            },
            {
              "character": "Eva",
              "line": "This guy doesn't look simple."
            },
            {
              "character": "Narration",
              "line": "The man slowly removed his coat, revealing a fully mechanical body. His limbs were implanted with enhanced modifications, and even his shoulders were equipped with micro-weapons."
            },
            {
              "character": "Kate",
              "line": "A cyborg…"
            },
            {
              "character": "Mysterious Man",
              "line": "Now, you will experience true fear."
            },
            {
              "character": "Narration",
              "line": "The cyborg launched an attack, causing nearby vehicles to explode, illuminating the entire street in fire. Kate and Eva split up, preparing for battle."
            },
            {
              "character": "Eva",
              "line": "Draw his fire! Find a way to hack his system!"
            },
            {
              "character": "Narration",
              "line": "Eva moved quickly, using her electromagnetic weapon to disrupt the enemy's sensors and draw his attention, while Kate activated his hacking device, searching for weaknesses."
            }
          ]
        },
        {
          "node": 4,
          "outline": "Kate and Eva team up to severely damage the cyborg, but the cyborg is ready to launch the ultimate attack. At the critical moment, the robot Houtai intervened to paralyze the enemy and offered to join them. The three of them reached a tacit understanding and officially formed a team.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "The cyborg was not only fast but could predict attack patterns. His heavy punches shattered street obstacles, making Kate's movements more difficult."
            },
            {
              "character": "Kate",
              "line": "Found his weakness."
            },
            {
              "character": "Narration",
              "line": "Kate aimed at the cyborg's power core and fired a shot through its protective shield. The cyborg paused, and Eva seized the moment, destroying the core with her high-energy electromagnetic cannon."
            },
            {
              "character": "Mysterious Man",
              "line": "You… can't win… I still have… one last…"
            },
            {
              "character": "Narration",
              "line": "Suddenly, the cyborg's Narrationup energy core activated, generating a massive energy surge around him. He stood up, his arms transforming into devastating weapons, preparing to unleash his ultimate attack."
            },
            {
              "character": "Eva",
              "line": "He's still fighting Narration!"
            },
            {
              "character": "Kate",
              "line": "Get ready to cover me."
            },
            {
              "character": "Narration",
              "line": "Just as the cyborg was about to release his attack, a small, unassuming robot darted out from the corner, quickly approaching him. It latched onto his ankle and sent a high-voltage shock through his system, paralyzing him instantly."
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Houtai",
              "line": "Hey! No need to thank me! Just doing my job!"
            },
            {
              "character": "Narration",
              "line": "The cyborg collapsed heavily, its energy core shutting down, restoring silence to the scene. Kate and Eva stared in shock at the little robot."
            },
            {
              "character": "Eva",
              "line": "What is that?"
            },
            {
              "character": "Houtai",
              "line": "How rude! I'm Houtai! The all-purpose assistant! That move just now was amazing, right? I knew you needed help, good thing I showed up in time!"
            },
            {
              "character": "Kate",
              "line": "Have we met before?"
            },
            {
              "character": "Houtai",
              "line": "Don't be so cold! I saved your life. If I hadn't stalled for time last time, allowing the enforcement squad to find you, you'd be long dead."
            },
            {
              "character": "Kate",
              "line": "…Thanks. What do you want?"
            },
            {
              "character": "Houtai",
              "line": "To join you and stop Victor."
            },
            {
              "character": "Narration",
              "line": "Kate didn't respond immediately but glanced at Houtai, then at Eva. A strange sense of understanding formed between them."
            },
            {
              "character": "Eva",
              "line": "Looks like our team is coming together."
            },
            {
              "character": "Kate",
              "line": "We need to head Narration and request more support."
            },
            {
              "character": "Narration",
              "line": "Houtai and Eva exchanged a glance before following in Kate's footsteps."
            },
            {
              "character": "Eva",
              "line": "By the way… has anyone ever told you that your name is really strange?"
            },
            {
              "character": "Houtai",
              "line": "To join you and stop Victor.How rude!"
            }
          ]
        }
      ]
    },
    {
      "version": 3,
      "scene_description": "The Enforcement Bureau",
      "content": [
        {
          "node": 1,
          "outline": "Kate, Eva and Houtai were chased by a black vehicle as they returned with the critical data. Kate drove to evade, Eva prepared to fight Narration, and Houtai excitedly took over the steering wheel.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Night was falling. Kate, Eva, and Houtai were driving Narration to the Enforcement Bureau, carrying the crucial data they had just collected from the restaurant. However, danger always lurked when least expected."
            },
            {
              "character": "Houtai",
              "line": "So, that was a huge success, right? If it weren't for my quick thinking, you guys would've been in big trouble! But by the way, this car's suspension is a bit stiff..."
            },
            {
              "character": "Kate",
              "line": "For a robot, you sure talk a lot."
            },
            {
              "character": "Houtai",
              "line": "You enforcers have no sense of humor..."
            },
            {
              "character": "Eva",
              "line": "What's your connection with Victor?"
            },
            {
              "character": "Houtai",
              "line": "Speaking of Victor, he wasn't always like this. I was actually his companion robot since he was a kid. At least, he didn't used to be this way..."
            },
            {
              "character": "Eva",
              "line": "Are you saying he used to be normal?"
            },
            {
              "character": "Houtai",
              "line": "That's right. I was inactive for quite some time, so I have no idea what he went through to become so extreme."
            },
            {
              "character": "Narration",
              "line": "Kate glanced at the rearview mirror and noticed an unusual set of lights. Three black vehicles were trailing them, gradually closing the distance."
            },
            {
              "character": "Kate",
              "line": "Trouble's coming."
            },
            {
              "character": "Houtai",
              "line": "A car chase? Oh, tell me what to do!"
            },
            {
              "character": "Narration",
              "line": "The black cars sped up, and automatic weapon systems emerged from their rooftops, aiming at Kate's vehicle. Remaining calm, Kate maneuvered through the narrow streets while Eva leaned out of the window, ready to fire."
            },
            {
              "character": "Eva",
              "line": "They really aren't afraid of trouble."
            },
            {
              "character": "Kate",
              "line": "Houtai, take the wheel."
            },
            {
              "character": "Houtai",
              "line": "Yes, sir!"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate interfered with the enemy's system, Eva destroyed the pursuit vehicle, and Houtai flexibly controlled the vehicle to successfully escape. Houtai was very excited, but was coldly criticized by Kate.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Kate activated a hacking device to disrupt the enemy's weapons while providing support for Eva. Eva precisely shot out the tires of one of the pursuing cars, causing it to spin out of control and crash into the roadside barrier, engulfed in flames. Houtai skillfully handled the car, weaving through the narrow streets and shaking off some of their pursuers."
            },
            {
              "character": "Houtai",
              "line": "See? My driving skills aren't bad, huh?"
            },
            {
              "character": "Eva",
              "line": "Surprisingly useful."
            },
            {
              "character": "Narration",
              "line": "After a thrilling chase through the city, Houtai sat in the Narrationseat, enthusiastically rambling about how exciting the night had been, completely ignoring Kate's cold response."
            },
            {
              "character": "Kate",
              "line": "You know, you really talk too much."
            },
            {
              "character": "Houtai",
              "line": "Hey! I'm your lifesaver, you know!"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate and others returned to the law enforcement station, only to find that the officer had been impersonated by a cyborg. The other side suddenly attacked and locked the command room, and everyone was surrounded by the enemy.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "The Enforcement Bureau was unusually quiet. The normally bustling corridors were now eerily empty, with only a few officers buried in paperwork. Kate and Eva, with Houtai in tow, headed straight for the command room."
            },
            {
              "character": "Houtai",
              "line": "This place is so dull. I thought the Bureau would be more high-tech."
            },
            {
              "character": "Eva",
              "line": "Keep your voice down."
            },
            {
              "character": "Narration",
              "line": "Upon entering the command room, a uniformed officer approached them with an unnatural smile. His eyes were empty, yet his tone was eerily enthusiastic."
            },
            {
              "character": "commander",
              "line": "Kate, Eva, good work. You can hand over the data to me. I'll handle it personally."
            },
            {
              "character": "Kate",
              "line": "This data is supposed to go to the tech department, not you."
            },
            {
              "character": "Impostor commander",
              "line": "The higher-ups changed the procedure. Everything goes through me now."
            },
            {
              "character": "Narration",
              "line": "Kate sensed something was off and subtly reached for his weapon. Eva stepped closer, her finger resting lightly on the trigger."
            },
            {
              "character": "Houtai",
              "line": "Hey, this guy seems weird... Wait, he's not human at all!"
            },
            {
              "character": "Narration",
              "line": "Just as Houtai finished speaking, the impostor suddenly pulled out a weapon and fired at Kate. Having anticipated the attack, Kate swiftly dodged, the bullets striking the wall, sending debris flying."
            },
            {
              "character": "Impostor commander",
              "line": "Too slow, enforcer."
            },
            {
              "character": "Eva",
              "line": "Damn it, have they infiltrated this place too?"
            },
            {
              "character": "Narration",
              "line": "The impostor activated a hidden command, sealing off the command room with heavy metal doors. Only then did the trio realize they had already been surrounded by robots, who now began their attack. The command room instantly turned into a battleground."
            },
            {
              "character": "Houtai",
              "line": "This is way too intense!"
            }
          ]
        },
        {
          "node": 4,
          "outline": "Kate and others fought fiercely with the robots, eventually knocked down the fake commander, and annihilated the enemy after reinforcements arrived. Kate is determined to face the final showdown.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "The robots were agile, constantly dodging attacks, but the trio managed to hold their ground with well-coordinated teamwork."
            },
            {
              "character": "Narration",
              "line": "Eva aimed for the commander's shoulder and fired, hitting her mark. Kate quickly closed the distance, landing a powerful punch that knocked the impostor down."
            },
            {
              "character": "commander",
              "line": "The plan... is already in motion... Your resistance... is meaningless."
            },
            {
              "character": "Narration",
              "line": "The remaining robots, seeing the tide turning against them, attempted to escape. Just then, reinforcements from the Bureau arrived, swiftly subduing the remaining enemies."
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Kate",
              "line": "It's time to end this."
            }
          ]
        }
      ]
    },
    {
      "version": 4,
      "scene_description": "Enemy Stronghold",
      "content": [
        {
          "node": 1,
          "outline": "Kate and others found the enemy's secret base based on confidential documents, and led the team to sneak in but were ambushed by the bionic army. The battle broke out, two powerful cyborgs appeared, and the situation suddenly became tense.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "With the classified documents recovered from Houtai and the decrypted images, the team finally located the enemy's secret base.The protagonists led a squad to infiltrate Quantum Mind's hidden factory, but as they broke through the entrance, they realized their arrival had been anticipated. Waiting inside was an army of bionics, led by two powerful cyborgs."
            },
            {
              "character": "Narration",
              "line": "The heavy metal doors of the factory were forced open. Kate, Eva, and Houtai led the enforcement squad inside."
            },
            {
              "character": "Eva",
              "line": "This place is quieter than I expected..."
            },
            {
              "character": "Houtai",
              "line": " Something's not right. My sensors are picking up multiple heat signatures—this could be an ambush."
            },
            {
              "character": "Kate",
              "line": "Stay sharp. Prepare for combat."
            },
            {
              "character": "Narration",
              "line": "Suddenly, hidden panels on both sides of the walls slid open. Dozens of bionic soldiers surged forward, their eyes glowing red. They moved in perfect unison, their synchronized mechanical footsteps echoing down the corridor."
            },
            {
              "character": "Houtai",
              "line": "Enemy sighted! Enemy sighted!"
            },
            {
              "character": "Narration",
              "line": "Gunfire erupted. The corridor was engulfed in chaos as bullets and energy beams tore through the darkness. Then, from the shadows, two towering figures emerged."
            },
            {
              "character": "Cyborg A & Cyborg B",
              "line": "Targets confirmed... eliminating intruders..."
            },
            {
              "character": "Eva",
              "line": "Not these guys again..."
            },
            {
              "character": "Houtai",
              "line": "Combat difficulty—extreme."
            },
            {
              "character": "Kate",
              "line": "Get ready to fight."
            },
            {
              "character": "Narration",
              "line": "The cyborgs launched their attack. Every strike echoed with a heavy metallic impact, their speed and strength overwhelming the team, forcing them Narration step by step."
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate and others defeated the cyborg, but the battle was not over yet. As heavy footsteps were heard from deep within the factory, Victor, wearing mechanical armor, appeared, and the atmosphere suddenly became solemn.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "After an intense battle, Cyborg A and Cyborg B finally collapsed. Their mechanical eyes flickered for a brief moment before shutting down completely. Meanwhile, the remaining enforcers were still engaged in combat with the bionic soldiers."
            },
            {
              "character": "Narration",
              "line": "From deep within the factory, heavy footsteps reverberated through the space. Under the flickering lights, a massive figure emerged."
            },
            {
              "character": "Narration",
              "line": "Victor stepped forward, clad in an imposing mechanized suit, his body pulsing with red energy cores. His every step carried an oppressive weight."
            }
          ]
        },
        {
          "node": 3,
          "outline": "Victor launched an attack wearing a mechanical armor, and the battlefield shook. Faced with his extreme ideas, Kate and others refused to give in and were determined to stop his plan.",
          "dialogues": []
        },
        {
          "node": 4,
          "outline": "Victor was eventually subdued and the fight ended. Houtai falls down seriously injured, and Victor asks to repair him before leaving. Kate and Eva looked at each other and acquiesced to the request.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 5,
      "scene_description": "Good Ending",
      "content": [
        {
          "node": 1,
          "outline": "The crisis was resolved, Victor was arrested, and the city returned to safety. After a short break, Kate and Eva visited Houtai who had completed the repairs. Although he felt sad about Victor's ending, he still decided to join the two of them to protect the city. The three of them left side by side, and a new journey was about to begin.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "After the war, the city returned to peace. Kate and Eva looked at the ruins from afar, and their words revealed the relief of surviving the disaster. Kate quietly preserved Houtai's core, symbolizing unfinished possibilities. The future is still in their hands.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Kate sacrificed herself to end Victor's conspiracy and disappeared in the explosion with him. Eva and Houtai survived and the city returned to peace, but his name and sacrifice will be remembered forever.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 6,
      "scene_description": "Law Enforcement Office",
      "content": [
        {
          "node": 1,
          "outline": "Surrounded by enemies, Houtai chooses to sacrifice himself and creates chaos with an explosion to allow Kate and Eva to escape, but the enemy has not given up and the pursuit continues.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Kate takes Eva to hide in his secret base, deciphers the intelligence left by Houtai, finds the enemy's stronghold, and decides to end the battle in an unexpected way.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 7,
      "scene_description": "Enemy Camp",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva try to crack the encrypted data left by Houtai. Faced with the challenge of decrypting a series of numbers, they decide to continue working hard to uncover the truth about the mastermind behind the scenes.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Kate and Eva detonated the passage to create chaos, and took the opportunity to raid the enemy's core area and launched a fierce battle.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Kate and Eva break through the enemy, Kate goes to the control room alone to fight Victor, and the life-and-death battle officially begins.",
          "dialogues": []
        },
        {
          "node": 4,
          "outline": "Kate initiated remote hacking, detonated the central control core, and eventually buried Victor in a sea of ​​fire.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 9,
      "scene_description": "Bed Ending",
      "content": [
        {
          "node": 21,
          "outline": "Kate and Eva were no match for the powerful enemy. Kate fell to the ground with serious injuries, and Eva was also in desperate situation. After the enemy left, the battlefield was in ruins. A mysterious robot appeared quietly, staring at the two people quietly, as if in silence.",
          "dialogues": []
        },
        {
          "node": 221,
          "outline": "Kate and Eva break through the blockade and temporarily escape the pursuers, but the communication device suddenly rings and a mysterious voice reveals that their car has been marked. Eva realizes she can't escape, and a tactical drone descends, revealing the cyborg. Kate then realized that whether fighting or retreating, everything was already calculated by the enemy.",
          "dialogues": []
        },
        {
          "node": 222,
          "outline": "Kate tries to circumvent the drone blockade, but ends up being ambushed by mechanical soldiers. The cyborgs appeared and the enemy suppressed their firepower, forcing the two into a dead end. Eva whispered and asked if they were defeated, but Kate remained silent. They finally realized that the outcome of this battle was already determined.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Kate and Eva fought fiercely with the army of androids in the command room, but were eventually outnumbered and engulfed by the explosion. After a few weeks, the mechanical system took over completely, social order was restored, and the city became peaceful and stable on the surface. Yet, in the shadows, there are still those who question, and the red light of the monitors silently bears witness to the advent of this new world.",
          "dialogues": []
        },
        {
          "node": 41,
          "outline": "Kate and Eva fell to the ground seriously injured, Victor approached step by step, ruthlessly declaring the end of the battle. Eva fought back but to no avail and was eventually knocked down by heavy damage. In despair, Kate watched her life slip away, and Victor coldly launched a final attack, the explosion engulfed everything and darkness fell.",
          "dialogues": []
        },
        {
          "node": 6,
          "outline": "Kate and Eva eventually died in battle, the data fell into the hands of the enemy, Houtai's sacrifice was in vain, and the resistance forces suffered a devastating blow",
          "dialogues": []
        },
        {
          "node": 7,
          "outline": "",
          "dialogues": []
        }
      ]
    },
    {
      "version": 21,
      "scene_description": "Restaurant",
      "content": [
        {
          "node": 1,
          "outline": "Kate's collaboration with Eva is thwarted and she is attacked by a reinforced cyborg. A mysterious man appears, showing off his mechanically modified body and threatening the two. Eva fights her bionic enemies, while Kate faces the cyborgs alone",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Kate hits the cyborg's weak spot and Eva destroys its energy core. The cyborgs launched an ultimate counterattack, but Houtai suddenly appeared and successfully paralyzed the cyborgs. Houtai introduced himself and expressed his desire to join them. The three of them formed a tacit understanding and decided to go back to ask for support.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 22,
      "scene_description": "Resturent",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva were besieged, but Houtai's rescue mission was destroyed. The two men fled by car, with the cyborgs chasing them closely. The mysterious force launched 'Plan B', drones blocked the way ahead, and they were in a desperate situation.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 41,
      "scene_description": "Secret Base",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva lost the battle, but the Enforcers were still fighting the enemy. At this time, Victor appeared in heavy mechanical armor, with a red energy core flashing. His steps were steady and oppressive, and he sneered at everyone.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Eva and Houtai are in charge of the enemy forces, while Kate fights Victor alone. Victor dons a mechanical armor and launches an attack, claiming that the plan is for the evolution of humanity, but Kate angrily denounces that this is not a reason to sacrifice innocent people.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Kate tried to shut down Victor's core but was discovered. At the critical moment, Houtai blocked the fatal blow and fell to the ground seriously injured. Victor was briefly shaken, and Kate took the opportunity to hack into his armor, rendering him unable to move. In the end, Victor was subdued and escorted. Before leaving, he asked Houtai to be repaired. Kate and Eva made a silent decision.",
          "dialogues": []
        }
      ]
    }
  ]
}