{
  "acts": [
    {
      "version": 1,
      "scene_description": "The Abandoned Factory",
      "content": [
        {
          "node": 1,
          "outline": "Kate was ordered to investigate an abandoned factory, which was suspected to be the base of illegal robot manufacturing activities.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Kate was discovered by patrol officers when he sneaked into the factory and was attacked by them. He used cover and his superb marksmanship to defeat them one by one.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Kate used hacking techniques to erase the patrol officers' short-term memories, then quickly cleaned up the scene and proceeded to the destination.",
          "dialogues": []
        },
        {
          "node": 4,
          "outline": "Law enforcement officer Kate was ordered to investigate an abandoned factory and discovered an unfinished android and a mysterious replacement plan, but was attacked by Victor.",
          "dialogues": []
        },
        {
          "node": 5,
          "outline": "Kate was besieged by a brute force at the factory and was rescued back to the base after falling into a coma. He discovered that all the evidence had disappeared, leaving only questions about the 'replacement plan' and 'changing the world' lingering in he mind.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 2,
      "scene_description": "The Restaurant",
      "content": [
        {
          "node": 1,
          "outline": "Kate meets new law enforcement officer Eva at a diner, and during their first conversation, armed androids raid the diner, forcing them to fight side by side.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Kate and Eva teamed up to defeat the android, showing a tacit cooperation in battle.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "A mysterious cyborg stops Kate and Eva as they are leaving the restaurant and attacks them. Eva uses electromagnetic weapons to interfere with the opponent, while Kate tries to hack into the opponent's system to find weaknesses.",
          "dialogues": []
        },
        {
          "node": 4,
          "outline": "Kate and Eva team up to severely damage the cyborg, but the cyborg is ready to launch the ultimate attack. At the critical moment, the robot Houtai intervened to paralyze the enemy and offered to join them. The three of them reached a tacit understanding and officially formed a team.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 3,
      "scene_description": "The Enforcement Bureau",
      "content": [
        {
          "node": 1,
          "outline": "Kate, Eva and Houtai were chased by a black vehicle as they returned with the critical data. Kate drove to evade, Eva prepared to fight back, and Houtai excitedly took over the steering wheel.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Kate interfered with the enemy's system, Eva destroyed the pursuit vehicle, and Houtai flexibly controlled the vehicle to successfully escape. Houtai was very excited, but was coldly criticized by Kate.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Kate and others returned to the law enforcement station, only to find that the officer had been impersonated by a cyborg. The other side suddenly attacked and locked the command room, and everyone was surrounded by the enemy.",
          "dialogues": []
        },
        {
          "node": 4,
          "outline": "Kate and others fought fiercely with the androids, eventually knocked down the fake commander, and annihilated the enemy after reinforcements arrived. Kate is determined to face the final showdown.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 4,
      "scene_description": "Enemy Stronghold",
      "content": [
        {
          "node": 1,
          "outline": "Kate and others found the enemy's secret base based on confidential documents, and led the team to sneak in but were ambushed by the bionic army. The battle broke out, two powerful cyborgs appeared, and the situation suddenly became tense.",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "Kate and others defeated the cyborg, but the battle was not over yet. As heavy footsteps were heard from deep within the factory, Victor, wearing mechanical armor, appeared, and the atmosphere suddenly became solemn.",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Victor launched an attack wearing a mechanical armor, and the battlefield shook. Faced with his extreme ideas, Kate and others refused to give in and were determined to stop his plan.",
          "dialogues": []
        },
        {
          "node": 4,
          "outline": "Victor was eventually subdued and the fight ended. Houtai falls down seriously injured, and Victor asks to repair him before leaving. Kate and Eva looked at each other and acquiesced to the request.",
          "dialogues": []
        }
      ]
    },
    {
      "version": 5,
      "scene_description": "Ending",
      "content": [
        {
          "node": 1,
          "outline": "Crisis resolved",
          "dialogues": []
        },
        {
          "node": 2,
          "outline": "A moment of peace",
          "dialogues": []
        },
        {
          "node": 3,
          "outline": "Houtai's Repair",
          "dialogues": []
        }
      ]
    },
    {
      "version": 6,
      "scene_description": "",
      "content": [
        {
          "node": 1,
          "outline": "",
          "dialogues": []
        }
      ]
    },
    {
      "version": 7,
      "scene_description": "",
      "content": [
        {
          "node": 1,
          "outline": "",
          "dialogues": []
        }
      ]
    },
    {
      "version": 8,
      "scene_description": "",
      "content": [
        {
          "node": 1,
          "outline": "",
          "dialogues": []
        }
      ]
    },
    {
      "version": 9,
      "scene_description": "",
      "content": [
        {
          "node": 1,
          "outline": "",
          "dialogues": []
        }
      ]
    },
    {
      "version": 10,
      "scene_description": "",
      "content": [
        {
          "node": 1,
          "outline": "",
          "dialogues": []
        }
      ]
    },
    {
      "version": 11,
      "scene_description": "",
      "content": [
        {
          "node": 1,
          "outline": "",
          "dialogues": []
        }
      ]
    }
  ]
}