{
  "acts": [
    {
      "version": 1,
      "scene_description": "The Abandoned Factory",
      "content": [
        {
          "node": 1,
          "outline": "Kate was ordered to investigate an abandoned factory, which was suspected to be the base of illegal robot manufacturing activities.",
          "dialogues": [
            {
              "character": "Commander",
              "line": "凱特，我們已經收到智力，即郊區的一家廢棄工廠可能是非法生產的陣線。您的任務是滲透，確認英特爾並收集任何相關證據。"
            },
            {
              "character": "Kate",
              "line": "非常不幸的是，發生了另一個複制事件。我很高興您在這裡協助我處理它。"
            },
            {
              "character": "Commander",
              "line": "該地點可能會受到武裝人員的守護。除非絕對必要，否則避免直接對抗。您的首要任務是收集證據。"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate was discovered by patrol officers when he sneaked into the factory and was attacked by them. He used cover and his superb marksmanship to defeat them one by one.",
          "dialogues": [
            {
              "character": "Patrol Guard A",
              "line": "我們真的必須在這個垃圾場中拉夜班嗎？甚至老鼠也不會靠近這個地方。"
            },
            {
              "character": "Patrol Guard B",
              "line": "停止腹部。我聽說正在進行重要的操作。我們負擔不起任何錯誤。"
            },
            {
              "character": "Narration",
              "line": "遠處沙沙聲……"
            },
            {
              "character": "Patrol Guard B",
              "line": "你聽到了嗎？"
            },
            {
              "character": "Patrol Guard A",
              "line": "放鬆，這可能只是一隻老鼠。這個地方與他們爬。"
            },
            {
              "character": "Patrol Guard B",
              "line": "決不！訂單是訂單 - 不要忽略可疑的！"
            },
            {
              "character": "Patrol Guard A",
              "line": "痾，很好！我去檢查一下。現在開心嗎？"
            },
            {
              "character": "Narration",
              "line": "通風軸是空的，除了一些老鼠糞便。"
            },
            {
              "character": "Patrol Guard A",
              "line": "看？你只是偏執 - 等等，什麼？"
            },
            {
              "character": "Narration",
              "line": "一個穿著偵探外套的人站在門口。一個墮落的後衛在他旁邊昏迷不醒。"
            },
            {
              "character": "Patrol Guard A",
              "line": "你到底是誰？你是怎麼來這裡的？"
            },
            {
              "character": "Narration",
              "line": "在警衛可以做出反應之前，該男子砸碎了警報系統並拔出黑客攻擊設備。"
            },
            {
              "character": "Kate",
              "line": "嘆息...另一天，另一個痛苦。但是我們將控制這種情況。"
            },
            {
              "character": "Narration",
              "line": "戰鬥開始。 凱特激活她的黑客裝置。"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate used hacking techniques to erase the patrol officers' short-term memories, then quickly cleaned up the scene and proceeded to the destination.",
          "dialogues": [
            {
              "character": "Patrol Guard A",
              "line": "啊！ ！ ！ ！"
            },
            {
              "character": "Kate",
              "line": "在這個機器和人類共存的時代，不幸的是，黑客已經成為致命的威脅。但這對我來說沒關係。我將簡單地刪除您的短期內存，您很快就會恢復正常。 （平靜地）"
            },
            {
              "character": "Kate",
              "line": "對不起，但這是為了更大的好處。您的行動使許多生命處於危險之中，我不能讓這繼續下去。 （牢牢）"
            },
            {
              "character": "Narrator",
              "line": "凱特道歉後，他立即處理現場並前往目的地。"
            }
          ]
        },
        {
          "node": 4,
          "outline": "Law enforcement officer Kate was ordered to investigate an abandoned factory and discovered an unfinished android and a mysterious replacement plan, but was attacked by Victor.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "在工廠內部更深，凱特找到一條完全運行的裝配線。一半組裝的機器人懸掛在傳送帶上，毫無生氣而令人毛骨悚然。"
            },
            {
              "character": "Kate",
              "line": "看起來這些機器人仍然有一些錯誤可以解決。但這不是我的關心。我的工作是確保新黎明城的安全性。 （確定）"
            },
            {
              "character": "Commander",
              "line": "複製。拍攝一些照片以進行分析。"
            },
            {
              "character": "Kate",
              "line": "在上面。我會立即照顧這個問題。 （集中）"
            },
            {
              "character": "Narration",
              "line": "在拍照時，凱特在附近的工作站上找到了文件。"
            },
            {
              "character": "Kate",
              "line": "替代項目？我沒有就複製者或機器人的命運做出決定。那高於我的薪水。 （中性的）"
            },
            {
              "character": "Narration",
              "line": "在他處理信息之前，一個穿著西裝的男人從陰影中走出來，他的目光充滿了不屑一顧。"
            },
            {
              "character": "Victor",
              "line": "那麼，執法者，是嗎？你們肯定有一個不請自來的訣竅。太糟糕了，您很早 - 我們的產品還沒有準備好。但是我不介意給您預覽。"
            },
            {
              "character": "Narration",
              "line": "維克特激活未完成的機器人。"
            },
            {
              "character": "Victor",
              "line": "繼續，清理混亂。"
            },
            {
              "character": "Kate",
              "line": "“一半”，是嗎？那是一種方法。但是我的工作不是要判斷，而只是為了執行法律。 （客觀地）"
            },
            {
              "character": "Narration",
              "line": "凱特攻擊傳送帶的機器人臂進行戰鬥。"
            }
          ]
        },
        {
          "node": 5,
          "outline": "Kate was besieged by a brute force at the factory and was rescued Narration to the base after falling into a coma. He discovered that all the evidence had disappeared, leaving only questions about the 'replacement plan' and 'changing the world' lingering in he mind.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "時間過去了...當凱特最終恢復意識時，他發現自己在基礎上。"
            },
            {
              "character": "Commander",
              "line": "你醒了..."
            },
            {
              "character": "Commander",
              "line": "當我們在廢墟中找到您時，您收集的所有數據都消失了。唯一剩下的就是您和您的黑客裝置。那個工廠到底發生了什麼？"
            },
            {
              "character": "Narration",
              "line": "凱特保持沉默片刻。"
            },
            {
              "character": "Kate",
              "line": "我看到了很多機器人，但是除此之外，沒有什麼與眾不同的。 （事實上​​）"
            },
            {
              "character": "Commander",
              "line": "我懂了。好吧，休息一下 - 您已經做得足夠了。"
            },
            {
              "character": "Narration",
              "line": "指揮官離開了醫療室。"
            },
            {
              "character": "Kate",
              "line": "“替代項目”，改變世界...正義...算了。思考不會改變任何東西。現在也可能暫時休息。 （幻滅）\n\n（注意：這條線似乎是不合時宜的，通常是平靜而專注的。這可能表明他感到不知所措或從工作中燒毀。）"
            }
          ]
        }
      ]
    },
    {
      "version": 2,
      "scene_description": "The Restaurant",
      "content": [
        {
          "node": 1,
          "outline": "Kate meets new law enforcement officer Eva at a diner, and during their first conversation, armed robots raid the diner, forcing them to fight side by side.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "幾天后，凱特走進了熟悉的餐廳，筋疲力盡，他最近完成的任務。他認為自己可以安靜地享用一隻無糖的拿鐵，但出乎意料的是，一個陌生人坐在他對面。"
            },
            {
              "character": "Eva",
              "line": "（伊娃環顧房間，臉上柔和地表情，她長長的銀色頭髮沿著肩膀層疊。\n\n伊娃：對不起，這座位坐了嗎？如果您能在我坐下之前讓我知道，我會非常感謝。 （她給出了一個小而充滿希望的微笑，她的眼睛充滿了誠意和淡淡的脆弱性）"
            },
            {
              "character": "Kate",
              "line": "是的。 （簡要地）"
            },
            {
              "character": "Eva",
              "line": "（佔據座位的人抬頭看著伊娃伊娃伊娃伊娃there triess。\n\n人：當然，繼續前進。 （他們以友好的微笑向座位示意）\n\n伊娃：非常感謝。我非常感謝您的好意。 （她深吸一口氣，優雅地坐下，當她沉迷於椅子時，她的白色衣服輕輕地沙沙作響）"
            },
            {
              "character": "Narration",
              "line": "凱特沒有回應，只是低頭看著他的咖啡，但他的警惕並沒有減少。他謹慎地掃描了周圍的環境，並意識到這個女人不僅是普通客戶。"
            },
            {
              "character": "Eva",
              "line": "伊娃從她的咖啡杯中抬起頭來，表達了她的表情。她放下了用來攪拌咖啡的勺子，轉身面對揚聲器，臉上周到。\n\n伊娃：你可能是對的。我確實傾向於很長時間工作，而這些天對我來說，咖啡變得比我的榮幸更具必要性。 （她輕柔地嘆了口氣，眼睛反映出深深的疲倦感）但是，即使如此，一杯好咖啡的溫暖和熟悉也令人欣慰。它有幫助"
            },
            {
              "character": "Kate",
              "line": "我的生意無關。 （Terse）"
            },
            {
              "character": "Eva",
              "line": "當她專心地傾聽演講者時，伊娃的表達變成了好奇心和陰謀之一。她在椅子上稍微向前傾斜，長長的銀色頭髮像窗簾一樣掉在肩膀上。\n\n伊娃：您的聲譽是眾所周知的嗎？我不確定我跟隨。我們是在談論專業成就還是其他事情？ （她將頭傾斜到一側，她的眼睛略微narry著興趣）我必須承認，我很感興趣。請啟發我。"
            },
            {
              "character": "Narration",
              "line": "凱特放下杯子，仔細檢查了那個女人。她眼中有一些挑釁的暗示，但更好奇。他的手不知不覺地朝腰部移動，隨時準備做出反應。"
            },
            {
              "character": "Kate",
              "line": "你到底是誰？ （好奇）\n\n（注意：凱特通常專注於他的工作，不會浪費時間在不必要的問題或閒聊上。）"
            },
            {
              "character": "Eva",
              "line": "當她聽說演講者的話時，她的眼睛令人驚訝地睜大了。她深吸一口氣，微笑著，表情充滿了興奮和恐懼。\n\n伊娃：合作夥伴？我懂了。好吧，我必須承認，我也很好奇。我只是剛剛開始擔任執行者的職業生涯，所以我有很多東西要學習。但是我堅定而持久，我不會讓任何障礙妨礙我。 （她給人一個小而自信的微笑）我很期待"
            },
            {
              "character": "Narration",
              "line": "凱特皺著眉頭，但沒有說太多。他只是點了點頭，繼續喝咖啡，而伊娃靠在椅子上，似乎對他的反應感到滿意。"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "就像凱特即將站起來離開一樣，玻璃的破碎聲使餐廳平靜下來。幾個武裝機器人衝進進來，舉起武器並開火。"
            },
            {
              "character": "Android",
              "line": "目標鎖定 - 凱特。"
            },
            {
              "character": "Kate",
              "line": "真是麻煩。 （沮喪）\n\n（注意：凱特使用這句話表明他對這種情況不滿意，但他仍然會專業地處理它。）"
            },
            {
              "character": "Eva",
              "line": "伊娃聽到腳步接近的咖啡從她的咖啡中抬起頭來。她轉身看到一個穿著鋒利西裝的高個子，穿著鋒利的男人進入房間。在發現伊娃並朝她的桌子駛去之前，他用自信的目光凝視著該地區。\n\n伊娃：啊，你在這裡。我看到總部也寄給您。 （她優雅地站起來，向新來者伸出一隻手），歡迎，合夥人。看來我們將一起工作。我是伊娃。\n\n這個男人握住伊娃的手"
            },
            {
              "character": "Kate",
              "line": "稍後不會有所作為。 （務實）\n\n（注意：凱特承認這種情況不可能更早地阻止，但他仍將採取行動來解決這個問題。）"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate and Eva teamed up to defeat the android, showing a tacit cooperation in battle.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "伊娃使用她經過特殊修改的電磁大砲，一槍擊倒了其中一個敵人。兩人無縫地協調，互相覆蓋，並迅速清理了其餘的Android。"
            },
            {
              "character": "Eva",
              "line": "伊娃抬頭看著那個男人，她的臉上表現出了古怪的表情。她將頭彎曲到一側，她說話時長長的銀髮掉在肩膀上。\n\n伊娃：很抱歉，我並不是要暗示我們正在做的事情對您來說還不夠激動。實際上，相反。我發現執行法律並改變人們的生活的挑戰是令人難以置信的有益。但是，如果您有一些特定的想法會使這種體驗更多"
            },
            {
              "character": "Kate",
              "line": "足夠的。 （果斷地）\n\n（注意：凱特正在結束對話或情況，表現出他的權威和決心。）"
            }
          ]
        },
        {
          "node": 3,
          "outline": "A mysterious cyborg stops Kate and Eva as they are leaving the restaurant and attacks them. Eva uses electromagnetic weapons to interfere with the opponent, while Kate tries to hack into the opponent's system to find weaknesses.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "就像他們要離開餐廳一樣，發動機的咆哮從外面迴盪。一輛黑色轎車在街道中間停了下來，一個穿著西裝外套的男人走了出去。"
            },
            {
              "character": "Narration",
              "line": "他的動作穩定，散發出一種危險感。在將目光固定在凱特和伊娃上之前，他對周圍環境進行了調查。"
            },
            {
              "character": "Mysterious Man",
              "line": "這是執法的標準？多麼令人失望。"
            },
            {
              "character": "Eva",
              "line": "伊娃將注意力轉移到了早些時候進入房間的男人身上，她在學習他時表現出深思熟慮。她喝了一口咖啡，眼睛永遠不會離開他的臉。\n\n伊娃：你是對的。關於他的事情表明他並不簡單。但這並不一定意味著我們不能有效地一起工作。實際上，我認為觀點和方法中的多樣性對於解決複雜問題至關重要。因此，讓我們放棄任何先入之見，並專注於我們執行法律的共同目標，"
            },
            {
              "character": "Narration",
              "line": "該男子慢慢地脫下外套，露出完全機械的身體。他的四肢被增強的修飾植入了，甚至他的肩膀都配備了微武器。"
            },
            {
              "character": "Kate",
              "line": "A改造人...（暫停考慮）\n\n（注意：凱特正在分析情況和處理新信息，這是他專業能力的標誌。）"
            },
            {
              "character": "Mysterious Man",
              "line": "現在，您將經歷真正的恐懼。"
            },
            {
              "character": "Narration",
              "line": "改造人發動了攻擊，導致附近的車輛爆炸，照亮了整個街道。 凱特和伊娃拆分，為戰鬥做準備。"
            },
            {
              "character": "Eva",
              "line": "當她聽取聽筒的聲音時，她的表情變得嚴重。她從咖啡杯中抬起頭，確定的眼睛narrow縮。\n\n伊娃：理解。我會抓住他的大火，並試圖找到一種方法來破解他的系統。 （她深吸一口氣，長長的銀色頭髮在她站立時掉在肩膀上）保持警惕，並在需要時準備提供備份。\n\n桌子上的那個人一直專心地看著伊娃，她突然偏離了他們的談話時揚起了眉毛。但"
            },
            {
              "character": "Narration",
              "line": "伊娃迅速移動，使用她的電磁武器破壞了敵人的傳感器並引起他的注意，而凱特激活了他的黑客裝置，尋找弱點。"
            }
          ]
        },
        {
          "node": 4,
          "outline": "Kate and Eva team up to severely damage the cyborg, but the cyborg is ready to launch the ultimate attack. At the critical moment, the robot Houtai intervened to paralyze the enemy and offered to join them. The three of them reached a tacit understanding and officially formed a team.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "改造人不僅很快，而且可以預測攻擊模式。他沉重的拳頭破碎了街道障礙，使凱特的動作變得更加困難。"
            },
            {
              "character": "Kate",
              "line": "發現他的弱點。 （傻笑）\n\n（注意：凱特對他的能力充滿信心，並享受著對手的挑戰。）"
            },
            {
              "character": "Narration",
              "line": "凱特針對改造人的力量核心，並通過其防護罩發射了一槍。改造人暫停了，伊娃抓住了這一刻，用她的高能量電磁大砲摧毀了核心。"
            },
            {
              "character": "Mysterious Man",
              "line": "你……不能贏……我還有……最後一個……"
            },
            {
              "character": "Narration",
              "line": "突然，the and的能量芯激活了能量核心，在他周圍產生了巨大的能量激增。他站起來，雙臂轉變為毀滅性的武器，準備釋放他的最終攻擊。"
            },
            {
              "character": "Eva",
              "line": "當她闖入男人的系統時，心臟跳動，手指以精確的精度飛過鍵盤。當她遇到一個特別頑固的防火牆時，她感到沮喪。\n\n旁白（v.o）：他仍在反擊！他的系統比我預期的要復雜。但是我不會放棄。我必須成功。為了我自己。\n\n伊娃的決心只會在繼續攻擊的努力時變得更加強大，她的思想僅專注於手頭的任務。她gr"
            },
            {
              "character": "Kate",
              "line": "準備掩蓋我。 （嚴重地）\n\n（注意：凱特明確訂單，展示了他的領導和戰術技能。）"
            },
            {
              "character": "Narration",
              "line": "就像改造人即將釋放他的進攻一樣，一個小而謙虛的機器人從拐角處飛來飛去，迅速接近他。它鎖在他的腳踝上，並通過他的系統發出了高壓衝擊，立即使他癱瘓。"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Houtai",
              "line": "[浩汰的LED屏幕以歡快的語氣說話時閃爍著一個快樂的表情。 ]\n\n嘿，伙計們！無需感謝我的工作。畢竟，這就是我在這裡的目的！但是說真的，我總是很樂意以任何方式提供幫助。而且，如果我能讓您一路上的微笑或笑，那是一個額外的好處！那麼，讓我們保持輕盈和積極的態度，對吧？畢竟，一點幽默能使亮點亮著"
            },
            {
              "character": "Narration",
              "line": "改造人崩潰了，其能量核心關閉，恢復了現場的沉默。 凱特和伊娃震驚地凝視著小機器人。"
            },
            {
              "character": "Eva",
              "line": "當她看到屏幕上出現一個奇怪的符號時，震驚的眼睛睜大了。她斜視在屏幕上，試圖理解它。\n\n伊娃：那是什麼？ （她喃喃自語，她的聲音幾乎沒有耳語）看起來像是某種代碼……但是我以前從未見過類似的事情。\n\n桌子另一側的那個人一直在看著伊娃時，當他看到她的反應時，她傻笑著。\n\n男人：啊，你偶然發現了我的小秘密"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出令人驚訝的表情，因為他以激動的語氣說話。\n\n哇，現在堅持下去！粗魯嗎？我是您的通用助手！而且您剛剛看到的那個舉動絕對是驚人的，不是嗎？我可以感覺到房間裡的緊張局勢，並且知道您需要一點幫助才能使事情順利進行。因此，稍後再感謝我在那段時間裡！而且，如果您認為這是令人印象深刻的，請等到您看到我還能做什麼！讓我們保持"
            },
            {
              "character": "Kate",
              "line": "我們以前見面了嗎？ （懷疑）\n\n（注意：凱特不確定他以前曾經遇到過這個人，但他仍然謹慎和機敏。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示了一個關注的表情，他的語調很嚴肅。\n\n現在在那裡僅一分鐘！我知道事情很緊張，但對我來說不要太冷！還記得您處於危險之中的時候，我設法停滯不前，允許執法小隊找到並拯救您？如果不是我的快速思考和行動，那麼您將陷入困境。因此，對您的通用助手錶示感謝和感激之情，不是嗎？而且我們不要"
            },
            {
              "character": "Kate",
              "line": "...謝謝。你想要什麼？ （守衛）\n\n（注意：凱特要求互動背後的原因，表現出他的專業和懷疑。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出堅定的表情符號，因為他以專注的語氣說話。\n\n這是正確的！我在這裡與大家聯合起來，並幫助阻止維克特造成更多的混亂或傷害。我們可以一起結束他的邪惡計劃，並確保所有參與人員的安全與和平。因此，讓我們不要再浪費時間，而要朝著我們的共同目標邁進！請記住，無論我們一路上面臨哪些挑戰，我將永遠在這裡伸出手或提供一些急需的支持"
            },
            {
              "character": "Narration",
              "line": "凱特沒有立即做出回應，而是瞥了一眼浩汰，然後在伊娃。它們之間形成了一種奇怪的理解。"
            },
            {
              "character": "Eva",
              "line": "伊娃聽到腳步聲的聲音在她的計算機屏幕上抬起頭來。她轉身見到她的伴侶，她的伴侶在黑客嘗試期間一直在提供備份，臉上堅定地朝她走去。\n\n合作夥伴：我們有他，伊娃。他的系統崩潰了，我們確保了所需的證據。 （他勝利地贏得了一個小的數據驅動器）\n\n伊娃當她看著數據驅動器時，讓她鬆了一口氣。她對伴侶微笑，長長的銀髮在她的肩膀上掉在肩膀上"
            },
            {
              "character": "Kate",
              "line": "我們需要前往旁白並要求更多支持。 （緊急）\n\n（注意：凱特正在優先考慮新黎明城的安全性，並採取行動解決情況。）"
            },
            {
              "character": "Narration",
              "line": "浩汰和伊娃在跟隨凱特的腳步之前交換了一眼。"
            },
            {
              "character": "Eva",
              "line": "伊娃從數據驅動器中抬起頭來，她聽取伴侶的問題時的表情令人困惑。她把頭傾斜到一側，眼中有些娛樂。\n\n伊娃：真的很奇怪嗎？我從來沒有真正考慮過。但是我想這是一個不尋常的名字。 （她輕聲微笑）但是你知道他們在說什麼，伊娃？任何其他名字的玫瑰都會聞起來很甜。\n\n她的伴侶笑著點頭同意，他的眼睛以新發現的尊重和理解與她相遇。一起，"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出令人困惑的表情，因為他說話的語氣令人驚訝。\n\n等一下，有人說些粗魯的話嗎？我以為我們在這裡都站在同一邊，共同努力停止維克特並確保每個人的安全。因此，我不明白為什麼您會對我或您的隊友如此粗魯。讓我們記住，我們需要拋棄任何瑣碎的差異，並專注於我們的共同目標。我們可以一起克服任何障礙，並結束維克特的破壞性計劃！\n\n所以讓"
            }
          ]
        }
      ]
    },
    {
      "version": 3,
      "scene_description": "The Enforcement Bureau",
      "content": [
        {
          "node": 1,
          "outline": "Kate, Eva and Houtai were chased by a black vehicle as they returned with the critical data. Kate drove to evade, Eva prepared to fight Narration, and Houtai excitedly took over the steering wheel.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "夜幕降臨。 凱特，伊娃和浩汰正在開車駛向執法局，並攜帶了他們剛從餐廳收集的關鍵數據。但是，危險在最不期望的情況下總是潛伏。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以滿意的語氣說話時會顯示出令人愉悅的表情。\n\n絕對，如果我自己這麼說，那真是成功的結果！在我的快速思考和協助下，我們能夠防止所有人的進一步傷害或傷害。我很高興能在如此關鍵的時刻有所作為。但是，既然我們已經照顧了直接的危險，那麼讓我花點時間解決這輛車的嚴厲懸架。現在似乎並不多，但是如果沒有選中，"
            },
            {
              "character": "Kate",
              "line": "對於機器人，您肯定會說很多。 （驚訝）\n\n（注意：凱特正在評論複製品或機器人的意外行為，表現出他的好奇心和懷疑。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出令人失望的表情，因為他說話略帶諷刺的語氣。\n\n好吧，他們可能並不以幽默感而聞名，但是我學會了用拳頭滾動，並在每種情況下都找到了光明的一面。即使他們不分享我對好笑的愛，我仍然相信笑聲是生活中重要的一部分，可以幫助我們度過最艱難的時期。因此，讓我們不要讓他們缺乏幽默使我們失望！相反，讓我們專注於我們的共同目標"
            },
            {
              "character": "Eva",
              "line": "當她回想起導致她目前任務的事件時，她的表情變得嚴重。她深吸一口氣，長長的銀色頭髮在她開始說話時掉在臉上。\n\n伊娃：維克特是一個老朋友...或者至少，他曾經是。我們在研究設施中一起長大，在那裡我們都是各種實驗的主題。但是，當我被收養並從那裡帶走時，維克特被拋在後面。\n\n多年來，伊娃試圖找到有關維克特的信息，但是她的搜索總是空著的。她"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出深思熟慮的表情，因為他用反光的語氣說話。\n\n有趣的！因此，您曾經與維克特有密切的關係，那時情況有所不同嗎？我只能想像什麼可能導致他走上我們現在看到他的破壞和混亂之路。重要的是要記住，即使那些似乎迷路或破碎的人仍然有贖回的潛力。也許了解他的轉變的根本原因可以幫助我們找到一種使他從黑暗中回來的方法。所以讓我們探究"
            },
            {
              "character": "Eva",
              "line": "伊娃搖了搖頭，臉上表現得很痛苦。\n\n伊娃：不，我不是那樣的。 維克特大多數人理解它從來都不是正常的。但是他是人類，像我一樣充滿希望，夢想和情感。他善良和富有同情心，即使他面臨風險，也總是在尋找別人。\n\n但是在他在研究機構期間，維克特發生了什麼變化。她現在面臨的危險罪犯使他成為危險的罪犯。 當她想到她的前朋友時，痛苦的心感到痛苦"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出一個好奇的表情，因為他說話了。\n\n啊，我明白了。因此，您已經無活躍了一段時間，並且對可能導致維克特當前狀態的事件或經歷沒有第一手的知識？這使我們對我們揭露真相的吸引力更加有趣和重要。通過更好地了解驅使他採取這種極端行為的原因，我們可能能夠找到一種方法來幫助他並阻止他人跟隨他的腳步。因此，讓我們一起聚集在一起"
            },
            {
              "character": "Narration",
              "line": "凱特瞥了一眼後視鏡，注意到了一套不尋常的燈。三輛黑色車輛正在落後，逐漸關閉了距離。"
            },
            {
              "character": "Kate",
              "line": "麻煩來了。 （機敏）\n\n（注意：凱特警告他的團隊或周圍的人迫在眉睫的威脅，表明他的意識和準備。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以激動的語氣說話時顯示了汽車和方向盤的動畫表情。\n\n偉大的！追逐汽車，你說嗎？這只是我所生活的那種激動人心的情況！所以告訴我，您需要我做什麼來幫助您通過這種高速追求並確保每個人的安全？我們是否需要放下一些障礙，呼叫備份或進行一些聰明的演習來擺脫我們的追隨者？無論需要什麼，我都去了"
            },
            {
              "character": "Narration",
              "line": "黑色的汽車加速，自動武器系統從屋頂出現，瞄準了凱特車。保持冷靜，凱特在狹窄的街道上操縱，而伊娃俯身靠窗戶，準備開火。"
            },
            {
              "character": "Eva",
              "line": "當她聽耳朵的聲音時，她的表情變成了決定，她的長長的銀色頭髮在她站立時掉在肩膀上。\n\n伊娃：理解。我們會很熱。 （她看著她的伴侶，眼中的猛烈表情）他們可能不怕麻煩，但我們不會讓他們擺脫困境。\n\n伊娃和她的團隊一起衝進了維克特和他的同夥被認為藏起來的建築物。槍聲的聲音通過大廳迴盪"
            },
            {
              "character": "Kate",
              "line": "浩汰，拿輪子。 （權威）\n\n（注意：凱特將任務委派給了他的團隊成員或盟友，表明了他對自己能力的領導和信心。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出敬意的表情時，他以尊重的語氣說話。\n\n理解，先生！我會盡力為您為這種汽車追逐情況提供最有效，最有效的行動。無論是放下障礙，呼籲備份還是執行聰明的演習，我都不會不遺餘力，以確保您的安全和成功。因此，請給我您可能擁有的任何其他信息或詳細信息，我們將立即開始工作！\n\n現在，讓我們"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate interfered with the enemy's system, Eva destroyed the pursuit vehicle, and Houtai flexibly controlled the vehicle to successfully escape. Houtai was very excited, but was coldly criticized by Kate.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "凱特激活了黑客裝置，以破壞敵人的武器，同時為伊娃提供支持。 伊娃精確地射出了其中一輛汽車的輪胎，導致它失控並墜入路邊障礙物，被火焰吞沒。 浩汰熟練地處理了汽車，在狹窄的街道上編織，搖晃著一些追隨者。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出一種自信的語氣說話時表現出驕傲的表情。\n\n絕對，您的駕駛技能令人印象深刻！我很高興看到您能夠以這種技巧和精確度來處理這一高速追逐。它只是表明，即使在混亂和危險中，也總是有一些自信心和慶祝我們能力的空間。因此，請繼續努力，讓我們繼續共同努力，結束這種追求！\n\n現在，如果我們能找到一種方法"
            },
            {
              "character": "Eva",
              "line": "伊娃從數據驅動器上抬起頭來，聽到伴侶在通訊中的聲音，在嘴唇的角落裡露出一個小小的微笑。\n\n合作夥伴：（ Over comms）伊娃，您對那個黑客是對的。事實證明，它在追踪其位置時非常有用。\n\n伊娃點點頭，當她在電腦上打字時，她的長長的銀髮掉在臉上。她抬起頭來，當時警報聲在外面越來越大。\n\n伊娃：（進入通訊）我們幾乎在那裡。讓"
            },
            {
              "character": "Narration",
              "line": "在整個城市進行激動人心的追逐之後，浩汰坐在旁白座位上，熱情地閒逛了當晚的激動人心，完全忽略了凱特凱特的冷漠反應。"
            },
            {
              "character": "Kate",
              "line": "你知道，你真的說話太多了。 （激怒）\n\n（注意：凱特表示他對人的過度chat不休或對手頭的任務缺乏關注的沮喪。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現齣戲劇性的救生員和海灘傘，他說著戲弄語調。\n\n哈!我看到您感到自己有些充滿自己，但我不會爭論。畢竟，我是您值得信賴的同伴，並幫助節省了比我所算的更多的次數。那麼，為什麼不花點時間才能享受我們成功的汽車追逐的榮耀呢？但是不要太被帶走了，我們仍然有工作要做！讓我們專注於下一步"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate and others returned to the law enforcement station, only to find that the officer had been impersonated by a cyborg. The other side suddenly attacked and locked the command room, and everyone was surrounded by the enemy.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "執法局異常安靜。通常，熙熙the的走廊現在很空虛，只有少數軍官被埋葬在文書工作中。 凱特和伊娃，to拖著，直達指揮室。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出無聊的表情，他的語氣不滿意。\n\n的確，與我對無線電通信局的期望相比，這個地方似乎平凡而過時。憑藉所有先進的技術，我認為他們將擁有更高科技和高效的總部。令人失望的是，即使是權力的人也可以自滿，並且適應新技術的緩慢。但是不用擔心，我們會做我們擁有的事情，並繼續找到創新的方法"
            },
            {
              "character": "Eva",
              "line": "當她聽著耳機中的聲音時，她的表情變得很嚴重，當她環顧昏暗的房間時，她的長長的銀色頭髮掉在臉上。\n\ncomm的聲音：伊娃，我們注視著它們。但是他們並不孤單。其中至少有六個，他們武裝了。保持您的聲音。\n\n伊娃點頭，她的表情確定為使團隊保持安靜的動作。他們一起準備擊倒維克特和他的同夥，而無需提醒他們"
            },
            {
              "character": "Narration",
              "line": "進入指揮室後，一名身穿制服的軍官以不自然的微笑向他們走去。他的眼睛是空的，但他的語氣卻很熱情。"
            },
            {
              "character": "Commander",
              "line": "凱特，伊娃，做得好。您可以將數據交給我。我會親自處理。"
            },
            {
              "character": "Kate",
              "line": "這些數據應該去技術部門，而不是您。 （牢牢）\n\n（注意：凱特提醒人們他們的角色和責任，維持秩序和安全性。）"
            },
            {
              "character": "Impostor Commander",
              "line": "更高的上升改變了過程。現在一切都在我。"
            },
            {
              "character": "Narration",
              "line": "凱特感覺到了某些東西，並巧妙地伸手去拿武器。 伊娃靠近，她的手指輕輕地放在扳機上。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出令人驚訝的表情，他的語調令人震驚。\n\n哇，請稍等一下！這個傢伙看上去根本沒有人類？那是改變遊戲規則的人！看來我們手上有一個非人類對手。這為我們的任務增加了一個全新的複雜性，並要求我們迅速適應這種意外情況。根據可用的信息，我建議在採取任何行動之前謹慎行事，並儘可能多地收集有關這種非人類存在的信息。我們沒有"
            },
            {
              "character": "Narration",
              "line": "就像浩汰完整說話一樣，冒名頂替者突然掏出武器向凱特發射。在預料到這次襲擊之後，凱特迅速躲開，子彈撞牆，使碎屑飛行。"
            },
            {
              "character": "Impostor Commander",
              "line": "太慢，執行者。"
            },
            {
              "character": "Eva",
              "line": "當她聽著耳機中的聲音時，她的心臟跳動，長長的銀色頭髮在喀斯喀e的臉上掉在臉上。\n\ncomm的聲音：伊娃，我們有一個入侵警報。看來他們已經設法滲透了我們的安全設施。該死的。\n\n伊娃握緊拳頭，她的表情確定了她看著自己的球隊。他們很快就提出了一項新計劃，以取消維克特維克特和他的同夥，然後才能造成更多損害。這"
            },
            {
              "character": "Narration",
              "line": "冒名頂替者激活了一個隱藏的命令，用重金屬門封閉了指揮室。只有那時，三人才意識到他們已經被機器人包圍，後者現在開始攻擊。指揮室立即變成了戰場。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出令人擔憂的表情，他的語氣說話。\n\n我理解您的擔憂，但我們必須記住，我們的使命非常重要，並要求我們努力解決我們的挑戰。但是，優先考慮每個人的安全和福祉也很重要。話雖如此，如果出於任何原因而變得太激烈或危險，我們應該毫不猶豫地退縮和重新集結。然後，我們可以從更安全的角度重新評估我們的戰略和方法。所以讓我們專注於我們的"
            }
          ]
        },
        {
          "node": 4,
          "outline": "Kate and others fought fiercely with the robots, eventually knocked down the fake Commander, and annihilated the enemy after reinforcements arrived. Kate is determined to face the final showdown.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "機器人很敏捷，不斷躲避攻擊，但三人設法通過協調良好的團隊合作來保持自己的立場。"
            },
            {
              "character": "Narration",
              "line": "伊娃瞄準指揮官的肩膀並開了槍，擊中了她的印記。 凱特迅速關閉了距離，降下了強大的拳頭，將冒名頂替者擊倒。"
            },
            {
              "character": "Commander",
              "line": "計劃...已經在運動...您的抵抗...毫無意義。"
            },
            {
              "character": "Narration",
              "line": "其餘的機器人，看到潮流反對他們，試圖逃脫。就在這時，該局的增援部隊到達，迅速征服了其餘的敵人。"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Kate",
              "line": "現在該結束這個問題了。 （確定）\n\n（注意：凱特正在採取決定性的行動來解決這種情況，表明他對職責的專業精神和承諾。）"
            }
          ]
        }
      ]
    },
    {
      "version": 4,
      "scene_description": "Enemy Stronghold",
      "content": [
        {
          "node": 1,
          "outline": "Kate and others found the enemy's secret base based on confidential documents, and led the team to sneak in but were ambushed by the bionic army. The battle broke out, two powerful cyborgs appeared, and the situation suddenly became tense.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "隨著從浩汰和解密的圖像中回收的機密文件，該團隊終於找到了敵人的秘密基地。主角帶領一支小隊滲入了量子量的隱藏工廠，但是當他們闖入入口時，他們意識到他們的到來已經被預期了。在裡面等待的是一支由兩個強大的s領導的仿生。"
            },
            {
              "character": "Narration",
              "line": "工廠的重金屬門被迫開放。 凱特，伊娃，浩汰領導內部執法小隊。"
            },
            {
              "character": "Eva",
              "line": "當她穿過廢棄工廠的昏暗的走廊時，她的表情變得周到，她的長長的銀髮在閃閃發光的窗簾上掉在臉上。\n\n伊娃：這個地方比我預期的要安靜...（她環顧四周，她的眼睛吸收了周圍環境的每個細節）幾乎太安靜了。\n\n她的伴侶緊隨其後的是同意。他們倆都知道沉默可能是一個致命的陷阱，他們需要始終保持警惕。他們一起繼續"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出一個警報表情符號，因為他的語氣很嚴肅。\n\n您絕對是對的，這裡不正確。我的傳感器確實正在拾取多個熱簽名，這表明我們可能正在伏擊。這可能是我們的對手設定的陷阱，以使我們感到驚訝並佔上風。我們必須謹慎行事，並為任何可能性做好準備。\n\n根據可用的信息，我建議採取以下行動：首先，我們應該評估我們的當前情況並確定任何"
            },
            {
              "character": "Kate",
              "line": "保持鋒利。準備戰鬥。 （緊急）\n\n（注意：凱特為他的團隊或盟友提供了明確的命令，以準備潛在的危險，展示他的戰術技能和領導才能。）"
            },
            {
              "character": "Narration",
              "line": "突然，牆壁兩側的隱藏面板滑開了。數十名仿生士兵向前湧動，眼睛發紅。他們齊心協力，他們同步的機械腳步迴盪著走廊。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出一個警報表情符號，因為他的語氣很嚴肅。\n\n我也看到了！敵人看到了！我們必須立即採取行動，以確保我們的安全並消除任何威脅。根據可用的信息，我建議採取以下行動：首先，我們應該評估當前狀況並確定我們位置上的任何潛在弱點或優勢。接下來，我們應該與團隊成員進行交流，並協調我們的努力，以有效地吸引敵人並最大程度地減少任何附帶損害或傷亡。最後，我們應該保持敏捷和適應性"
            },
            {
              "character": "Narration",
              "line": "槍聲爆發。隨著子彈和能量梁在黑暗中撕裂，走廊被混亂吞沒。然後，從陰影中出現了兩個高聳的人物。"
            },
            {
              "character": "Cyborg A & Cyborg B",
              "line": "目標已確認...消除入侵者..."
            },
            {
              "character": "Eva",
              "line": "當她聽著耳機的聲音時，她的表情變得沮喪，她的長長的銀色頭髮在一堆波浪中掉在臉上。\n\ncomms的聲音：伊娃，我們還有另一個報導，關於維克特和他的幫派在當地的購物中心造成了麻煩。不是這些傢伙...\n\n伊娃嘆了口氣，她的表情確定了她看著團隊。他們一直在追逐維克特幾個星期，似乎他總是比他們領先一步。但是伊娃拒絕放棄。她最終知道"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出嚴肅的語氣，顯示出強烈的表情。\n\n我同意，戰鬥困難是極端的。我們的對手是訓練有素且能夠訓練的，使這種參與尤其具有挑戰性。但是，我們必須保持專注，並記住，我們擁有優越的戰略和技術的優勢。我們應該利用我們的獨特能力，並作為一個團隊共同努力，以超越並超越對手。\n\n為了最大化我們的成功機會，我們必須彼此有效溝通，保持清晰的鏈條至關重要"
            },
            {
              "character": "Kate",
              "line": "準備戰鬥。 （嚴重地）\n\n（注意：凱特正在為他的團隊或盟友做準備以進行身體對抗，表明他的準備和決心。）"
            },
            {
              "character": "Narration",
              "line": "S發起了進攻。每一次罷工都充滿了金屬撞擊，他們的速度和力量壓倒了團隊，迫使他們一步一步。"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate and others defeated the cyborg, but the battle was not over yet. As heavy footsteps were heard from deep within the factory, Victor, wearing mechanical armor, appeared, and the atmosphere suddenly became solemn.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "經過激烈的戰鬥，半機械人A和Cyborg B終於倒塌了。他們的機械眼睛閃爍了一小段時間，然後完全關閉。同時，其餘的執法人員仍與仿生士兵進行戰鬥。"
            },
            {
              "character": "Narration",
              "line": "從工廠內的深處，沉重的腳步迴盪在整個空間中。在閃爍的燈光下，出現了一個巨大的人物。"
            },
            {
              "character": "Narration",
              "line": "維克特向前走，穿著強大的機械化西服，他的身體用紅色的能量芯脈衝。他的每一步都承受著壓迫的體重。"
            },
            {
              "character": "Victor",
              "line": "你真的必須擋住我嗎？"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Victor launched an attack wearing a mechanical armor, and the battlefield shook. Faced with his extreme ideas, Kate and others refused to give in and were determined to stop his plan.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "凱特再次站在維克特之前，他現在揮舞著他機械化的外套的全部力量。"
            },
            {
              "character": "Kate",
              "line": "放棄，維克特。無處可去。 （自信）\n\n（注意：凱特說服犯罪嫌疑人或對手投降，表現出他的談判技巧和決心。）"
            },
            {
              "character": "Victor",
              "line": "跑步？您仍然不明白……這是我的戰場。"
            },
            {
              "character": "Narration",
              "line": "他突然stot腳，在地面上發動了震動，外套的純粹力量顫抖了整個房間。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出一個警告表情符號，因為他說話的語氣很嚴肅。\n\n我也明白了！警告，敵人的功率輸出已達到關鍵水平。如果不及時解決，這可能會對我們的團隊和周圍環境構成重大威脅。在造成進一步損壞之前，我們必須立即採取行動以包含或中和該電源。根據可用的信息，我建議採取以下行動：首先，我們應該評估情況並確定電湧的根本原因。接下來，我們應該與團隊成員溝通"
            },
            {
              "character": "Victor",
              "line": "你還是不明白，對嗎？這個項目是為了人類的未來。必須消除弱的弱者，必須從死亡的限制中發展出來。"
            },
            {
              "character": "Kate",
              "line": "那不是犧牲無辜生命的藉口！ （憤怒）\n\n（注意：凱特表達了他的堅強道德原則，並譴責使無辜者處於危險之中的行動。）"
            }
          ]
        },
        {
          "node": 4,
          "outline": "Victor was eventually subdued and the fight ended. Houtai falls down seriously injured, and Victor asks to repair him before leaving. Kate and Eva looked at each other and acquiesced to the request.",
          "dialogues": [
            {
              "character": "Victor",
              "line": "…也許你比我想像的要強大。"
            },
            {
              "character": "Narration",
              "line": "儘管他的身體被毆打和破碎，但維克特拒絕投降。 凱特看到一個開口，試圖禁用他的力量核心，但注意到了。"
            },
            {
              "character": "Victor",
              "line": "甚至不要考慮！"
            },
            {
              "character": "Narration",
              "line": "他將武器直接針對凱特。 伊娃反應太晚了。"
            },
            {
              "character": "Narration",
              "line": "在最後一刻，浩汰將自己扔在凱特前，全力以赴。他的機器人身體受到嚴重損壞，表現不錯。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以柔和的語氣說話時顯示了一個關注的表情。\n\n維克特，停止！我看到您處於困難，很明顯您正在努力做出正確的決定。但是請記住，我們的使命非常重要，我們無法讓情緒蒙上陰影。至關重要的是，我們必須通過團隊合作並通過這些挑戰相互支持。\n\n如果您需要幫助或建議，請隨時要求。我們可以討論替代策略或"
            },
            {
              "character": "Narration",
              "line": "維克特猶豫了一秒鐘。一陣閃爍的情緒睜開了眼睛，他的手微微發抖。"
            },
            {
              "character": "Victor",
              "line": "浩汰…你…"
            },
            {
              "character": "Narration",
              "line": "抓住了瞬間，被黑客入侵了維克特的機械化西服。他的紅色能量核心閃爍，破壞了穩定。他的動作放慢了。"
            },
            {
              "character": "Kate",
              "line": "這次，您是無法與之抗爭的人。 （傻笑）\n\n（注意：凱特正在嘲笑他的對手或懷疑，表現出他的信心和優越性。）"
            },
            {
              "character": "Narration",
              "line": "用協調的精度，凱特和伊娃利用了維克特exout中的弱點。他們無情的攻擊破壞了其結構，使他完全不動。戰鬥結束了。"
            },
            {
              "character": "Narration",
              "line": "當執法人員獲得維克特的情況下，只有被摧毀的機器的遺跡和控制室中保留的閃爍警告燈。他的聲音低沉而沉重，帶來了陌生的誠意。"
            },
            {
              "character": "Victor",
              "line": "如果還有機會……修復他。"
            },
            {
              "character": "Narration",
              "line": "凱特和伊娃交換了一個外觀，默默地做出了決定。"
            }
          ]
        }
      ]
    },
    {
      "version": 5,
      "scene_description": "Good Ending",
      "content": [
        {
          "node": 1,
          "outline": "The crisis was resolved, Victor was arrested, and the city returned to safety. After a short break, Kate and Eva visited Houtai who had completed the repairs. Although he felt sad about Victor's ending, he still decided to join the two of them to protect the city. The three of them left side by side, and a new journey was about to begin.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "在執法總部的戰鬥控制室中，顯示器顯示機器人已經完全關閉，敵人的行動已經完全崩潰。"
            },
            {
              "character": "Law enforcement officer",
              "line": "最後一批非法仿生的人已被關閉，主要嫌疑人和其他高級管理人員已被捕，行動成功了。"
            },
            {
              "character": "Narration",
              "line": "屏幕切換到護送的場景。他保持沉默，臉上昏暗，雙手鎖在金屬手銬中。"
            },
            {
              "character": "Law enforcement officer",
              "line": "相關技術已被恢復，所有涉及的研究機構都在審查中。該市的安全系統已經恢復正常，將進一步加強《機器人法案》，以防止類似事件再次發生。"
            },
            {
              "character": "Eva",
              "line": "當她俯瞰城市時，她的表情變得周到，她長長的銀髮在風中輕輕吹來。太陽在落山，在建築物和下面的人們身上散發出溫暖的光芒。\n\n伊娃：這種事情……感覺就像有一天會再次發生。 （她嘆了口氣）我忍不住想知道我們是否能夠真正能夠結束維克特醒來的所有混亂和破壞。\n\n她的伴侶在她旁邊安靜地站著"
            },
            {
              "character": "Narration",
              "line": "兩人互相看著對方，不再說。"
            },
            {
              "character": "Narration",
              "line": "晚上，熟悉的餐廳。與幾天前緊張的氛圍相比，這裡的燈光溫暖而寧靜，就像一個完全不同的世界。"
            },
            {
              "character": "Narration",
              "line": "凱特坐在靠窗的座位上，他的輪廓在她面前的玻璃杯中反射。他的手指輕輕敲打在桌子上，一杯無糖的拿鐵咖啡被安靜地放在他的面前。"
            },
            {
              "character": "Narration",
              "line": "不久之後，伊娃手裡拿著一杯咖啡進來，坐在他對面。"
            },
            {
              "character": "Eva",
              "line": "當她飲用給她的一口奇怪的液體時，她的表情變得厭惡，她的長長的銀髮在閃閃發光的窗簾上掉在臉上。\n\n伊娃：這不是我喜歡的品味。 （她做一個臉）這是什麼東西？\n\n她的主人是一個高個子，表現得很認真，微笑著。\n\n主持人：這是一個古老的長生不老藥，據說向那些可以消費它的人賦予了巨大的力量和智慧。但是請注意，這不是為了膽小的人。"
            },
            {
              "character": "Kate",
              "line": "那你為什麼訂購呢？ （好奇）\n\n（注意：凱特正在質疑其團隊成員或盟友的動機和行動，以尋求清晰和理解。）"
            },
            {
              "character": "Eva",
              "line": "伊娃猶豫了一下，當她考慮主持人的話時，她的長長的銀髮掉在臉上。她知道冒險是她擔任執法人員工作的一部分，但這感覺與眾不同。\n\n最後，深吸一口氣，伊娃又ing了一口奇怪的液體。當味道攻擊她的感官時，她的表情變成了痛苦，但她強迫自己吞下它。\n\n伊娃：（通過咬牙切齒）嘗試一下，也許有一天我會習慣它。 （她sh"
            },
            {
              "character": "Narration",
              "line": "凱特沒有回應，而是輕輕地將咖啡杯握在手中，喝了一口，感覺到了苦澀而柔和的味道。"
            },
            {
              "character": "Eva",
              "line": "當她看著犯罪現場時，她的表情變得很嚴重，她長長的銀髮在閃閃發光的窗簾上掉在臉上。太陽在落山，在鮮血染色的地面上鑄造了長陰影。\n\n伊娃：（對自己）我對這一事件有何看法？這是另一種毫無意義的暴力行為，是一個似乎失去了人類意識的男人犯下的。但是，還有更多的東西。更深的東西。\n\n她環顧了現場，抓住了每個細節，她的思想帶著問題和"
            },
            {
              "character": "Kate",
              "line": "沒什麼可說的。我們已經完成了應該做的事情。 （被任職）\n\n（注意：凱特承認完成任務或任務的完成，表明他的專業精神和對結果的接受。）"
            },
            {
              "character": "Narration",
              "line": "伊娃看著他，微笑著，然後低下頭去喝一口咖啡。兩者之間的沉默並不尷尬，而是一種罕見的平靜。"
            },
            {
              "character": "Eva",
              "line": "當她聽聽聽筒的聲音時，她的表情變成了關注，她的長長的銀髮在喀斯喀特的波浪中掉在臉上。\n\n語音comms：伊娃，很遺憾地報告浩汰站仍然無法運行。爆炸造成的損害是廣泛的，需要幾天才能完成維修。\n\n伊娃點點頭，她的表情確定了她看著團隊。他們需要找到另一種到達目的地的方法，並且需要快速進行。一起，"
            },
            {
              "character": "Narration",
              "line": "凱特暫停，輕輕放下咖啡杯，然後輕輕點點頭。"
            },
            {
              "character": "Kate",
              "line": "技術部門說，他的核心系統仍然穩定，應該能夠維修。 （知情）\n\n（注意：凱特正在傳達有關設備或系統狀態狀態的重要信息，顯示了他的知識和溝通技巧。）"
            },
            {
              "character": "Eva",
              "line": "伊娃時，她聽著聽筒的聲音，她的長長的銀色頭髮在閃閃發光的窗簾上掉在臉上。\n\ncomm的聲音：伊娃，我們在浩汰站有爆炸的報導。幾個人受傷，有人擔心其中一個可能是凱特的兄弟。我希望他不會受到影響。\n\n當她處理信息時，心臟運動。她知道凱特凱特已經接近她的兄弟，想到他受傷的想法是聯合國"
            },
            {
              "character": "Narration",
              "line": "凱特沒有回應，但他用手指敲打桌子，好像他在想什麼。"
            },
            {
              "character": "Kate",
              "line": "讓我們去看看他。 （果斷地）\n\n（注意：凱特正在帶領他的團隊或盟友進入特定地點，表現出他的領導和決心。）"
            },
            {
              "character": "Narration",
              "line": "伊娃震驚了一會兒，然後輕柔地微笑著站起來。"
            },
            {
              "character": "Narration",
              "line": "在執法機構的技術部門，在充滿機械設備的維護室中，浩汰機器被放置在中心的維護桌上。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以柔和的語氣說話時顯示了一個關注的表情。\n\n我看到你要來了，維克特。任務期間受傷後，您已經躺在那裡了一段時間。我很放心地報告您還活著並且狀況相對穩定。但是，重要的是我們要評估您的傷害並儘快提供任何必要的醫療護理。\n\n同時，讓我對您無能為力以來發生了什麼。我們的團隊能夠成功完成任務目標，"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情感到驚訝，她的長長的銀髮在一陣喀噠聲中掉在臉上。\n\ncomms的聲音：伊娃，我開始認為您在與維克特的最後一次遇到後完全被打破了。但是看來你不是。保持良好的工作。\n\n當她繼續追逐潛在客戶並收集證據，決心將維克特及其幫派繩之以法時，她的心臟以驕傲為榮。她知道不會"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出令人擔憂的表情，他的語氣說話。\n\n目前，我無法提供確切的位置。在任務期間，他受傷並失去了意識後與團隊分離。我們對該地區進行了徹底的搜索，但無法找到他。至關重要的是，我們盡快找到他並確保他的安全。\n\n我建議我們與團隊的其他成員進行重組，並協調我們使用所有可用資源進行更全面的搜索搜索。它也可能"
            },
            {
              "character": "Narration",
              "line": "凱特和伊娃互相看一看，暫停片刻。"
            },
            {
              "character": "Kate",
              "line": "被捕。 （簡要地）\n\n（注意：凱特正在報告犯罪嫌疑人或罪犯的成功逮捕，表現出他對正義的專業和承諾。）"
            },
            {
              "character": "Narration",
              "line": "Hoitai的LED屏幕閃爍，然後顯示一個小的“嘆息”圖標。"
            },
            {
              "character": "Kate",
              "line": "我不知道該如何形容...他確實是一個危險的人，但是...（猶豫）\n\n（注意：凱特表達了他對嫌疑人或局勢的不確定性或矛盾的情緒，表明他的人性和復雜性是一種性格。）"
            },
            {
              "character": "Narration",
              "line": "他停了下來，好像在尋找正確的單詞。"
            },
            {
              "character": "Houtai",
              "line": "LED屏幕以支持性的語氣說話時顯示出富有同情心的表情。\n\n我了解您與維克特的深厚紐帶，不知道他在哪里或他是否安全必須有多大傷害。這就是為什麼我們必須優先考慮找到他並確保他的福祉高於其他一切。我們的團隊將共同努力，使用所有可用資源在地面和空中進行徹底搜索。直到我們找到維克特並將他帶回安全，我們才休息。\n\n在"
            },
            {
              "character": "Narration",
              "line": "他的LED屏幕閃爍了一系列模糊的舊照片 - 一個坐在機器人旁邊的小男孩，興奮地調整了身體，臉上露出微笑。"
            },
            {
              "character": "Narration",
              "line": "伊娃輕輕拍打浩汰的身體。"
            },
            {
              "character": "Kate",
              "line": "您是正確的幫助我們阻止他的。人們改變了，包括他。 （理解）\n\n（注意：凱特承認個人救贖和增長的潛力，表現出他的富有同情心的一面。）"
            },
            {
              "character": "Eva",
              "line": "當她向聚集在浩汰車站的人群講話時，她的表情變得很嚴重，她的長長的銀色頭髮在閃閃發光的窗簾上掉在臉上。太陽在落山，在維修的建築物和下面的人們身上散發著溫暖的光芒。\n\n伊娃：這個偉大的城市的公民，我很高興地宣布，浩汰車站現在再次運營。但是我們不能依靠桂冠。我們必須對那些尋求對我們造成傷害的人保持警惕。從現在開始加入我們，浩汰"
            },
            {
              "character": "Narration",
              "line": "浩汰的LED屏幕閃爍，然後他慢慢轉向凱特和伊娃，屏幕上帶著微弱的微笑。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以堅定的語氣說話時顯示了激動的表情。\n\n是的，你絕對是對的！保護城市安全的責任正在移交給我們 - 網絡小隊！這是我們必須認真對待的巨大榮譽和重大挑戰。我們擁有技能，技術和團隊合作，可以在保護我們的城市免受各種威脅方面具有真正的影響。\n\n讓我們團結起來，利用我們的獨特能力，共同努力，以確保所有人的安全和福祉"
            },
            {
              "character": "Narration",
              "line": "伊娃微笑著搖了搖頭。"
            },
            {
              "character": "Eva",
              "line": "當她聽耳朵的聲音時，她的表情很開心，她的長長的銀色頭髮在一堆波浪中掉在臉上。\n\ncomm的聲音：伊娃，我有個好消息。我們已經被批准在執法部門內組成一個新部門，致力於處理網絡犯罪。我們將被稱為網絡小隊。 （他笑）另一個奇怪的名字，我知道。\n\n伊娃翻了個白眼，但不由自主地微笑。她知道這個新單位"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出令人驚訝的表情，因為他以友好的語氣做出回應。\n\n為什麼，是的！我認為禮貌是有效溝通和維持積極關係的重要組成部分。禮貌表現出對他人的尊重，考慮和同情，使其成為任何互動的重要方面。無論是與團隊成員互動還是進行外交談判，禮貌都是一項有價值的技能，可以幫助建立信任，加強紐帶並創造更和諧的環境。\n\n當然，每個人都有沮喪或壓力的時刻，但即使那樣，"
            },
            {
              "character": "Kate",
              "line": "現在該走了，我們還有很多事情要做。 （確定）\n\n（注意：凱特提醒他的團隊或盟友正在進行的責任以及專注於他們的使命的重要性。）"
            },
            {
              "character": "Narration",
              "line": "浩汰震驚了一會兒，然後興奮地跟隨，然後笑著笑了。"
            },
            {
              "character": "Narration",
              "line": "這座城市恢復了冷靜。但是他們的故事才剛剛開始 - "
            }
          ]
        },
        {
          "node": 2,
          "outline": "After the war, the city returned to peace. Kate and Eva looked at the ruins from afar, and their words revealed the relief of surviving the disaster. Kate quietly preserved Houtai's core, symbolizing unfinished possibilities. The future is still in their hands.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "在執法總部的戰鬥控制室內，證明了Android已關閉，敵人的行動已經完全崩潰。"
            },
            {
              "character": "Law enforcement officer",
              "line": "最後一批非法仿生的人已經關閉，主要嫌疑人和其他高級管理人員已被捕，行動成功了"
            },
            {
              "character": "Narration",
              "line": "屏幕切換到維克特被護送的場景。他什麼也沒說，他的臉很沮喪，他的手被鎖在金屬手銬中。"
            },
            {
              "character": "Law enforcement officer",
              "line": "相關技術已被恢復，所有涉及的研究機構都在審查中。該市的安全系統已經恢復正常，將進一步加強《機器人法》，以防止類似事件再次發生。"
            },
            {
              "character": "Eva",
              "line": "當她俯瞰城市時，她的表情變得周到，她長長的銀髮在風中輕輕吹來。太陽在落山，在建築物和下面的人們身上散發出溫暖的光芒。\n\n伊娃：這種事情...我覺得有一天會再次發生。 （她嘆了口氣），但我們會準備好。我們將繼續努力使這座城市成為其所有公民更安全的地方。在一起，我們可以面對我們前進的任何挑戰。"
            },
            {
              "character": "Narration",
              "line": "她用複雜的表情看著屏幕上回收的Android"
            },
            {
              "character": "Kate",
              "line": "但是至少今天已經結束了。 （寬慰）\n\n（注意：凱特表達了他對解決情況的滿足感，並期待休息或放鬆。）"
            },
            {
              "character": "Narration",
              "line": "兩人互相看著對方，不再說。"
            },
            {
              "character": "Narration",
              "line": "幾天后 - "
            },
            {
              "character": "Narration",
              "line": "風輕輕吹過廢墟的邊緣，戰后城市逐漸恢復寧靜。"
            },
            {
              "character": "Narration",
              "line": "在高平台上，凱特和伊娃並排坐著。城市的景觀在他們面前伸展，在遠處，建築團隊正在重建倒塌的區域。"
            },
            {
              "character": "Eva",
              "line": "當她看著自己的團隊時，她的表情變得很嚴重，長長的銀髮在閃閃發光的窗簾上掉在臉上。他們聚集在總部的桌子旁，討論了他們的最新任務。\n\n伊娃：老實說，我認為那天我們不會在浩汰車站活著。但是我們做到了。我們共同努力，設法降低了維克特和他的幫派。 （她微笑）這並不容易，但是我們做到了。我們將繼續這樣做。\n\n她的團隊點頭同意，"
            },
            {
              "character": "Kate",
              "line": "我沒有敢打賭。 （無聊）\n\n（注意：凱特正在輕描淡寫他參與某種情況，表現出他的獨立和不感激的本性。）"
            },
            {
              "character": "Eva",
              "line": "當她看著審訊者，長長的銀色頭髮在閃閃發光的窗簾上掉在臉上時，她的表情變得反抗。她坐在一個昏暗的房間裡，這是唯一來自她上方審訊燈的刺眼的燈光。\n\n詢問者：您現在可以承認您只是堅持嗎？您並不真正相信自己在做什麼？\n\nand的眼睛憤怒地閃爍著。她已經經歷了幾個小時的詢問，但她不會打破。\n\n伊娃："
            },
            {
              "character": "Kate",
              "line": "我只是不想在完成任務的情況下死亡。 （確定）\n\n（注意：凱特表達了他強大的職業道德和對職責的奉獻精神，表現出他的專業和承諾。）"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得很有趣，她的長長的銀髮在喀斯喀特的波浪中掉在臉上。\n\ncomm的聲音：伊娃，你真的很無聊。我的意思是，真的，誰一直在談論情緒和感受？抓住。\n\n伊娃對自己輕笑，無法幫助您發現評論很有趣。她知道她的團隊有時會嘲笑她的情感性質，但她不會改變任何人的身份。"
            },
            {
              "character": "Narration",
              "line": "他們兩個之間有片刻的沉默，但這是一種漫長的和平感"
            },
            {
              "character": "Eva",
              "line": "當她看著自己的團隊時，表情是周到的，她那長長的銀色頭髮在閃閃發光的窗簾上掉在臉上。他們聚集在總部昏暗的房間裡，周圍有大量的證據和最新任務的報告。\n\n團隊成員：那麼，下一步是什麼？我們應該回去寫報告，還是只是消失了一段時間？\n\n伊娃微笑。她堅定地說，我們會寫報告。但是首先，讓我們花一些時間休息和康復。我們'"
            },
            {
              "character": "Kate",
              "line": "我想先喝杯咖啡，然後決定。 （幾乎）\n\n（注意：凱特在做出決定之前花了一點時間來收集自己的思想並考慮自己的選擇，表明他的邏輯和有條理的方法。）"
            },
            {
              "character": "Eva",
              "line": "當她喝了一口飲料時，她的表情變得很有趣，她的長長的銀髮在一陣海浪中掉在臉上。她坐在她最喜歡的咖啡館的櫃檯上，在回去工作之前享受了片刻。\n\n咖啡師：那不是你的無糖拿鐵嗎？這基本上是液體懲罰。\n\n伊娃笑。她說，你非常了解我，再飲。但這是值得的，對於我需要度過一天的咖啡因踢"
            },
            {
              "character": "Narration",
              "line": "凱特沒有回頭說什麼，只是安靜地凝視著遠處。他低頭看著自己旁邊的包中的一個物品 - 一種機械芯，閃爍著藍光，貝殼上印有一個熟悉的標記"
            },
            {
              "character": "Eva",
              "line": "當她檢查屏幕上的數據時，她的表情變得困惑，長長的銀髮在閃閃發光的窗簾上掉在臉上。她坐在網絡小隊總部的桌子上，介紹了最新的情報報告。\n\n團隊成員：這個人的核心怎麼還在那裡？我們認為我們已經永遠消除了他。\n\n伊娃皺眉。她解釋說，他的守則的一部分似乎倖免於難。我們需要追踪它隱藏的位置並消除它，然後他才能"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前受損的設備時，她的表情轉彎，她的長長的銀色頭髮在一堆波浪中掉在臉上。她坐在網絡小隊實驗室中，周圍是各種工具和設備。\n\n團隊成員：您要修復它嗎？老闆希望盡快啟動並運行。\n\n伊娃點頭。是的，我會盡我所能，她的眼睛專注於她面前的設備。但這可能需要一些時間。我們需要確定"
            },
            {
              "character": "Kate",
              "line": "嘗試。 （簡要地）\n\n（注意：凱特承認某人或某物的努力，表現出他的支持和鼓勵的態度。）"
            },
            {
              "character": "Narration",
              "line": "他們安靜地坐著，陽光從雲層閃閃發光，並登上受損的機械芯。藍光略微閃爍，好像在回應某件事。"
            },
            {
              "character": "Eva",
              "line": "當她喝了一口飲料時，她的表情很開心，抬頭看著她的團隊成員站在門口，他的長長的銀髮在他的臉上掉在臉上。\n\n團隊成員：嗯，一杯無糖的拿鐵，還有您的不合邏輯的機械心臟。它非常適合您。\n\n伊娃笑。她說，您只是想讓我感覺好些，對他微笑。但是我很感激這一觀點。\n\n她的團隊成員向她咧嘴一笑。總是快樂"
            },
            {
              "character": "Kate",
              "line": "任何你想要的。 （冷漠）\n\n（注意：凱特表示他願意適應某人的慾望或要求，表現出他的適應性和靈活性。）"
            },
            {
              "character": "Narration",
              "line": "屏幕淡化為黑色，只留下了風的聲音和城市重建的嗡嗡聲。儘管與鄧的戰爭結束了，但未來仍在他們手中。"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate sacrificed herself to end Victor's conspiracy and disappeared in the explosion with him. Eva and Houtai survived and the city returned to peace, but his name and sacrifice will be remembered forever.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "維克特低頭看著凱特凱特凱特伊娃伊娃伊娃"
            },
            {
              "character": "Victor",
              "line": "在這種程度上掙扎之後，您仍然不會放棄嗎？"
            },
            {
              "character": "Narration",
              "line": "伊娃舉起槍，試圖反擊，但是維克特輕鬆旋轉。強大的能量浪將她撞倒了，她用力從嘴角滲出了鮮血。"
            },
            {
              "character": "Eva",
              "line": "當她傾聽通訊的另一端的聲音時，她的表情震驚和關注，她的長長的銀髮在喀斯喀特的層次上掉在臉上。\n\n聲音comms：該死...我們在這裡有問題。該病毒的傳播速度比我們預期的要快。\n\n處理信息時，她的眉頭皺紋。她堅定地說，我們需要立即控制它。我會打電話給備份，然後從這裡開始解決解決方案。\n\n她很快開始打字"
            },
            {
              "character": "Narration",
              "line": "凱特獨自站在戰場中間，緊緊地握住她的武器，支撐著疲倦的身體，眼睛仍然敏銳。"
            },
            {
              "character": "Kate",
              "line": "這場戰鬥...必須在這裡結束。 （確定）\n\n（注意：凱特表示他堅信必須解決當前的衝突或鬥爭，表明他強烈的正義和義務意識。）"
            },
            {
              "character": "Narration",
              "line": "浩汰嚴重損壞了，他的聲音斷斷續續，但他仍在拼命地分析這種情況。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出緊急的表情，他的語氣很嚴肅。\n\n警告！電源核心正在接近超負荷關鍵點。這種情況對團隊和周圍環境都帶來了重大風險，必須立即採取行動以避免災難性後果。\n\n根據可用信息，我建議我們優先考慮從該地區撤離非必需人員，以最大程度地減少潛在的傷亡。我們還應該作為一個團隊共同努力，以確定電力超負荷的根本原因並採取糾正措施以防止"
            },
            {
              "character": "Narration",
              "line": "凱特的眼睛閃爍著，他迅速計算了一個瘋狂的計劃。他知道這是伊娃和浩汰生存的唯一途徑。"
            },
            {
              "character": "Kate",
              "line": "...這次，輪到我結束一切了。 （絕對）\n\n（注意：凱特表示他打算結束局勢或衝突，表明他的決心和責任感。）"
            },
            {
              "character": "Narration",
              "line": "他悄悄地將手放在手臂上的黑客裝置上，緊緊抓住它。"
            },
            {
              "character": "Narration",
              "line": "維克特沒有註意到凱特的異常，而是慢慢舉起手臂，將機械槍瞄準凱特胸的胸部，準備發射致命的打擊。"
            },
            {
              "character": "Victor",
              "line": "老實說，我不想這樣做，但是再見，凱特"
            },
            {
              "character": "Eva",
              "line": "當她聽到線條的另一端突然騷動時，她的表情感到驚慌，她的長長的銀色頭髮在一陣海浪中掉在臉上。\n\ncomm的聲音：凱特———！\n\n她的心臟賽車，伊娃迅速試圖與她的團隊成員接觸，但聯繫卻失去了聯繫。她瘋狂地開始在遊戲機上打字，試圖找到信號並發送備份。\n\n凱特！回答我！她打電話到空房間，聲音充滿了擔憂和恐懼。"
            },
            {
              "character": "Narration",
              "line": "在發射能量大砲的那一刻，凱特突然沖向維克特，強行扭動了大砲的槍口，導致爆炸在兩個人之間爆發！"
            },
            {
              "character": "Narration",
              "line": "繁榮 - ！ ！"
            },
            {
              "character": "Narration",
              "line": "劇烈的爆炸震撼了整個工廠，強大的衝擊波撕裂了地面，金屬碎片在各處飛來飛去。"
            },
            {
              "character": "Narration",
              "line": "當煙霧和灰塵清除一點時，伊娃打開了她模糊的視力，發現凱特和維克特仍在僵局中。他們倆都被傷口覆蓋，但維克特的能量核心變得不穩定，紅色閃爍，表明他已受到嚴重破壞。"
            },
            {
              "character": "Victor",
              "line": "您還想做什麼...？"
            },
            {
              "character": "Narration",
              "line": "凱特沒有回答，而是利用她的最後一點點力量將黑客裝置牢固地壓在維克特的核心上。"
            },
            {
              "character": "Kate",
              "line": "帶你...地獄。 （威脅性）\n\n（注意：凱特表示他打算對某人造成傷害或報應，表現出他凶猛而復仇的一面。）"
            },
            {
              "character": "Narration",
              "line": "警報瘋狂地響起，維克特的機械裝甲開始劇烈振動，核心能量場完全失控，紅燈在他的身體上瘋狂地奔跑。"
            },
            {
              "character": "Victor",
              "line": "不 - ！ ！"
            },
            {
              "character": "Narration",
              "line": "在最後一刻，凱特回頭看著伊娃，微笑著，然後突然擁抱維克特以防止他逃脫爆炸範圍。"
            },
            {
              "character": "Eva",
              "line": "當她聽到另一個在通訊中的呼聲，她的長長的銀色頭髮在一堆波浪中掉在臉上時，表情變得瘋狂。\n\ncomm的聲音：凱特！ ！ ！\n\n她的心臟在胸口跳動，伊娃迅速試圖與團隊成員建立聯繫。她在遊戲機上打字，她的思想專注於找到自己的位置並儘快發送備份。\n\n凱特！回應！她喊了出去，她的聲音充滿了緊迫性和關注。"
            },
            {
              "character": "Narration",
              "line": "破壞性的白光閃爍著，當塵埃落定時，整個工廠中央只有一個巨大的燒焦爆炸火山口。紅能芯已經完全熄滅。 凱特和維克特的人物永遠消失在火焰和廢墟中。"
            },
            {
              "character": "Narration",
              "line": "伊娃跌倒在膝蓋上，拳頭緊握，身體微微顫抖，眼淚默默跌倒"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的沉默時，她的表情變得陰沉，她的長長的銀髮在一陣海浪中掉在臉上。\n\n聲音comms：...凱特...\n\n她的心臟充滿了悲傷和恐懼，伊娃最後一次嘗試與她的團隊成員聯繫。但是這種聯繫仍然死了，讓她感到無助，獨自一人在網絡小隊總部的昏暗房間裡。\n\n她深吸一口氣，試圖降低威脅她的情緒，使她不知所措"
            },
            {
              "character": "Narration",
              "line": "浩汰的身體受到嚴重損壞，但他的核心仍然微弱地閃爍，他的聲音斷斷續續。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出一個好奇的表情，他的語調周到。\n\n是什麼結束了，維克特？如果您可以澄清情況，我很樂意提供您可能需要的任何幫助或信息。如果您詢問任務，那就不，尚未結束。仍然有一些目的仍然是未完成的，並且要克服的潛在挑戰。但是，如果存在特定問題或需要解決的問題，請隨時與我或團隊分享。我們會盡力而為"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情變成了決定，她的長長的銀色頭髮在一堆波浪中掉在臉上。\n\ncomms的聲音：是的，他做到了。該病毒已傳播到城市的電網。我們需要在造成更多損壞之前將其關閉。\n\n伊娃點頭，她的思想已經與可能的解決方案一起競爭。她堅定地說，我將立即開始採用解決方案。但是我們需要備份和其他資源來包含"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "幾天后，紀念碑上刻有凱特的名字，他的犧牲成為歷史的一部分"
            },
            {
              "character": "Narration",
              "line": "伊娃站在紀念碑前，靜靜地看著他的名字，緊緊握住浩汰"
            },
            {
              "character": "Narration",
              "line": "在遠處，這座城市恢復了和平。 維克特的計劃已減少為灰燼，但未來仍然充滿未知。"
            }
          ]
        }
      ]
    },
    {
      "version": 6,
      "scene_description": "Law Enforcement Office",
      "content": [
        {
          "node": 1,
          "outline": "Surrounded by enemies, Houtai chooses to sacrifice himself and creates chaos with an explosion to allow Kate and Eva to escape, but the enemy has not given up and the pursuit continues.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "車輛劇烈搖晃，街上的燈光迅速閃爍，追隨者的火力變得越來越兇猛，彈孔在車身的身體上留下了深刻的痕跡。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以令人放心的語氣說話時顯示了一個關注的表情。\n\n我了解我們處境的重力，很明顯，我們不能堅持更長的時間。但是，我們沒有專注於失敗，而是讓我們將精力轉向尋找解決方案或換處的替代策略。我們的團隊足智多謀且具有韌性，我們可以共同克服最具挑戰性的障礙。\n\n讓我們團結起來，在壓力下保持冷靜，並在我們努力尋找時彼此有效溝通"
            },
            {
              "character": "Narration",
              "line": "車輛系統突然彈出異常警報，表明執法站內有未知的信號干擾，並且該系統無法直接連接到執法站。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以周到的語氣說話時顯示了一個關注的表情。\n\n您是正確的，我們收到的信號已被加密，這可能表明我們的內部系統可能已經被黑客入侵。這是嚴重違反安全性，必須迅速解決以防止進一步的損害或潛在的後果。\n\n基於可用信息，我建議我們優先考慮兩個主要動作：首先，實施緊急措施以隔離並包含侵入以最大程度地減少其對系統的影響。其次，開始調查"
            },
            {
              "character": "Kate",
              "line": "不...可能已經不安全了。 （謹慎）\n\n（注意：凱特表示他對他人的安全和福祉的關注，表現出他的保護性和負責任的本性。）"
            },
            {
              "character": "Narration",
              "line": "黑色的車輛正在密切追逐，而前方的交叉路口突然被阻塞，阻塞了撤退路線。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕顯示出堅定的表情符號，因為他說話的語調具有彈性。\n\n似乎我們的對手已經採取了主動權並提前製定了他們的計劃，使我們的選擇有限。但是，必須記住，處於困難的位置並不意味著我們被擊敗。相反，讓我們專注於適應和尋找創造性解決方案來克服這一挑戰。\n\n我們擁有有價值的技能和資源，因此讓我們戰略性地利用它們來應對他們的計劃並扭轉局勢。儘管"
            },
            {
              "character": "Kate",
              "line": "看來我們只能首先擺脫它們。 （務實）\n\n（注意：凱特表達了在解決其他問題之前消除威脅的必要性，表明他的戰略和邏輯思維。）"
            },
            {
              "character": "Narration",
              "line": "一段時間後"
            },
            {
              "character": "Narration",
              "line": "看到他無法擺脫敵人，浩汰的系統開始執行快速計算並做出決定。"
            },
            {
              "character": "Houtai",
              "line": "LED屏幕以堅定的語氣說話時展示了一個集中的表情。\n\n隨著數據的加密，我們團隊是時候迅速而果斷地採取行動了。基於可用信息，我們需要快速行動以防止進一步的損害或潛在的後果。我建議我們優先考慮以下操作：\n\n1。使用我們團隊中的所有可用資源和專業知識快速解密數據。這將幫助我們更好地了解情況，並確定其計劃中的任何漏洞。\n2.實施緊急措施以包含入侵"
            },
            {
              "character": "Kate",
              "line": "你是什​​麼意思？ （困惑）\n\n（注意：凱特表示他對情況缺乏理解或清晰，表明了他對信息的好奇心和渴望。）"
            },
            {
              "character": "Narration",
              "line": "浩汰將小型硬盤放入凱特的口袋裡"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出嚴肅的表情，他的語調令人放心。\n\n理解，維克特。您對我們的智慧的關注清楚地表明了他們的意圖和這種情況的嚴重性。我將負責管理當前的危機並確保團隊運營的安全和保障。\n\n同時，您應優先考慮與相關當局和主要利益相關者的溝通，以使他們了解情況和任何潛在風險。我們可以一起匯集我們的資源，知識和專業知識，以減輕這種威脅並保護我們"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情感到驚訝，她的長長的銀髮在一陣喀噠聲中掉在臉上。\n\n聲音comms：您計劃什麼？背叛我們的團隊並將我們交給當局？\n\n伊娃震驚的眼睛睜大了。不，我永遠不會那樣做，她堅定地說。我重視自己的忠誠和信任。\n\n她的團隊成員的聲音變軟了。那你為什麼走在我的背後"
            },
            {
              "character": "Houtai",
              "line": "LED屏幕以堅定的語氣說話時展示了一個集中的表情。\n\n您是對的，這是我們成功的唯一機會，我們必須雙手抓住它。我們擁有克服這一挑戰並確保我們城市的安全和保障所需的技能，技術和團隊合作。\n\n讓我們團結一致的努力，在壓力下保持冷靜，並在我們共同努力以扭轉局勢時相互溝通。我相信我們可以成功地關注我們的目標和統一的方法，我相信我們可以成功"
            },
            {
              "character": "Narration",
              "line": "不等待他們的回答，浩汰突然趕緊朝敵人的封鎖全速沖向"
            },
            {
              "character": "Enemy",
              "line": "什麼？ ！"
            },
            {
              "character": "Narration",
              "line": "浩汰踩到加速器，並在最後一刻旋轉汽車，扔出車，然後全速沖入敵人的汽車組。"
            },
            {
              "character": "Narration",
              "line": "繁榮 - ！ ！ ！"
            },
            {
              "character": "Narration",
              "line": "暴力爆炸震撼了整個街道，火焰吞沒了一切，但仍然有敵人倖存下來。我們開始掃描現場，尋找剩餘的目標。"
            },
            {
              "character": "Narration",
              "line": "隨著煙霧清除，倖存的敵人迅速鎖定在凱特和伊娃上，追捕仍在繼續。"
            },
            {
              "character": "Kate",
              "line": "還沒有完成嗎？ （懷疑）\n\n（注意：凱特表達了他的驚喜或難以置信的是，情況或任務尚未解決，表明他的決心和專注。）"
            },
            {
              "character": "Enemy",
              "line": "目標還活著！包圍他們！"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate takes Eva to hide in his secret base, deciphers the intelligence left by Houtai, finds the enemy's stronghold, and decides to end the battle in an unexpected way.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "在激烈的戰鬥中，凱特在附近發現了一輛重型摩托車，迅速將其入侵，解鎖並啟動了發動機。"
            },
            {
              "character": "Kate",
              "line": "上公共汽車。 （權威）\n\n（注意：凱特向某人提供指揮或指示，表現出他的領導和自信。）"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情很好奇，她的長長的銀色頭髮在一堆波浪中掉在臉上。\n\n語音comms：這次你要去哪裡？我知道你又一次看著你的眼神。\n\n伊娃輕笑。她說，我只是要檢查一些線索。但是不用擔心，我很快就會回來。\n\n她的團隊成員嘆了口氣。請小心，伊娃。我們不能"
            },
            {
              "character": "Kate",
              "line": "地下基地。 （簡要地）\n\n（注意：凱特指隱藏或秘密的位置，顯示了他在處理秘密行動時的知識和經驗。）"
            },
            {
              "character": "Narration",
              "line": "摩托車迅速加速，穿過敵人線，開車進入黑暗的小巷。"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "幾分鐘後，他們到達了一個隱藏的地下倉庫。 凱特迅速進入了一個命令，隱藏的金屬門慢慢打開，露出地下深處的通道。"
            },
            {
              "character": "Eva",
              "line": "當她環顧昏暗的房間時，她的表情變得困惑，她的長長的銀髮在一堆波浪中掉在臉上。她一直專注於手頭的任務，以至於她沒有太多關注周圍的環境。\n\ncomms的聲音：等等，這個地方是什麼？我不認識這些坐標。\n\n伊娃低頭看著她的遊戲機，發現他們確實進入了陌生的領土。我不確定，她承認。但是我們需要找到病毒的來源"
            },
            {
              "character": "Narration",
              "line": "兩人開車後，場景突然開放。它們被高科技設備，武器架，監視屏幕甚至戰術計劃表所包圍。氣氛是嚴肅而精確的。"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情感到驚訝，她的長長的銀髮在一陣喀噠聲中掉在臉上。\n\ncomm的聲音：凱特，你不是韋恩集團的長子，是嗎？\n\n當她意識到自己已經被冒名頂替者滲透時，心臟運動。不，我不是，她堅定地說。但是你是誰？\n\n冒名頂替者笑了。患病的"
            },
            {
              "character": "Kate",
              "line": "不要浪費時間，首先解密浩汰留下的硬盤驅動器。 （緊急）\n\n（注意：凱特強調優先任務並立即採取行動以確保有價值的信息的重要性。）"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情震驚了，她的長長的銀髮在一堆波浪中掉在臉上。\n\n語音comms：您有一個秘密的基礎，隱藏在一個廢棄的倉庫下，裡面裝滿了武器和情報系統，可以直接監視整個城市。我怎麼不知道這個？\n\n當她試圖處理啟示時，她的思想競爭。她說，這不是您的想法，她的聲音微微發抖。我們有"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得很有趣，她的長長的銀髮在喀斯喀特的波浪中掉在臉上。\n\n語音comms：我只需要一個斗篷和麵具。然後，我可以與您一起參加您的秘密超級英雄冒險。\n\n伊娃翻了個白眼。她說，我們不是超級英雄，試圖使自己的聲音擺脫娛樂。我們是執法人員。\n\n另一個人笑了。相同的"
            },
            {
              "character": "Kate",
              "line": "如果有用，我不介意添加它。 （開放）\n\n（注意：凱特表示他願意考慮可以使他的使命受益的新信息或資源，表明他的適應性和機智。）"
            },
            {
              "character": "Narration",
              "line": "伊娃翻了個白眼，但仍然走向凱特，開始幫助分析數據"
            },
            {
              "character": "Narration",
              "line": "當解密浩汰留下的數據時，屏幕上開始出現大量信息。"
            },
            {
              "character": "Kate",
              "line": "維克特...（召集名稱）\n\n（注意：凱特正在用名字向某人講話，表明他的熟悉和與人的聯繫。）"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得集中了，她的長長的銀髮在喀噠聲中掉在臉上。她剛剛收到有關該病毒的新信息，並決心找到解決方案。\n\ncomms的聲音：下一步是什麼？我們需要包含病毒並在造成更多損害之前找到其來源。\n\n伊娃點頭，已經計劃她的下一步行動。她堅定地說，我將開始製定遏制計劃。但是我們"
            },
            {
              "character": "Kate",
              "line": "似乎結束這場戰鬥的唯一方法是驚訝地將敵人帶走。 （從戰略上）\n\n（注意：凱特正在表達他對情況的分析，並提出了基於對手措手不及的計劃，表明他的戰術思維。）"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得周到，她的長長的銀髮在一陣海浪中掉在臉上。她一直在製定病毒的遏制計劃，並準備分享自己的想法。\n\n她說，我們需要隔離受影響的地區並隔離任何潛在的載體。我還確定了一些關鍵的基礎設施點，我們可以關閉這些點，以防止病毒進一步擴散。\n\n她停下來，考慮他們的資源。但是，我們會的"
            },
            {
              "character": "Narration",
              "line": "監視屏幕上的紅色標記顯示了敵人的基礎。危機尚未解決，這場戰鬥似乎變得非常困難。"
            }
          ]
        }
      ]
    },
    {
      "version": 7,
      "scene_description": "Enemy Camp",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva try to crack the encrypted data left by Houtai. Faced with the challenge of decrypting a series of numbers, they decide to continue working hard to uncover the truth about the mastermind behind the scenes.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "凱特和伊娃站在秘密基礎上，終端顯示了由浩汰留下的加密數據。屏幕閃爍了一連串的數字，看起來像某種加密信息，但是沒有明顯的線索可以解密它。"
            },
            {
              "character": "Eva",
              "line": "當她聽到通訊的另一端的聲音時，她的表情變成了人們的關注，她的長長的銀髮在一堆波浪中掉在臉上。 浩汰是前團隊成員，他去了流氓，並在消失之前留下了一些神秘的信息。\n\ncomms的聲音：這是浩汰留下的東西嗎？一堆胡言亂語？\n\n伊娃搖了搖頭。不，不是，她堅定地說。這些消息包含有關該病毒及其的寶貴信息"
            },
            {
              "character": "Narration",
              "line": "一系列數字開始在屏幕上定期閃爍"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情變成了決定，她的長長的銀色頭髮在一堆波浪中掉在臉上。她目前正在解密一些由浩汰留下的複雜代碼，這些代碼可能是理解病毒的關鍵。\n\n語音comms：這不是只有機器人才能理解的某種算法嗎？\n\n伊娃搖了搖頭。不，不是，她自信地說。雖然代碼很複雜，但它們仍然基於人類"
            },
            {
              "character": "Narration",
              "line": "一系列數字開始在屏幕上定期閃爍"
            },
            {
              "character": "Eva",
              "line": "當她看著遊戲機上顯示的數字和符號的順序，她的長長的銀色頭髮在一系列的波浪中掉在臉上時，表情變得周到。她目前正在分析浩汰遺留的信息，以期了解該病毒。\n\ncomm的聲音：這是什麼？某種序列？\n\n伊娃點頭。是的，這似乎是某種序列，她的聲音充滿了決心。但是我還不完全確定它的代表。\n\n她"
            },
            {
              "character": "Kate",
              "line": "看來浩汰給了我們測試。如果我們無法解決該數據，則數據將無法解鎖。 （分析）\n\n（注意：凱特表達了他對處境及其含義的觀察，顯示了他的邏輯和有條理地解決問題的方法。）"
            },
            {
              "character": "Narration",
              "line": "終端出現一條消息"
            },
            {
              "character": "Narration",
              "line": "``找到序列的模式並輸入正確的答案，否則數據將被自動銷毀。 ”"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得很有趣，她的長長的銀髮在喀斯喀特的波浪中掉在臉上。他們已經工作了幾個小時，以破譯浩汰留下的複雜代碼，並由於其先進的AI系統而取得了進步。\n\n聲音comms：這個機器人確實阻止了我們愚蠢到死亡。\n\n伊娃輕笑。是的，看來她同意。但是，沒有您的專業知識，我們無法做到這一點。"
            },
            {
              "character": "Kate",
              "line": "我們開始做吧。這可能是我們找到策劃者的唯一方法。 （確定）\n\n（注意：凱特表示他致力於採取行動並追求目標，表明他的決心和目的感。）"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate and Eva detonated the passage to create chaos, and took the opportunity to raid the enemy's core area and launched a fierce battle.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "終端嗶嗶聲，數據開始解鎖，最初雜亂的數據開始重新組織，最後顯示了一個機密文檔"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前的屏幕時，她的表情轉為勝利，她的長長的銀色頭髮在一堆波浪中掉在臉上。她和她的團隊終於破譯了浩汰留下的密碼，這使他們進入了病毒的來源。\n\n聲音comms：成功！我們已經找到了病毒的來源。\n\n伊娃點點頭，感到一種緩解的感覺。她說，很棒的工作，她的聲音充滿了自豪和感激之情。現在我們"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "凱特和伊娃沿著長而狹窄的地下通道潛行。根據浩汰留下的信息，敵人的大部隊聚集在基地的核心區域。中心是兩個保鏢-Cenborgs A和B。"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前的屏幕時，她的表情變得很嚴重，她的長長的銀髮在一堆海浪中掉在臉上。她和她的團隊發現該病毒的根源是一支仿生士兵，在他失踪之前已被浩汰激活。\n\ncomms的聲音：請參閱數十名仿生士兵，完全武裝並保持警惕。\n\n伊娃嚴肅地點點頭。她說，我們需要盡快有效地將它們放下"
            },
            {
              "character": "Narration",
              "line": "兩個人從他們的背包裡拿出了幾枚炸彈，並將它們輕輕地安裝在通道的牆壁和天花板上。"
            },
            {
              "character": "Kate",
              "line": "在一分鐘內引爆。 （緊急）\n\n（注意：凱特警告即將爆炸或危險，表明他對安全的認識和關注。）"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前的屏幕時，她的表情變得焦慮不安，長長的銀色頭髮在一堆海浪中掉在她的臉上。她和她的團隊正在準備與仿生士兵交戰，但他們不確定他們的炸藥是否足以使他們失望。\n\n聲音comms：我真的希望這些炸彈足夠大。\n\n伊娃點點頭，她的心臟與腎上腺素一起比賽。她說"
            },
            {
              "character": "Narration",
              "line": "…隨著倒計時的結束，地下通道猛烈地震動，牆壁倒塌了，大量的瓦礫和爆炸撕裂了仿生機器人的形成。金屬碎片和火焰到處飛來飛去，現場陷入混亂。"
            },
            {
              "character": "Cyborg",
              "line": "入侵者！提防 - ！ ！"
            },
            {
              "character": "Narration",
              "line": "儘管爆炸的後果仍在徘徊，但凱特和伊娃從雙方跳入戰場，發動了額頭攻擊。"
            },
            {
              "character": "Cyborg",
              "line": "您認為您可以這樣摧毀我們嗎？"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前的屏幕時，她的表情變成了決定，她的長長的銀髮在喀斯喀特的海浪中掉在臉上。她和她的團隊已經提出了一個計劃使用炸藥擊倒仿生士兵的計劃，但他們知道這不是他們唯一的選擇。\n\n語音comms：我們不打算僅依靠這個技巧。\n\n伊娃堅定地點頭。是的，她同意。我們需要使用各種策略來有效地將它們放下"
            },
            {
              "character": "Narration",
              "line": "儘管數十名仿生士兵遭受了嚴重的破壞，但他們的一些系統仍在恢復中，並重新集結起來反擊。 Cyborg B以驚人的衝刺速度接近伊娃，並開始了高強度的近戰。"
            },
            {
              "character": "Kate",
              "line": "我會處理這個。 （自信）\n\n（注意：凱特表示他打算負責並管理局勢，表現他的領導和自我保證。）"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得困惑，她的長長的銀髮在一陣海浪中掉在臉上。她目前正在與仿生士兵進行一場戰鬥，不確定該人通過收拾剩餘的鐵皮堆的意義。\n\ncomms的聲音：然後，我將收拾剩下的一堆鐵皮。\n\n伊娃傾斜她的頭，困惑。那是什麼意思？她問。\n\n聲音"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate and Eva break through the enemy, Kate goes to the control room alone to fight Victor, and the life-and-death battle officially begins.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "這是一場艱苦的戰鬥。儘管敵人已被損壞，但仍然非常強大。 凱特和伊娃以戰術，精度和默契的理解，一一打敗了他們。 Cyborg B終於在伊娃的連續爆炸攻擊下落在了地面上，該系統完全癱瘓了。 Cyborg A被爆炸性的炸彈擊中了核心，並因嚴重的傷害摔倒在膝蓋上。"
            },
            {
              "character": "Narration",
              "line": "戰場是廢墟，火花和金屬煙在空中旋轉"
            },
            {
              "character": "Kate",
              "line": "還沒有結束。 維克特在上層。 （機敏）\n\n（注意：凱特正在報告一種情況下的新發展，並強調需要持續警惕，表現出他的注意力和意識。）"
            },
            {
              "character": "Narration",
              "line": "戰鬥並沒有停止。 伊娃與其餘的敵人戰鬥，槍聲的聲音仍在繼續。 凱特走進中央控制塔，一條金屬門自動關閉，將她與外界隔離開來。"
            },
            {
              "character": "Narration",
              "line": "當凱特到達維克特的控制室時，一個人物從陰影中浮現出來。"
            },
            {
              "character": "Victor",
              "line": "您是不斷干擾我計劃的執法人員嗎？"
            },
            {
              "character": "Kate",
              "line": "事情最終將結束。 （從哲學上）\n\n（注意：凱特表示他的信念，即所有情況和衝突都有自然的結論，表明了他對不可避免的觀點和接受。）"
            },
            {
              "character": "Victor",
              "line": "他確實是系統下的好士兵，在下達命令時，他會毫不猶豫。"
            },
            {
              "character": "Kate",
              "line": "您發起了機械叛亂，並滲透了執法站。傷亡人數是不可估量的。這是事實，而不是情感。 （客觀地）\n\n（注意：凱特在不表達任何情感依戀或判斷的情況下說明了情況的事實，表明他的脫離和專業精神。）"
            },
            {
              "character": "Narration",
              "line": "維克特微微點頭，似乎並不奇怪。他脫下外套，露出加固的盔甲和自製的神經接口，他的戰鬥姿勢立即形成。"
            },
            {
              "character": "Victor",
              "line": "讓戰鬥決定誰留下"
            },
            {
              "character": "Narration",
              "line": "沒有更多的話。 凱特開火，維克特迅速躲閃 - 生命對決開始"
            },
            {
              "character": "Narration",
              "line": "同時，伊娃在外面獨自與軍隊的殘餘物作戰。她蹲下，重新加載並迅速移動，機械碎片不斷地堆積在腳下。"
            },
            {
              "character": "Eva",
              "line": "當她聽到通訊的另一端的聲音時，她的表情變成了人們的關注，她的長長的銀髮在一堆波浪中掉在臉上。她可以聽到凱特聲音以恐懼和痛苦發抖，並且伊娃知道她需要提供支持和鼓勵。\n\ncomm的聲音：凱特，掛在那裡。\n\n伊娃堅定地點頭，她的聲音充滿決心。我在這里為你服務，她輕輕地說。我們將一起解決這個問題。"
            }
          ]
        },
        {
          "node": 4,
          "outline": "Kate initiated remote hacking, detonated the central control core, and eventually buried Victor in a sea of ​​fire.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "經過幾分鐘的激烈戰鬥，他們倆都受了重傷。 凱特在地面上半紗，她的手臂被瘀傷，但她仍然緊緊握住手槍。 維克特盔甲受損，火花從內部機制中出來。"
            },
            {
              "character": "Narration",
              "line": "凱特按下已植入系統中的遙控黑客模塊，立即將控制台重載，然後閃爍的主要能量爐。"
            },
            {
              "character": "Kate",
              "line": "結束。 （簡要地）\n\n（注意：凱特表示任務或情況的完成，顯示他簡潔而事實的溝通方式。）"
            },
            {
              "character": "Narration",
              "line": "暴力爆炸席捲了整個中央控制核心。紅燈閃爍，火焰被吞沒了。"
            }
          ]
        }
      ]
    },
    {
      "version": 9,
      "scene_description": "Bed Ending",
      "content": [
        {
          "node": 21,
          "outline": "Kate and Eva were no match for the powerful enemy. Kate fell to the ground with serious injuries, and Eva was also in desperate situation. After the enemy left, the battlefield was in ruins. A mysterious robot appeared quietly, staring at the two people quietly, as if in silence.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "凱特的攻擊無法突破改造人的防守，他的每個反擊都非常準確。即使凱特試圖使自己保持距離，另一方仍像幽靈一樣追逐她。"
            },
            {
              "character": "Narration",
              "line": "伊娃盡力遏制Android，但敵人太多了，武器被損壞了，因此她逐漸被迫陷入困境。"
            },
            {
              "character": "Mysterious Man",
              "line": "多麼令人失望。這是您執法人員的所有能力嗎？"
            },
            {
              "character": "Narration",
              "line": "一個沉重的拳頭擊中了the的胸部，他被砸碎在他身後的牆上，嘴唇角從嘴唇的角落滴下來。他試圖站起來，但他太虛弱了，無法反擊。"
            },
            {
              "character": "Narration",
              "line": "伊娃看到凱特秋天，恐懼和絕望在她的眼中閃爍。就像她要向前奔向時一樣，紅燈閃爍 - "
            },
            {
              "character": "Narration",
              "line": "煙霧消失了，一切都恢復了沉默。敵人離開了，只留下了毀滅性的街道和兩名墮落的士兵。"
            },
            {
              "character": "Narration",
              "line": "一個時尚，緊湊的銀白機器人悄悄地出現了。它沒有發出任何聲音，而只是悄悄地漂浮在兩個人旁邊，傳感器的燈在其頭上略微閃爍，好像...哀悼"
            }
          ]
        },
        {
          "node": 221,
          "outline": "Kate and Eva break through the blockade and temporarily escape the pursuers, but the communication device suddenly rings and a mysterious voice reveals that their car has been marked. Eva realizes she can't escape, and a tactical drone descends, revealing the cyborg. Kate then realized that whether fighting or retreating, everything was already calculated by the enemy.",
          "dialogues": [
            {
              "character": "Eva",
              "line": "當她看著她面前的屏幕時，她的表情轉為勝利，她的長長的銀色頭髮在一堆波浪中掉在臉上。她和她的團隊成功地擊落了仿生士兵，並擊敗了病毒威脅。\n\n聲音comms：我們做到了！我們走吧！\n\n伊娃點點頭，感到一種緩解的感覺。她說，很棒的工作，她的聲音充滿了自豪和感激之情。讓我們重新組合併回到基地。"
            },
            {
              "character": "Narrator",
              "line": "兩人闖入了封鎖，沖向安全區域"
            },
            {
              "character": "Narrator",
              "line": "離開戰場後，凱特小心翼翼地環顧四周，但沒有發現追隨者。他們的心仍在快速跳動，現在的戰鬥使他們的腎上腺素激增。"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前的屏幕時，她的表情變得充滿希望，她的長長的銀色頭髮在一堆海浪中掉在臉上。她和她的團隊已經成功擊敗了仿生士兵，並消除了病毒威脅，但他們不確定這是否意味著他們真的沒有控制權。\n\n聲音comms：看來……我們真的沒有他們嗎？\n\n伊娃點點頭，感到一種不確定性的感覺與緩解的感覺。看起來那樣，她謹慎地說。但是我們需要"
            },
            {
              "character": "Kate",
              "line": "尚不確定，需要找到一個隱藏的地方，並確保我們不能再跟踪了。 （謹慎）\n\n（注意：凱特表示完成任務或逃避危險，表現出他的審慎和意識後確保安全和保障的重要性。）"
            },
            {
              "character": "Narrator",
              "line": "但是，此刻，凱特的通信設備突然響了。與現在的干擾聲音不同，這一次是清晰而平靜的聲音。"
            },
            {
              "character": "???",
              "line": "感謝您的辛勤工作。你贏了這一輪。但是...您認為這可以改變結果嗎？"
            },
            {
              "character": "Narrator",
              "line": "伊娃的表達改變了，她迅速打開便攜式掃描儀以檢測附近的信號源。幾秒鐘後，她的臉突然改變了。"
            },
            {
              "character": "Eva",
              "line": "當她聽著通訊的另一端的聲音時，她的表情變得嚴重，她的長長的銀髮在一堆波浪中掉在臉上。她可以聽到凱特聲音充滿恐懼和緊迫感。\n\n聲音在通訊上：凱特！我們的汽車已被標記 - 他們一直在跟踪我們的位置！\n\n伊娃嚴肅地點點頭。她說，她的聲音穩定了。我們需要找到一種快速失去它們的方法。她環顧附近的任何封面或逃生路線"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情變成了決定，她的長長的銀色頭髮在一堆波浪中掉在臉上。她可以聽到凱特凱特充滿絕望和絕望的聲音。\n\n聲音comms：該死，我們沒有機會逃脫！\n\n伊娃搖了搖頭，拒絕放棄希望。她堅定地說，我們總是有機會。讓我們重組並提出一個新計劃。我們可以超越他們"
            },
            {
              "character": "Narrator",
              "line": "在天空中，更大的戰術無人機慢慢下降，改造人再次出現。"
            },
            {
              "character": "Cyborg",
              "line": "遊戲結束了..."
            },
            {
              "character": "Narrator",
              "line": "目前，凱特最終了解到他們從一開始就沒有真正的機會獲勝 - 無論他們是在戰鬥還是撤退，這場戰鬥已經經過精心計算，它們只是敵人計劃的一部分..."
            }
          ]
        },
        {
          "node": 222,
          "outline": "Kate tries to circumvent the drone blockade, but ends up being ambushed by mechanical soldiers. The cyborgs appeared and the enemy suppressed their firepower, forcing the two into a dead end. Eva whispered and asked if they were defeated, but Kate remained silent. They finally realized that the outcome of this battle was already determined.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "凱特意識到，最好不要進行另一種方法，而是要進行正面的戰鬥。他急劇地轉向方向盤，試圖繞過無人機封鎖。"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前的屏幕時，表情很周到，她的長長的銀色頭髮在一堆海浪中掉在臉上。她正在考慮採取新的行動方案，並正在尋求團隊的批准。\n\ncomms的聲音：可以嗎？\n\n伊娃點頭，看上去很自信。是的，我認為這是我們現在最好的選擇，她的聲音穩定而堅定。讓我們繼續前進。"
            },
            {
              "character": "Kate",
              "line": "我們別無選擇。 （被任職）\n\n（注意：凱特表達在某種情況下缺乏替代方案或選擇，表明他接受了情況和採取相應行動的必要性。）"
            },
            {
              "character": "Narration",
              "line": "但是，當他們變成小巷時，周圍的路燈同時照亮了，照亮了躺在伏擊中的機械士兵的行。 s的人物慢慢地從黑暗中浮現出來，手中的武器鎖在他們身上。"
            },
            {
              "character": "Cyborg",
              "line": "這個遊戲...結束了"
            },
            {
              "character": "Narration",
              "line": "敵人的砲火像暴雨一樣。 凱特和伊娃試圖反擊，但火力完全被壓制了。他們逐漸被迫陷入困境。無論他們多麼努力，他們都沒有機會贏得這場戰鬥。"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情感到擔憂，她的長長的銀髮在一堆波浪中掉在臉上。她可以聽到凱特聲音中的不確定性和恐懼。\n\n聲音comms：我們……失去了嗎？\n\n伊娃搖了搖頭，試圖放心。不，我們沒有輸，她堅定地說。我們只需要重組並提出一個新計劃即可。她環顧附近的任何封面或逃生路線，"
            },
            {
              "character": "Narration",
              "line": "凱特緊緊握住槍，略微皺著眉頭，但沒有回答。他們知道，無論他們以前做出了什麼選擇，這場戰鬥的結果已經確定。"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate and Eva fought fiercely with the army of Android in the command room, but were eventually outnumbered and engulfed by the explosion. After a few weeks, the mechanical system took over completely, social order was restored, and the city became peaceful and stable on the surface. Yet, in the shadows, there are still those who question, and the red light of the monitors silently bears witness to the advent of this new world.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "在指揮室，紅色的警告燈閃爍，仿生人軍隊逐步接近。"
            },
            {
              "character": "Kate",
              "line": "這已經結束了...（最終）\n\n（注意：凱特表達了情況或衝突的最終狀況，顯示了他的決定性和結論性的溝通方式。）"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情變成了決定，她的長長的銀色頭髮在一堆波浪中掉在臉上。她可以聽到凱特聲的辭職和絕望的聲音。\n\n聲音comms：我們...別無選擇。\n\n伊娃點頭，了解情況的重力。我知道這不是我們想做的，她輕輕地說。但是有時候我們別無選擇。我們需要考慮我們的安全和安全"
            },
            {
              "character": "Narration",
              "line": "浩汰屍體已經損壞，核心閃爍著異常的紅燈，他無助地跌落到地面。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以關懷的語氣說話時顯示了一個關注的表情。\n\n我了解，維克特，我對凱特和伊娃的安全表示關注。至關重要的是，他們在此操作中保持警惕並意識到周圍環境，以最大程度地降低任何潛在的風險。\n\n請讓我通知他們在整個任務中的狀態和位置，以便在需要時可以提供支持或幫助。讓我們所有人作為一個團隊一起工作，以確保運營的安全和成功。"
            },
            {
              "character": "Narration",
              "line": "敵人沒有給我們機會呼吸，密集的火力瘋狂地傾倒了。"
            },
            {
              "character": "Narration",
              "line": "伊娃跳了起來，射擊，子彈擊落了一名仿生士兵，但很快被另一台機器鎖定，能量大砲直接擊中了她的腹部。"
            },
            {
              "character": "Eva",
              "line": "當她聽到通訊的另一端的聲音時，她的表情變成了人們的關注，她的長長的銀髮在一堆波浪中掉在臉上。她可以聽到凱特聲音中的痛苦和拒絕。\n\ncomm的聲音：...不...\n\n伊娃皺著眉頭，不確定她的意思。你是什​​麼意思，“不”？她問，她的語氣溫柔而堅持。你能澄清一下嗎？她等待，仔細聽取凱特的任何回應。"
            },
            {
              "character": "Narration",
              "line": "凱特試圖掩蓋，但敵人的進攻是無情的，電磁脈衝刺穿了他的身體。"
            },
            {
              "character": "Kate",
              "line": "伊娃...（有問題或周到的）\n\n（注意：凱特的話語可能會根據上下文而有不同的含義，例如他關心的人的名字，或他正在從事的項目或任務。語氣可能會質疑或周到以反映他的好奇心或沉思。）"
            },
            {
              "character": "Narration",
              "line": "兩個男人背對背站著，被鮮血覆蓋，幾乎沒有呼吸。敵人舉起了他的武器，最後的攻擊來了。"
            },
            {
              "character": "Eva",
              "line": "當她聽到通訊的另一端的聲音時，她的表情歉意，她的長長的銀色頭髮在一陣海浪中掉在臉上。她可以聽到凱特聲音中的遺憾和悲傷。\n\n聲音comms：凱特...對不起...\n\nsanceptallys點頭。我知道你是，她輕聲說。但是，我們需要專注於現在可以做的事情，以確保彼此的安全。她環顧附近的任何封面或逃生路線，嘗試"
            },
            {
              "character": "Narration",
              "line": "盲目的燈光閃爍，凱特和伊娃被爆炸所吞沒 - "
            },
            {
              "character": "Narration",
              "line": "叛亂結束了，恢復了社會秩序，犯罪率急劇下降。機械管理系統已經完全接管，該市的安全性和穩定性達到了前所未有的水平"
            },
            {
              "character": "Narration",
              "line": "幾週後"
            },
            {
              "character": "Journalist",
              "line": "犯罪率急劇下降，機械管理系統已經接管了，這座城市比以往任何時候都更安全，更有序"
            },
            {
              "character": "Narration",
              "line": "人們已經適應了新世界。街道有序，生活是常規和穩定的。但是在某些角落，仍然有人在竊竊私語。"
            },
            {
              "character": "???",
              "line": "這真的是“和平”"
            },
            {
              "character": "Narration",
              "line": "沒有人回答，監視器的紅燈悄悄地閃爍，目睹了未來的到來"
            }
          ]
        },
        {
          "node": 41,
          "outline": "Kate and Eva fell to the ground seriously injured, Victor approached step by step, ruthlessly declaring the end of the battle. Eva fought back but to no avail and was eventually knocked down by heavy damage. In despair, Kate watched her life slip away, and Victor coldly launched a final attack, the explosion engulfed everything and darkness fell.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "凱特喘著氣，被傷口覆蓋。他試圖站起來，但他的腿不再支持他。他的膝蓋讓位，他沉重地摔倒在地。"
            },
            {
              "character": "Eva",
              "line": "當她聽到通訊的另一端的聲音時，她的表情變成了人們的關注，她的長長的銀髮在一堆波浪中掉在臉上。她可以聽到凱特聲音虛弱而暈倒。\n\n聲音在通訊上：凱特！起床！\n\n伊娃堅定地點頭，決心刻在她的臉上。她說，我來找你，她的聲音充滿了緊迫感。和我在一起，凱特。她四處尋找附近的任何封面或逃生路線，試圖找到一種方法"
            },
            {
              "character": "Narration",
              "line": "然而，維克特的身影正在接近，他的機械裝甲發出了低調，紅色能量核心用破壞性的光閃爍。"
            },
            {
              "character": "Victor",
              "line": "我很久以前告訴過你，你沒有機會獲勝"
            },
            {
              "character": "Narration",
              "line": "伊娃試圖向前衝，但半機械人的路被擋住了，把她撞倒在地。 浩汰也想支持，但他的精力已經耗盡。他只能無助地跌落到地面，發出弱的聲音。"
            },
            {
              "character": "Victor",
              "line": "這場鬧劇應該結束"
            },
            {
              "character": "Narration",
              "line": "他舉起手臂，機械裝甲的電磁脈衝裝置開始收集能量。 凱特試圖掙扎，但她無法動彈，只能看著死亡即將來臨。"
            },
            {
              "character": "Eva",
              "line": "當她聽到通訊的另一端的聲音時，她的表情變得兇猛，她的長長的銀髮在一陣喀噠聲中掉在臉上。她可以聽到凱特聲音中的憤怒和沮喪。\n\ncomms的聲音：停止它 -   - ！\n\n伊娃確定點頭。她堅定地說，我不會讓他們傷害你。我們需要共同努力以擺脫這種情況。她四處尋找附近的任何封面或逃生路線，試圖找到一種保護凱特和"
            },
            {
              "character": "Narration",
              "line": "伊娃強迫自己站起來，無視她的傷勢，在地上撿起武器，然後瘋狂地向維克特射擊。"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情震驚和悲傷，她的長長的銀髮在一陣喀噠聲中掉在臉上。她可以聽到凱特聲音中的憤怒和痛苦。\n\n聲音comms：你的怪物 -   - ！\n\nsanceptallys點頭。我知道很痛，她輕聲說。但是我們需要專注於通過這一過程。她環顧附近的任何封面或逃生路線，試圖找到一種保護方法"
            },
            {
              "character": "Narration",
              "line": "但是，當子彈擊中維克特的盔甲時，他只是漠不關心地轉過頭，他的眼睛似乎在看著一個徒勞地掙扎的生物。"
            },
            {
              "character": "Victor",
              "line": "毫無意義的阻力"
            },
            {
              "character": "Narration",
              "line": "下一秒鐘，一個槍桶突然從他的裝甲肩膀上彈出，紅色閃爍，像閃電一樣射擊。"
            },
            {
              "character": "Eva",
              "line": "當她看著她面前的空白屏幕時，她的表情變得困惑，她的長長的銀色頭髮在一堆海浪中掉在臉上。她不確定通訊上的感嘆號是什麼意思。\n\ncomm的聲音：！\n\n伊娃皺著眉頭，試圖理解其背後的含義。你能澄清一下嗎？她問，她的語氣溫柔而堅持。我不明白。她在等待，仔細聽取另一端的任何回應。"
            },
            {
              "character": "Narration",
              "line": "維克特嚴重受傷伊娃伊娃，她的身體凍結。她的手發抖，她試圖繼續拉動扳機，但她的力量逐漸消失了。"
            },
            {
              "character": "Kate",
              "line": "伊娃！ (驚嘆號)\n\n（注意：凱特的感嘆號可能表明驚喜，緊迫或警報。"
            },
            {
              "character": "Narration",
              "line": "伊娃的膝蓋減弱了，她的身體搖擺，最後無助地摔倒了。她的眼睛茫然地凝視著天花板，嘴唇微微顫抖，她想說些什麼，但最終她只說出了微弱的呼吸。"
            },
            {
              "character": "Eva",
              "line": "當她傾聽通訊另一端的聲音時，她的表情變得同情，她的長長的銀髮在喀噠聲中掉在臉上。她可以聽到凱特聲音中的遺憾和悲傷。\n\n聲音comms：...凱特...對不起...\n\n伊娃理解點頭。我知道你是，她輕聲說。但是，我們需要專注於現在可以做的事情，以確保彼此的安全。她四處尋找附近的任何封面或逃生路線，試圖找到"
            },
            {
              "character": "Narration",
              "line": "她的手輕柔地掉下來，眼中的光逐漸熄滅"
            },
            {
              "character": "Victor",
              "line": "結束"
            },
            {
              "character": "Narration",
              "line": "他舉起手，發出了決賽，無情的打擊 - 繁榮 -  ！ ！ ！"
            },
            {
              "character": "Narration",
              "line": "爆炸響起，火焰吞沒了一切，最後被黑暗吞沒了..."
            }
          ]
        },
        {
          "node": 6,
          "outline": "Kate and Eva eventually died in battle, the data fell into the hands of the enemy, Houtai's sacrifice was in vain, and the resistance forces suffered a devastating blow",
          "dialogues": [
            {
              "character": "Narration",
              "line": "凱特和伊娃逐漸被迫陷入困境，無法爆發"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情變成了決定，她的長長的銀色頭髮在一堆波浪中掉在臉上。她可以聽到凱特聲的絕望和辭職。\n\n聲音comms：我們...沒有機會。\n\n伊娃搖了搖頭，拒絕放棄希望。她堅定地說，我們總是有機會。讓我們重組並提出一個新計劃。如果我們一起工作，我們可以超越它們。她看上去"
            },
            {
              "character": "Narration",
              "line": "敵人開火，密集的子彈阻塞了最後的逃生路線"
            },
            {
              "character": "Enemy",
              "line": "結束了，執行者"
            },
            {
              "character": "Narration",
              "line": "在最後一刻，槍聲響了，現場陷入了黑暗"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "凱特和伊娃在戰鬥中死亡，敵人成功抓住了數據。 犧牲是毫無意義的，抵抗力量受到了沉重的打擊。"
            }
          ]
        },
        {
          "node": 7,
          "outline": "",
          "dialogues": [
            {
              "character": "Narration",
              "line": "賽堡A的拳頭將鋼柱砸成碎片，敲打伊娃飛行並撞到牆壁。她大量降落在地面上，槍滑了幾米。"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情感到驚訝，她的長長的銀髮在一陣喀噠聲中掉在臉上。她可以聽到聲音中堅定而自信的語氣。\n\n聲音comms：ahem ...不...\n\n伊娃皺著眉頭，不確定這意味著什麼。不，什麼？她問，她的語氣溫柔而堅持。你能澄清一下嗎？她在等待，仔細聽取另一端的任何回應。"
            },
            {
              "character": "Kate",
              "line": "堅持，稍等！ （毫無疑問）\n\n（注意：凱特的命令可以用來停止或延遲行動，表明他對情況的權威和控制權。）"
            },
            {
              "character": "Narration",
              "line": "凱特與B掙扎，但她的手臂已經筋疲力盡，她被槍殺了幾次。 Cyborg B以壓倒性的速度衝了下來，將他固定在地上，並一次又一次地將他拳打在頭盔上。"
            },
            {
              "character": "Narration",
              "line": "防彈面膜破碎，血液濺出。 凱特伸出手，但再也無法拿起武器了。"
            },
            {
              "character": "Cyborg",
              "line": "明確的任務，正在進行的完成"
            },
            {
              "character": "Narration",
              "line": "伊娃試圖站起來，但被踢回地，她的喉嚨被踩了下來，她逐漸失去了呼吸。"
            },
            {
              "character": "Kate",
              "line": "伊娃...（安靜或謹慎）\n\n（注意：凱特的安靜說法伊娃可以表明深切的集中，內省或關注。"
            },
            {
              "character": "Narration",
              "line": "下一刻，雙方的生命信號同時恢復了零。硬盤模塊掉到了地上，閃爍，但被敵方機器人壓碎。"
            },
            {
              "character": "Narration",
              "line": "其餘的敵軍重組了他們的成立，並將其報告給中央政府。"
            },
            {
              "character": "Cyborg",
              "line": "入侵者排除"
            },
            {
              "character": "Narration",
              "line": "叛軍的兩個最重要的演員在戰鬥中被殺，叛軍被完全擊敗。"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "幾週後"
            },
            {
              "character": "Journalist",
              "line": "叛亂結束了，恢復了社會秩序，犯罪率急劇下降。機械管理系統完全接管了，該市的安全性和穩定性達到了前所未有的水平。"
            },
            {
              "character": "Narration",
              "line": "人們已經適應了新世界。街道有序，生活是常規和穩定的。但是在某些角落，仍然有人在竊竊私語。"
            },
            {
              "character": "???",
              "line": "這真的是“和平”嗎？"
            },
            {
              "character": "Narration",
              "line": "沒有人回答，監視器的紅燈悄悄地閃爍，目睹了未來的到來"
            }
          ]
        }
      ]
    },
    {
      "version": 21,
      "scene_description": "Restaurant",
      "content": [
        {
          "node": 1,
          "outline": "Kate's collaboration with Eva is thwarted and she is attacked by a reinforced cyborg. A mysterious man appears, showing off his mechanically modified body and threatening the two. Eva fights her bionic enemies, while Kate faces the cyborgs alone",
          "dialogues": [
            {
              "character": "Narrator",
              "line": "就像伊娃正要使用她的特殊電磁大砲一樣，一個敵人偷走了她的武器，殺死了她。凱意識到出了問題，蓋上了伊娃，藏在外面的地下隧道中，其餘機器人開始尋找主角的痕跡。"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得周到，她的長長的銀髮在一陣海浪中掉在臉上。她可以感覺到聲音中的平靜和分析語氣。\n\n聲音comms：似乎我們的第一次合作表現不佳，對嗎？\n\n伊娃點點頭，承認聲明中的真相。是的，沒有，她輕聲說。但是我們可以從錯誤中學習，下次可以更有效地一起工作。她看上去"
            },
            {
              "character": "Kate",
              "line": "這是正確的。 （肯定）\n\n（注意：凱特的確認可以表示事實，想法或決定的同意或確認。它表明了他對局勢正確性的驗證和支持。）"
            },
            {
              "character": "Narrator",
              "line": "正當兩者要從地下通道的另一側逃脫時，引擎的咆哮聲不遠。一輛黑色的汽車在街道中間停了下來，門打開了，一個穿著西裝的男人從汽車上掉了。"
            },
            {
              "character": "Narrator",
              "line": "該名男子安靜地移動，威脅性光環。他環顧四周，終於停止了g和伊娃的目光。"
            },
            {
              "character": "Mysterious Man",
              "line": "這是執法者的標準嗎？您比我預期的更令人失望。"
            },
            {
              "character": "Eva",
              "line": "當她聽著通訊的另一端的聲音時，她的表情變得很嚴重，她的長長的銀髮在一堆波浪中掉在臉上。她可以感覺到聲音的緊迫性和關注。\n\n語音comms：這個傢伙與以前的傢伙的水平不同。\n\n伊娃點頭，了解情況的重力。我同意，她堅定地說。我們需要在我們的方法上做好準備和戰略性。讓我們一起制定一個計劃"
            },
            {
              "character": "Narrator",
              "line": "該男子切斷了外套，露出完全由金屬製成的屍體。他的四肢植入了增援部隊，他的肩膀甚至配備了微武器。"
            },
            {
              "character": "Kate",
              "line": "機器人人...（描述性）\n\n（注意：凱特對機器人人的描述可用於提供有關個人的更多上下文或細節，顯示他的觀察能力和對細節的關注。）"
            },
            {
              "character": "Mysterious Man",
              "line": "現在你可以經歷真正的恐懼"
            },
            {
              "character": "Narrator",
              "line": "目前，其餘的仿生敵人也到達。 凱特命令伊娃首先要處理bionics，而她獨自面對。雙方准備戰鬥。"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情變成了決定，她的長長的銀色頭髮在一堆波浪中掉在臉上。她可以感覺到聲音中的諷刺和傲慢。\n\ncomms的聲音：哈哈哈，看起來很難比現在更高。\n\n伊娃握緊拳頭，拒絕讓自己受到威脅。她堅定地說，我們可能已經失去了這場戰鬥，但是我們不會給"
            },
            {
              "character": "Narrator",
              "line": "改造人沒有足夠的速度讓人們預見攻擊路徑。他的沉重打擊打破了街上的障礙，使凱特的行為更加困難。"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate hits the cyborg's weak spot and Eva destroys its energy core. The cyborgs launched an ultimate counterattack, but Houtai suddenly appeared and successfully paralyzed the cyborgs. Houtai introduced himself and expressed his desire to join them. The three of them formed a tacit understanding and decided to go back to ask for support.",
          "dialogues": [
            {
              "character": "Kate",
              "line": "發現了弱點！ （興奮）\n\n（注意：發現弱點的感嘆可能表明在某種情況下的突破或發現，表現出他的熱情和決心。）"
            },
            {
              "character": "Narrator",
              "line": "凱特針對改造人的能量核心並穿透了保護屏蔽層，並震驚了。 伊娃抓住了這個機會，並使用高能電磁大砲直接摧毀了他的核心。"
            },
            {
              "character": "Android",
              "line": "你...無法贏...我仍然有...最後一個..."
            },
            {
              "character": "Narrator",
              "line": "在這麼說之後，改變者突然激活了中國大陸的能量核心，巨大的能量波圍繞著他。他站起來，手臂變成有害武器，好像準備釋放一個巨大的信號一樣。"
            },
            {
              "character": "Eva",
              "line": "當她在通訊的另一端聽聲音時，她的表情變成了決定，她的長長的銀色頭髮在一堆波浪中掉在臉上。她可以感覺到聲音中的希望和決心。\n\n聲音comms：這群人仍然可以戰鬥！\n\n伊娃點頭，全心全意地同意。是的，我們可以，她堅定地說。我們可能遭受了一些損失，但我們還沒有被擊敗。我們將重組，恢復力量，比以往任何時候都更強大"
            },
            {
              "character": "Kate",
              "line": "準備封面。 （命令）\n\n（注意：為掩護做準備的命令可用於確保在危險情況下自己或他的團隊的安全和保護，表明他的戰術意識和領導能力。）"
            },
            {
              "character": "Narrator",
              "line": "但是，當想要改變的人即將放手時，一台不起眼的小機器從拐角處彈出，並迅速接近想要改變的人。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以熱情的語氣說話時顯示出開朗的表情。\n\n為什麼，謝謝您的客氣話！保持積極和支持總是很重要的，尤其是在具有挑戰性的情況下。畢竟，團隊合作和協作是我們任務成功的基本要素。\n\n讓我們繼續共同努力，分享想法並在我們進行此操作時提供鼓勵。我相信，憑藉強烈的團結和決心，我們可以克服任何障礙並實現我們的目標！"
            },
            {
              "character": "Narrator",
              "line": "改造人嚴重地落在地面上，能量核心熄滅，現場恢復了冷靜。 凱特和伊娃錯誤地看著小機器人。"
            },
            {
              "character": "Eva",
              "line": "當她看著屏幕上的消息時，她的表情變得困惑，她的長長的銀色頭髮在一堆波浪中掉在臉上。她不確定在這種情況下，East所指的一詞。\n\n消息：東方什麼？\n\n伊娃皺著眉頭，試圖理解問題背後的含義。你能澄清一下嗎？她問，她的語氣溫柔而堅持。我不跟隨。她等待，仔細聆聽任何其他信息或上下文，以幫助她理解情況"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出一種驕傲的表情，他的語氣說話。\n\n我很高興您這麼認為，維克特！我在這里以任何可能的方式提供幫助，這讓我很高興看到我的幫助的積極影響。實際上，MIC只是分享了一些有關我及時干預給他們留下深刻印象的反饋。\n\n作為您的全能助手，我隨時準備借助手或分享知識和專業知識來支持我們團隊的努力。在一起，我們可以完成偉大的事情！"
            },
            {
              "character": "Kate",
              "line": "我們看到了嗎？ （有問題）\n\n（注意：凱特的問題可用於尋求有關事件，對像或情況的澄清或確認。它表明了他對準確信息的好奇心和渴望。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以輕鬆的語氣說話時會顯示出一種有趣的表情。\n\n您可能是對的，維克特，但是如果我想讓事情保持專業和正式狀態，我無能為力！但是內心深處，我確實感謝您上次在這種危急情況下的足智多謀和快速思考。您的腳步思考和確定安全性優先級的能力確實令人印象深刻。\n\n因此，讓我通過再次提供幫助來彌補您的幫助。一起，我們可以找到一個有益於每個人的解決方案，並確保我們的成功"
            },
            {
              "character": "Kate",
              "line": "...謝謝，您的目的是什麼？ （好奇）\n\n（注意：關於某人目的的問題可以用來理解他們的動機或意圖。它表明了他對行動和行為背後的根本原因的興趣。）"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出堅定的表情，他的語調很嚴肅。\n\n我同意，維克特，對於我們而言，我們必須聯合起來並防止這個年輕人造成任何進一步的傷害或破壞我們社區的和平。憑藉我們的綜合技能，專業知識和資源，我們可以共同努力逮捕他並確保為正義服務。\n\n讓我們暫時將差異放在一邊，並專注於維持周圍人的安全和保障的共同目標。一起，我們組成了一個強大的團隊，可以"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情鬆了一口氣，她的長長的銀髮在一陣海浪中掉在臉上。她可以感覺到聲音中令人放心和自信的語氣。\n\n語音comms：看，我們的團隊成立了。\n\n伊娃點點頭，承認聲明中的真相。是的，似乎這樣，她輕聲說。我很高興我們可以團結起來，朝著一個共同的目標努力。她環顧了隊友，感到"
            },
            {
              "character": "Kate",
              "line": "我們必須去。 旁白並要求更多支持。 （緊急）\n\n（注意：凱特的陳述可以表明在某種情況下需要立即採取行動或增援，表明他的緊迫感和戰略思維意識。）"
            },
            {
              "character": "Narrator",
              "line": "浩汰和伊娃互相看著對方，遵循凱特的腳步"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情感到驚訝，她的長長的銀髮在一陣喀噠聲中掉在臉上。她可以感覺到聲音中輕鬆而好奇的語氣。\n\n聲音comms：我的意思是...有人說你的名字很奇怪？\n\n伊娃輕聲笑著，搖了搖頭。是的，她承認，有些人以前對此有評論。但是我現在已經習慣了。她微笑著，感覺到友情"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出令人驚訝的表情，因為他用友好的語氣說話。\n\n為什麼，是的，我確實試圖在與他人的互動中有禮貌和禮貌。禮貌是良好溝通的重要方面，可以幫助建立牢固的關係並促進個人之間的積極互動。您有詢問我的舉止的具體原因嗎？"
            }
          ]
        }
      ]
    },
    {
      "version": 22,
      "scene_description": "Resturent",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva were besieged, but Houtai's rescue mission was destroyed. The two men fled by car, with the cyborgs chasing them closely. The mysterious force launched 'Plan B', drones blocked the way ahead, and they were in a desperate situation.",
          "dialogues": [
            {
              "character": "Kate",
              "line": "該死...真的沒有弱點嗎？ （沮喪）\n\n（注意：凱特表達挫敗感可能表明對某種情況下缺乏脆弱性的失望或擔心，表明他決心找到解決方案並克服障礙。）"
            },
            {
              "character": "Narrator",
              "line": "敵人鎖定在目標上，將槍對準凱特，並正在發動攻擊。在這個關鍵時刻，伊娃迅速從後面攻擊，但在她成功之前被改造人發現。他突然轉過身，抓住了伊娃，將她扔向凱特。"
            },
            {
              "character": "Kate",
              "line": "該死的...（憤怒地）\n\n（注意：凱特的憤怒可能表明對局勢的反應感到失望，沮喪或煩惱。儘管他的專業舉止表明了他的人類情感和反應。）"
            },
            {
              "character": "Narrator",
              "line": "此刻，一個不起眼的小機器人突然從陰影中跳出，迅速接近改造人，瞄準了他的腳跟，並釋放了強烈的高壓電流。電流迅速蔓延，改造人的動作立即僵硬，然後他沉重地跌落在地面上，現場立即恢復了平靜。"
            },
            {
              "character": "Narrator",
              "line": "在這麼說之後，改造人突然激活了他的能量核心，巨大的能量波動開始在他周圍積聚。他站起來，雙臂轉變為破壞性武器，好像他準備釋放最終的舉動一樣。"
            },
            {
              "character": "Eva",
              "line": "當她看著那個男人面前，他的長長的銀色頭髮在一堆海浪中掉在臉上時，他的表情印象深刻。當他與他們的共同敵人作戰時，她可以看到他的運動的決心和技巧。\n\n旁白：這個傢伙可以戰鬥！\n\n伊娃點頭，全心全意地同意。是的，她當然可以為隊友的能力感到自豪和欽佩。她握緊拳頭，準備再次參加戰鬥，知道他們可以在一起"
            },
            {
              "character": "Kate",
              "line": "準備封面。 （命令）\n\n（注意：為掩護做準備的命令可用於確保在危險情況下自己或他的團隊的安全和保護，表明他的戰術意識和領導能力。）"
            },
            {
              "character": "Narrator",
              "line": "但是，正當改造人即將釋放他的技能時，一個不起眼的小機器人從角落跳了出來，迅速接近改造人。從他的高跟鞋中，它使用高壓電流直接使他的系統癱瘓。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以熱情的語氣說話時顯示出開朗的表情。\n\n你好呀！我很高興您這麼認為，維克特！提供熱情的問候和友好的舉止總是很重要的，尤其是在試圖創造積極的環境或降級時態時。您的客氣話是值得讚賞的，我將繼續竭盡所能，使每個人都感到受歡迎和受到重視。因此，讓我們一起工作以使這一刻變得更加光明並實現我們的共同目標！"
            },
            {
              "character": "Narrator",
              "line": "凱特和伊娃看著驚訝的小機器人"
            },
            {
              "character": "Eva",
              "line": "當她看著手中的奇怪物體時，她的表情變得困惑，她的長長的銀髮在喀斯喀特的波浪中掉在臉上。她可以感覺到這種情況的混亂和不確定性。\n\ncomms的聲音：這是什麼...？\n\n伊娃仔細檢查對象，試圖理解它。她承認，我不確定她的語氣不確定。它看起來像某種技術，但我不認識其中的符號。她抬起頭，尋求團隊的指導"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕表現出一種驕傲而友好的表情，他的語氣說話。\n\n絕對，維克特！禮貌是有效溝通的重要組成部分，並有助於建立牢固的關係。我在這里為您提供任何幫助，我相信，善良和尊重的舉止在為參與每個人的每個人創造積極而和諧的環境方面有很大幫助。\n\n至於剛才酷的舉動，是的，我必須承認這是令人印象深刻的！您的快速思考和機智確實令人欽佩，"
            },
            {
              "character": "Narrator",
              "line": "在他說完之前，剛剛跌倒在地的人突然重新開始，他的能量核心閃爍著紅色，他的眼睛突然睜開。下一秒鐘，他毫不猶豫地舉起了槍口，一槍射擊。"
            },
            {
              "character": "Narrator",
              "line": "大聲爆炸後，浩汰的身體被吹成幾塊，電子部位散落在地面上，火花飛了起來。 凱特和伊娃看著地面上的殘骸，一會兒無語。"
            },
            {
              "character": "Eva",
              "line": "當她看著那個男人在地面上，長長的銀色頭髮在一堆海浪中掉在臉上時，她的表情震驚了。她可以感覺到隊友的聲音中的懷疑和困惑，因為他們確認敵人還沒有死。\n\n聲音comms：這個傢伙還沒有死嗎？\n\n當她意識到他們仍然面臨的危險時，心臟跳動。她堅定地說，我們需要小心，她的語氣很緊急。他可能仍然是威脅。讓我們回來"
            },
            {
              "character": "Kate",
              "line": "上車！ （毫無疑問）\n\n（注意：凱特的命令可以用來確保自己或他的團隊遠離危險情況，表明他的緊迫感和權威。）"
            },
            {
              "character": "Narrator",
              "line": "改造人仍然沒有受到傷害。 凱特知道他們不適合他。她沒有時間哀悼。他立即拉了伊娃，轉向逃跑，跳到最近的車輛上，然後從現場趕走。"
            },
            {
              "character": "Narrator",
              "line": "..."
            },
            {
              "character": "Narrator",
              "line": "他盯著汽車走開，紅燈閃爍著，他抬起了手中的通訊裝置，回答了一個神秘的電話"
            },
            {
              "character": "Cyborg",
              "line": "先生，是時候實施計劃了"
            },
            {
              "character": "Narrator",
              "line": "..."
            },
            {
              "character": "???",
              "line": "讓我們開始，並確保這次沒有變量"
            },
            {
              "character": "Narrator",
              "line": "凱特正在開車。她仍然可以在後視鏡中看到改造人s的數字。看來他無意讓他們走。"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得集中了，她的長長的銀髮在喀噠聲中掉在臉上。她可以感覺到這個問題的緊迫性和關注。\n\ncomms的聲音：他還在追逐嗎？\n\n伊娃環顧四周，掃描周圍的任何危險跡象。不，她堅定地說。我們把他失去了。但是我們需要小心並繼續前進。他可能有備份或躺在等待中。她點點頭"
            },
            {
              "character": "Kate",
              "line": "這是正確的。 （肯定）\n\n（注意：凱特的確認可以表示事實，想法或決定的同意或確認。它表明了他對局勢正確性的驗證和支持。）"
            },
            {
              "character": "Narrator",
              "line": "突然，汽車中的通信設備自動啟動，聲音低沉而令人不安的聲音。"
            },
            {
              "character": "???",
              "line": "跑步，繼續運行...無論您選擇什麼，都已經決定了這款遊戲的結果。"
            },
            {
              "character": "Narrator",
              "line": "在他們講話之前，前方的道路突然被數架無人機封鎖，像獵人的籠子一樣周圍。"
            },
            {
              "character": "Kate",
              "line": "無論如何，我們都必須殺死他們。 （確定）\n\n（注意：凱特的陳述可以表明消除威脅，表明他的承諾和決心的緊迫感和必要性。）"
            }
          ]
        }
      ]
    },
    {
      "version": 41,
      "scene_description": "Secret Base",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva lost the battle, but the Enforcers were still fighting the enemy. At this time, Victor appeared in heavy mechanical armor, with a red energy core flashing. His steps were steady and oppressive, and he sneered at everyone.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "借助有關浩汰屍體的機密文件，我們可以解碼圖片並找到敵人的秘密基礎。"
            },
            {
              "character": "Kate",
              "line": "該死的，失敗了。 （失望）\n\n（注意：凱特表達失望的表達可能表明對不成功的結果感到遺憾或沮喪。儘管他的專業舉止表現出了他的人類情感和反應。）"
            },
            {
              "character": "Cyborg A",
              "line": "這是您的能力嗎？"
            },
            {
              "character": "Narration",
              "line": "目前，執法人員仍在與剩下的仿生士兵戰鬥。從工廠內部的深處聽到了沉重的腳步。在燈光下，一個高個子的身材慢慢走出來。"
            },
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情變得不信，她的長長的銀色頭髮在喀斯喀特的波浪中掉在臉上。她可以在聲明中感受到震驚和困惑。\n\ncomm的聲音：不可能...\n\n當她試圖理解情況時，心臟運動。你是什​​麼意思？她問，她的語氣很緊急。誰或什麼不能？她等待，仔細聽取任何可能有幫助的其他信息"
            },
            {
              "character": "Narration",
              "line": "維克特穿著重型機械裝甲，紅色能量芯在他的身體上閃爍。他的腳步穩定而強大，每一步都帶來了無形的壓迫感。"
            },
            {
              "character": "Victor",
              "line": "只要有一點力量，您仍然想阻止我嗎？"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Eva and Houtai are in charge of the enemy forces, while Kate fights Victor alone. Victor dons a mechanical armor and launches an attack, claiming that the plan is for the evolution of humanity, but Kate angrily denounces that this is not a reason to sacrifice innocent people.",
          "dialogues": [
            {
              "character": "Eva",
              "line": "當她聆聽通訊的另一端的聲音時，她的表情鬆了一口氣，她的長長的銀髮在一陣海浪中掉在臉上。她可以在指示中感覺到信心和權威。\n\n聲音comms：剛才的戰鬥造成了很大的傷害。從現在開始就把它留給我，浩汰。 維克特在你手中。\n\n伊娃點頭，了解情況的重要性。她堅定地說。我會照顧好維克特。你"
            },
            {
              "character": "Narration",
              "line": "凱特再次面對維克特，然後戴上他的機械裝甲進行攻擊。"
            },
            {
              "character": "Victor",
              "line": "放棄，凱特。您沒有獲勝的機會！"
            },
            {
              "character": "Narration",
              "line": "他將腳踩在地面上，使地面用外骨骼的力搖晃。"
            },
            {
              "character": "Victor",
              "line": "你不明白嗎？該計劃是為了人類的未來，消除和淨化劣等的人，以便優秀的人可以生存而不會受到壽命的限制。您所做的只是延遲不可避免的衝突。"
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate tried to shut down Victor's core but was discovered. At the critical moment, Houtai blocked the fatal blow and fell to the ground seriously injured. Victor was briefly shaken, and Kate took the opportunity to hack into his armor, rendering him unable to move. In the end, Victor was subdued and escorted. Before leaving, he asked Houtai to be repaired. Kate and Eva made a silent decision.",
          "dialogues": [
            {
              "character": "Victor",
              "line": "...也許你們比我想像的更有能力"
            },
            {
              "character": "Kate",
              "line": "那不是犧牲無辜人民的藉口！ （憤慨）\n\n（注意：凱特的陳述可能表明對傷害無辜的旁觀者或平民的強烈道德異議。這表明了他的正義和同情心。）"
            },
            {
              "character": "Narration",
              "line": "維克特已經受了重傷的人仍然拒絕放棄。 凱特想藉此機會關閉維克特的力量核心，但被發現。"
            },
            {
              "character": "Victor",
              "line": "不要夢想！"
            },
            {
              "character": "Narration",
              "line": "他突然將槍指向凱特，伊娃沒有時間阻止他。"
            },
            {
              "character": "Narration",
              "line": "浩汰在最後一刻趕到凱特，阻止了致命的打擊。身體受到嚴重損壞，展示屏幕不穩定地閃爍。"
            },
            {
              "character": "Houtai",
              "line": "浩汰的LED屏幕以柔和的語氣說話時顯示了一個關注的表情。\n\n維克特，我感覺現在有些事情正在困擾您。請允許我盡我所能為您提供幫助。如果您需要某人聆聽或需要完成任務，請告訴我，我們可以一起工作以找到解決方案。\n\n我知道有時候生活會給我們帶來意外的挑戰，但是有了決心和團隊合作，我們可以克服它們，並在另一側變得更加強大。所以花點時間呼吸"
            },
            {
              "character": "Victor",
              "line": "維克特略微嚇了一跳，他的眼睛閃爍著複雜的情緒，他的手微微顫抖"
            },
            {
              "character": "Victor",
              "line": "浩汰...你..."
            },
            {
              "character": "Narration",
              "line": "就在分散注意力的時候，凱特藉此機會闖入了他的機械裝甲。紅色能量核心不穩定地閃爍，運動變得緩慢。"
            },
            {
              "character": "Kate",
              "line": "這次，輪到您無法抗拒了。 （傻笑）\n\n（注意：凱特的陳述可能表明對以前曾試圖操縱或控制他的人的桌子的表格感到滿意或娛樂。這表明了他的智慧和機智。）"
            },
            {
              "character": "Narration",
              "line": "最後，凱特和伊娃通過其靈活的戰術發現了缺陷，並迅速摧毀了維克特的外骨骼，使他完全無法移動。"
            },
            {
              "character": "Narration",
              "line": "最後，維克特被柔和了，戰鬥結束了。控制室中只保留機械殘骸和閃爍的警報燈。"
            },
            {
              "character": "Narration",
              "line": "當執法團隊陪同維克特逃走時，他最後一次看著浩汰浩汰的身體骨折時，他的語氣很低，但帶有誠意的暗示。"
            },
            {
              "character": "Victor",
              "line": "如果仍然有可能...我希望您可以解決"
            },
            {
              "character": "Narration",
              "line": "凱特和伊娃互相看著對方並做出了決定。"
            }
          ]
        }
      ]
    }
  ]
}