{
  "acts": [
     {
      "version": 1,
      "scene_description": "Bed Ending",
      "content": [
        {
          "node": 21,
          "outline": "Kate and Eva were no match for the powerful enemy. Kate fell to the ground with serious injuries, and Eva was also in desperate situation. After the enemy left, the battlefield was in ruins. A mysterious robot appeared quietly, staring at the two people quietly, as if in silence.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Kate's attacks could not break through the cyborg's defense, and each of his counterattacks was extremely accurate. Even though Kate tried to distance herself, the other party kept chasing her like a ghost."
            },
            {
              "character": "Narration",
              "line": "Eva tried her best to contain the androids, but the enemy was too numerous and her weapons were damaged, so she was gradually forced into a dead end."
            },
            {
              "character": "Mysterious Man",
              "line": "How disappointing. Is this all you law enforcement officers are capable of?"
            },
            {
              "character": "Narration",
              "line": "A heavy punch hit Kate's chest, and he was smashed into the wall behind him, with blood dripping from the corner of his lips. He tried to stand up, but he was too weak to fight back."
            },
            {
              "character": "Narration",
              "line": "Eva saw Kate fall, fear and despair flashed in her eyes. Just as she was about to rush forward, a red light flashed——"
            },
            {
              "character": "Narration",
              "line": "The smoke cleared and everything returned to silence. The enemy left, leaving behind only the devastated streets and two fallen soldiers."
            },
            {
              "character": "Narration",
              "line": "A sleek and compact silver-white robot quietly emerged. It did not make any sound, but just quietly floated beside the two people, with the sensor light on its head flickering slightly, as if... mourning"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate and Eva break through the blockade and temporarily escape the pursuers, but the communication device suddenly rings and a mysterious voice reveals that their car has been marked. Eva realizes she can't escape, and a tactical drone descends, revealing the cyborg. Kate then realized that whether fighting or retreating, everything was already calculated by the enemy.",
          "dialogues": [

            {
              "character": "Eva",
              "line": "We did it! Let's go!"
            },
            {
              "character": "Narrator",
              "line": "The two broke through the blockade and rushed towards the safe area"
            },
            {
              "character": "Narrator",
              "line": "After leaving the battlefield, Kate carefully looked around, but found no pursuers. Their hearts were still beating fast, and the battle just now made their adrenaline surge."
            },
            {
              "character": "Eva",
              "line": "It seems... we are really free of them?"
            },
            {
              "character": "Kate",
              "line": "Not sure yet, need to find a place to hide and make sure we can't be tracked anymore"
            },
            {
              "character": "Narrator",
              "line": "However, at this moment, Kate's communication device suddenly rang. Unlike the interference sound just now, this time it was a clear and calm voice."
            },

            {
              "character": "???",
              "line": "Thanks for your hard work. You won this round. But... do you think this can change the outcome?"
            },
            {
              "character": "Narrator",
              "line": "Eva's expression changed, and she quickly turned on the portable scanner to detect nearby signal sources. After a few seconds, her face suddenly changed."
            },
            {
              "character": "Eva",
              "line": "Kate! Our car has been tagged — they've been tracking our location!"
            },
            {
              "character": "Eva",
              "line": "Damn it, we have no chance of escaping!"
            },
            {
              "character": "Narrator",
              "line": "In the sky, a larger tactical drone slowly descended, and the cyborg appeared again."
            },
            {
              "character": "Transformer",
              "line": "The game is over..."
            },
            {
              "character": "Narrator",
              "line": "At this moment, Kate finally understood that they had no real chance of winning from the beginning - whether they were fighting or retreating, this battle had already been carefully calculated, and they were just part of the enemy's plan..."
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate tries to circumvent the drone blockade, but ends up being ambushed by mechanical soldiers. The cyborgs appeared and the enemy suppressed their firepower, forcing the two into a dead end. Eva whispered and asked if they were defeated, but Kate remained silent. They finally realized that the outcome of this battle was already determined.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Kate realized that instead of engaging in a head-on battle, it would be better to find another way. He turned the steering wheel sharply, trying to bypass the drone blockade from the alley."
            },
            {
              "character": "Eva",
              "line": "Is this okay?"
            },
            {
              "character": "Kate",
              "line": "We have no choice"
            },
            {
              "character": "Narration",
              "line": "However, just as they turned into the alley, the surrounding street lights lit up at the same time, illuminating the rows of mechanical soldiers who had been lying in ambush. The figures of the cyborgs slowly emerged from the darkness, and the weapons in their hands locked onto them."
            },
            {
              "character": "Cyborg",
              "line": "This game... is over"
            },
            {
              "character": "Narration",
              "line": "The enemy's artillery fire came like a rainstorm. Kate and Eva tried to fight back, but the firepower was completely suppressed. They were gradually forced into a dead end. No matter how hard they struggled, they had no chance of winning this battle."
            },
            {
              "character": "Eva",
              "line": "Did we...lose?"
            },
            {
              "character": "Narration",
              "line": "Kate held the gun tightly, frowning slightly, but did not answer. They knew that no matter what choice they made before, the outcome of this battle was already determined."
            }
          ]
        },
        {
          "node": 4,
          "outline": "Kate and Eva fought fiercely with the army of androids in the command room, but were eventually outnumbered and engulfed by the explosion. After a few weeks, the mechanical system took over completely, social order was restored, and the city became peaceful and stable on the surface. Yet, in the shadows, there are still those who question, and the red light of the monitors silently bears witness to the advent of this new world.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "In the command room, the red warning light flashes, and the android army approaches step by step."
            },
            {
              "character": "Kate",
              "line": "This is over..."
            },
            {
              "character": "Eva",
              "line": "We... have no choice"
            },
            {
              "character": "Narration",
              "line": "Houtai's body has been damaged, the core is flashing abnormal red light, and he fell to the ground helplessly."
            },
            {
              "character": "Houtai",
              "line": "Kate...Eva...be careful..."
            },
            {
              "character": "Narration",
              "line": "The enemy did not give us a chance to breathe, and the dense firepower poured down crazily."
            },
            {
              "character": "Narration",
              "line": "Eva jumped up and shot, the bullet shot down a bionic soldier, but was quickly locked by another machine, and the energy cannon hit her abdomen directly."
            },
            {
              "character": "Eva",
              "line": "...No..."
            },
            {
              "character": "Narration",
              "line": "Kate tried to take cover, but the enemy's attack was relentless, and an electromagnetic pulse pierced through his body."
            },
            {
              "character": "Kate",
              "line": "Eva..."
            },
            {
              "character": "Narration",
              "line": "The two men stood back to back, covered in blood and barely breathing. The enemy raised his weapon, and the final attack came."
            },
            {
              "character": "Eva",
              "line": "Kate...I'm sorry..."
            },
            {
              "character": "Narration",
              "line": "A blinding light flashed, and Kate and Eva were engulfed by the explosion——"
            },
            {
              "character": "Narration",
              "line": "The rebellion ended, social order was restored, and the crime rate dropped sharply. The mechanical management system has taken over completely, and the city's safety and stability have reached an unprecedented level"
            },
            {
              "character": "Narration",
              "line": "A few weeks later"
            },
            {
              "character": "Journalist",
              "line": "Crime rates have dropped sharply, the mechanical management system has taken over, and the city is safer and more orderly than ever before"
            },
            {
              "character": "Narration",
              "line": "People have adapted to the new world. The streets are orderly and life is regular and stable. But in some corners, there are still people whispering."
            },
            {
              "character": "???",
              "line": "Is this really 'peace'"
            },
            {
              "character": "Narration",
              "line": "No one answered, the red light of the monitor flickered quietly, witnessing the arrival of the future"
            }
          ]
        },
        {
          "node": 41,
          "outline": "Kate and Eva fell to the ground seriously injured, Victor approached step by step, ruthlessly declaring the end of the battle. Eva fought back but to no avail and was eventually knocked down by heavy damage. In despair, Kate watched her life slip away, and Victor coldly launched a final attack, the explosion engulfed everything and darkness fell.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Kate was panting and covered in wounds. He tried to stand, but his legs could no longer support him. His knees gave way and he fell heavily to the ground."
            },
            {
              "character": "Eva",
              "line": "Kate! Get up!"
            },
            {
              "character": "Narration",
              "line": "However, Victor's figure was approaching, his mechanical armor made a low sound, and the red energy core flashed with a destructive light."
            },
            {
              "character": "Victor",
              "line": "I told you long ago, you have no chance of winning"
            },
            {
              "character": "Narration",
              "line": "Eva tried to rush forward, but Cyborg A blocked her way and knocked her to the ground. Houtai also wanted to support, but his energy was already exhausted. He could only fall to the ground helplessly, making a weak sound."
            },
            {
              "character": "Victor",
              "line": "This farce should end"
            },
            {
              "character": "Narration",
              "line": "He raised his arm, and the electromagnetic pulse device of the mechanical armor began to gather energy. Kate tried to struggle, but she was unable to move and could only watch death coming."
            },
            {
              "character": "Eva",
              "line": "Stop it——!"
            },
            {
              "character": "Narration",
              "line": "Eva forced herself to stand up, ignoring her injuries, picked up the weapon on the ground, and shot madly at Victor."
            },
            {
              "character": "Eva",
              "line": "You monster——!!"
            },
            {
              "character": "Narration",
              "line": "However, when the bullet hit Victor's armor, he just turned his head indifferently, his eyes seemed to be looking at a creature struggling in vain."
            },
            {
              "character": "Victor",
              "line": "Pointless resistance"
            },
            {
              "character": "Narration",
              "line": "The next second, a gun barrel suddenly popped out from his armored shoulder, flashing red and shooting out like lightning."
            },
            {
              "character": "Eva",
              "line": "!"
            },
            {
              "character": "Narration",
              "line": "Victor severely wounded Eva, and her body froze. Her hands trembled, and she tried to continue pulling the trigger, but her strength gradually faded away."
            },
            {
              "character": "Kate",
              "line": "Eva!"
            },
            {
              "character": "Narration",
              "line": "Eva's knees weakened, her body swayed, and finally fell down helplessly. Her eyes stared blankly at the ceiling, her lips trembled slightly, and she wanted to say something, but in the end she only uttered a weak breath."
            },
            {
              "character": "Eva",
              "line": "...Kate...sorry..."
            },
            {
              "character": "Narration",
              "line": "Her hands fell limply, and the light in her eyes gradually extinguished"
            },
            {
              "character": "Victor",
              "line": "Ended"
            },
            {
              "character": "Narration",
              "line": "He raised his hand and delivered a final, merciless blow - Boom -!!!"
            },
            {
              "character": "Narration",
              "line": "An explosion sounded, flames engulfed everything, and were finally swallowed by darkness..."
            }
          ]
        },
        {
          "node": 6,
          "outline": "Kate and Eva eventually died in battle, the data fell into the hands of the enemy, Houtai's sacrifice was in vain, and the resistance forces suffered a devastating blow",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Kate and Eva were gradually forced into a dead end, unable to break out"
            },
            {
              "character": "Eva",
              "line": "We...have no chance"
            },
            {
              "character": "Narration",
              "line": "The enemy opened fire, and dense bullets blocked the last escape route"
            },
            {
              "character": "Enemy",
              "line": "It's over, enforcer"
            },
            {
              "character": "Narration",
              "line": "At the last moment, gunshots rang out and the scene fell into darkness"
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "Kate and Eva died in battle, and the enemy successfully seized the data. Houtai's sacrifice was meaningless, and the resistance forces suffered a heavy blow."
            }
          ]
        },
        {
          "node": 7,
          "outline": "",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Cyborg A's fist smashed the steel column into pieces, knocking Eva flying and hitting the wall; she landed heavily on the ground, and the gun slid several meters away."
            },
            {
              "character": "Eva",
              "line": "Ahem...no..."
            },
            {
              "character": "Kate",
              "line": "Hold on!"
            },
            {
              "character": "Narration",
              "line": "Kate struggled with B, but her arms were already exhausted and she was shot several times. Cyborg B rushed over with overwhelming speed, pinned him to the ground, and punched him in the helmet again and again."
            },
            {
              "character": "Narration",
              "line": "The bulletproof mask shattered, blood splattered. Kate stretched out her hand, but could no longer pick up the weapon."
            },
            {
              "character": "Cyborg",
              "line": "Clear task, completion in progress"
            },
            {
              "character": "Narration",
              "line": "Eva tried to get up, but was kicked back to the ground, her throat was stepped on, and she gradually lost her breath."
            },
            {
              "character": "Kate",
              "line": "Eva..."
            },
            {
              "character": "Narration",
              "line": "The next moment, the life signals of both sides returned to zero at the same time. The hard drive module fell to the ground, flickering, but was crushed by the enemy robot."
            },
            {
              "character": "Narration",
              "line": "The remaining enemy troops reorganized their formation and reported back to the central government."
            },
            {
              "character": "Cyborg",
              "line": "Intruder Exclusion"
            },
            {
              "character": "Narration",
              "line": "The two most important actors of the rebel forces were killed in the battle, and the rebels were completely defeated."
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Narration",
              "line": "A few weeks later"
            },
            {
              "character": "Journalist",
              "line": "The rebellion ended, social order was restored, and the crime rate dropped sharply. The mechanical management system took over completely, and the city's safety and stability reached an unprecedented level."
            },
            {
              "character": "Narration",
              "line": "People have adapted to the new world. The streets are orderly and life is regular and stable. But in some corners, there are still people whispering."
            },
            {
              "character": "???",
              "line": "Is this really 'peace'?"
            },
            {
              "character": "Narration",
              "line": "No one answered, the red light of the monitor flickered quietly, witnessing the arrival of the future"
            }
          ]
        }
      ]
    },
    {
      "version": 2,
      "scene_description": "Restaurant",
      "content": [
        {
          "node": 1,
          "outline": "Kate's collaboration with Eva is thwarted and she is attacked by a reinforced cyborg. A mysterious man appears, showing off his mechanically modified body and threatening the two. Eva fights her bionic enemies, while Kate faces the cyborgs alone",
          "dialogues": [
            {
              "character": "Narrator",
              "line": "Just as Eva was about to use her special electromagnetic cannon, an enemy stole her weapon, killing her. Kai realized something was wrong, covered Eva and hid in the underground tunnel outside, and the remaining robots began to look for the protagonist's trace."
            },
            {
              "character": "Eva",
              "line": "It seems that our first cooperation didn't go well, right?"
            },
            {
              "character": "Kate",
              "line": "That's right"
            },
            {
              "character": "Narrator",
              "line": "Just as the two were about to escape from the other side of the underpass, the roar of an engine was heard not far away. A black car stopped in the middle of the street, the door opened, and a man in a suit got out of the car."
            },
            {
              "character": "Narrator",
              "line": "The man moved quietly, with a threatening aura. He looked around, and finally stopped his gaze on Kate and Eva."
            },
            {
              "character": "Mysterious Man",
              "line": "Is this the standard of enforcer? You are more disappointing than I expected."
            },
            {
              "character": "Eva",
              "line": "This guy is not the same level as the previous guy."
            },
            {
              "character": "Narrator",
              "line": "The man cut off his coat, revealing a body made entirely of metal. His limbs were implanted with reinforcements, and his shoulders were even equipped with micro weapons."
            },
            {
              "character": "Kate",
              "line": "Robotic man..."
            },
            {
              "character": "Mysterious Man",
              "line": "Now you can experience real fear"
            },
            {
              "character": "Narrator",
              "line": "At this time, the remaining bionic enemies also arrived. Kate ordered Eva to deal with the bionics first, while she faced the cyborgs alone. Both sides prepared to fight."
            },
            {
              "character": "Eva",
              "line": "Hahaha, it looks like it'll be hard to get higher than the battle just now."
            },
            {
              "character": "Narrator",
              "line": "The cyborg didn't have enough speed for people to anticipate the attack path. His heavy punches broke the obstacles on the street, making Kate's actions more difficult."
            }

          ]
        },
        {
          "node": 2,
          "outline": "Kate hits the cyborg's weak spot and Eva destroys its energy core. The cyborgs launched an ultimate counterattack, but Houtai suddenly appeared and successfully paralyzed the cyborgs. Houtai introduced himself and expressed his desire to join them. The three of them formed a tacit understanding and decided to go back to ask for support.",
          "dialogues": [
            {
              "character": "Kate",
              "line": "Found the weakness!!!"
            },
            {
              "character": "Narrator",
              "line": "Kate aimed at the cyborg's energy core and penetrated the protective shield, and the cyborg was shocked. Eva seized the opportunity and used a high-energy electromagnetic cannon to directly destroy his core."
            },
            {
              "character": "Bionic Man",
              "line": "You...can't win...I still have...the last..."
            },
            {
              "character": "Narrator",
              "line": "After saying this, the Changer suddenly activated the energy core of the Chinese mainland, and a huge energy wave surrounded him. He stood up, and his arms turned into harmful weapons, as if ready to release a huge sign."
            },
            {
              "character": "Eva",
              "line": "This group of people can still fight Narration!"
            },
            {
              "character": "Kate",
              "line": "Prepare for cover"
            },
            {
              "character": "Narrator",
              "line": "However, just when the person who wants to change is about to let go, an inconspicuous little machine pops its head out from the corner and quickly approaches the person who wants to change."
            },
            {
              "character": "Houtai",
              "line": "Hey! You're welcome! That's the thing to do!"
            },
            {
              "character": "Narrator",
              "line": "The cyborg fell heavily to the ground, the energy core went out, and the scene returned to calm. Kate and Eva mistakenly looked at the little robots."
            },
            {
              "character": "Eva",
              "line": "What East?"
            },
            {
              "character": "Houtai",
              "line": "How do you look? I'm Houtai! The all-around helper! Mic said, that was super cool, wasn't it? I knew you guys needed a hand, luckily I got here in time!"
            },
            {
              "character": "Kate",
              "line": "Did we see it?"
            },
            {
              "character": "Houtai",
              "line": "Don't be so cold! I'm your savior. Last time you asked me to delay the time for the law enforcement officers to come find you, your life would have been in danger long ago."
            },
            {
              "character": "Kate",
              "line": "...Thank you, what is your purpose?"
            },
            {
              "character": "Houtai",
              "line": "Join you to stop this young man, Victor"
            },
            {
              "character": "Eva",
              "line": "Look, our team is formed."
            },
            {
              "character": "Kate",
              "line": "We must go Narration and request more support"
            },
            {
              "character": "Narrator",
              "line": "Houtai and Eva looked at each other and followed Kate's footsteps"
            },
            {
              "character": "Eva",
              "line": "I mean...someone said your name is weird?"
            },
            {
              "character": "Houtai",
              "line": "Are you polite?"
            }
          ]
        }
      ]
    },
    {
      "version": 3,
      "scene description": "Resturent",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva were besieged, but Houtai's rescue mission was destroyed. The two men fled by car, with the cyborgs chasing them closely. The mysterious force launched 'Plan B', drones blocked the way ahead, and they were in a desperate situation.",
          "dialogues": [
            {
              "character": "Kate",
              "line": "Damn... is there really no weakness?"
            },
            {
              "character": "Narrator",
              "line": "The enemy locked onto the target, pointed the gun at Kate, and was about to launch an attack. At this critical moment, Eva quickly attacked from behind, but was spotted by the cyborg before she succeeded. He turned around suddenly, grabbed Eva, and threw her towards Kate mercilessly."
            },
            {
              "character": "Kate",
              "line": "Damn..."
            },
            {
              "character": "Narrator",
              "line": "At this moment, an inconspicuous little robot suddenly jumped out from the shadows, quickly approached the cyborg, aimed at his heels, and released a strong high-voltage current. The current spread quickly, and the cyborg's movements instantly stiffened, and then he fell heavily to the ground, and the scene instantly returned to calm."
            },
            {
              "character": "Narrator",
              "line": "After saying this, the cyborg suddenly activated the energy core on his Narration, and huge energy fluctuations began to accumulate around him. He stood up, and his arms transformed into destructive weapons, as if he was ready to release the ultimate move."
            },
            {
              "character": "Eva",
              "line": "This guy can fight Narration!"
            },
            {
              "character": "Kate",
              "line": "Prepare for cover"
            },
            {
              "character": "Narrator",
              "line": "However, just as the cyborg was about to release his skill, an inconspicuous little robot jumped out from the corner and quickly approached the cyborg. From his heels, it used a high-voltage current to directly paralyze his system."
            },
            {
              "character": "Houtai",
              "line": "Hi! You're welcome! This is what I should do!"
            },
            {
              "character": "Narrator",
              "line": "Kate and Eva looked at the little robot in astonishment"
            },
            {
              "character": "Eva",
              "line": "What is this...?"
            },
            {
              "character": "Houtai",
              "line": "Are you polite? I'm Houtai! An all-around assistant! By the way, wasn't that a cool move just now? I knew you needed help, luckily I got there in time!"
            },
            {
              "character": "Narrator",
              "line": "Before he finished speaking, the cyborg who had just fallen to the ground suddenly restarted, his energy core flashed red, and his eyes suddenly opened. The next second, he raised the muzzle of the gun without hesitation and shot Houtai with one shot."
            },
            {
              "character": "Narrator",
              "line": "After a loud bang, Houtai's body was blown into several pieces, electronic parts were scattered all over the ground, and sparks flew. Kate and Eva looked at the wreckage on the ground, speechless for a moment."
            },
            {
              "character": "Eva",
              "line": "This guy isn't dead yet?!"
            },
            {
              "character": "Kate",
              "line": "Get in the car!"
            },
            {
              "character": "Narrator",
              "line": "The cyborg was still unharmed. Kate knew they were no match for him. She had no time to mourn Houtai. He immediately pulled Eva and turned to flee, jumped onto the nearest vehicle, and sped away from the scene."
            },
            {
              "character": "Narrator",
              "line": "..."
            },
            {
              "character": "Narrator",
              "line": "Staring at the car going away, with red light flashing in his eyes, he raised the communication device in his hand and answered a mysterious call"
            },
            {
              "character": "Transformer",
              "line": "Sir, it's time to implement Plan B"
            },
            {
              "character": "Narrator",
              "line": "..."
            },
            {
              "character": "???",
              "line": "Let's get started, and make sure there are no variables this time"
            },
            {
              "character": "Narrator",
              "line": "Kate was driving the car. She could still see the figures of the cyborgs in the rearview mirror. It seemed that he had no intention of letting them go."
            },
            {
              "character": "Eva",
              "line": "Is he still chasing?"
            },
            {
              "character": "Kate",
              "line": "That's right"
            },
            {
              "character": "Narrator",
              "line": "Suddenly, the communication device in the car started automatically, and a low and disturbing voice came out."
            },
            {
              "character": "???",
              "line": "Run, keep running... No matter what you choose, the outcome of this game has been decided."
            },
            {
              "character": "Narrator",
              "line": "Before they finished speaking, the road ahead was suddenly blocked by several drones, surrounding them like a hunter's cage."
            },
            {
              "character": "Kate",
              "line": "No matter what, we have to kill them all"
            }
          ]
        }
      ]
    },
    {
      "version": 4,
      "scene_description": "Secret Base",
      "content": [
        {
          "node": 1,
          "outline": "Kate and Eva lost the battle, but the Enforcers were still fighting the enemy. At this time, Victor appeared in heavy mechanical armor, with a red energy core flashing. His steps were steady and oppressive, and he sneered at everyone.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "With the confidential documents on Houtai's body, we can decode the pictures and find the enemy's secret base."
            },
            {
              "character": "Kate",
              "line": "Damn, failed"
            },
            {
              "character": "Cyborg A",
              "line": "Is this what you are capable of?"
            },
            {
              "character": "Narration",
              "line": "At this time, the enforcers were still fighting with the remaining bionic soldiers. Heavy footsteps were heard from deep inside the factory. Under the light, a tall figure slowly walked out."
            },
            {
              "character": "Eva",
              "line": "It can't be..."
            },
            {
              "character": "Narration",
              "line": "Victor was wearing a heavy mechanical armor, with red energy cores flashing all over his body. His steps were steady and powerful, and every step carried an invisible sense of oppression."
            },
            {
              "character": "Victor",
              "line": "With just this little bit of strength, do you still want to stop me?"
            }
          ]
        },
        {
          "node": 2,
          "outline": "Eva and Houtai are in charge of the enemy forces, while Kate fights Victor alone. Victor dons a mechanical armor and launches an attack, claiming that the plan is for the evolution of humanity, but Kate angrily denounces that this is not a reason to sacrifice innocent people.",
          "dialogues": [
            {
              "character": "Eva",
              "line": "The battle just now has caused them a lot of damage. Leave it to me and Houtai from now on. Victor is in your hands."
            },
            {
              "character": "Narration",
              "line": "Kate faces Victor again, and Victor puts on his mechanical armor to attack."
            },
            {
              "character": "Victor",
              "line": "Give up, Kate. You have no chance of winning!"
            },
            {
              "character": "Narration",
              "line": "He stomped his foot on the ground, causing the ground to shake with the force of his exoskeleton."
            },
            {
              "character": "Victor",
              "line": "Don't you understand? This plan is for the future of mankind, to eliminate and purify inferior people, so that excellent individuals can survive without being restricted by lifespan. All you are doing is delaying the inevitable conflict."
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate tried to shut down Victor's core but was discovered. At the critical moment, Houtai blocked the fatal blow and fell to the ground seriously injured. Victor was briefly shaken, and Kate took the opportunity to hack into his armor, rendering him unable to move. In the end, Victor was subdued and escorted. Before leaving, he asked Houtai to be repaired. Kate and Eva made a silent decision.",
          "dialogues": [
            {
              "character": "Victor",
              "line": "...maybe you guys are more capable than I thought"
            },
            {
              "character": "Kate",
              "line": "That's no excuse for sacrificing innocent people!"
            },
            {
              "character": "Narration",
              "line": "Victor, who was already badly injured, still refused to give up. Kate wanted to take the opportunity to shut down Victor's power core, but was discovered."
            },
            {
              "character": "Victor",
              "line": "Don't dream!"
            },
            {
              "character": "Narration",
              "line": "He suddenly pointed the gun at Kate, and Eva had no time to stop him."
            },
            {
              "character": "Narration",
              "line": "Houtai rushed to Kate at the last moment and blocked the fatal blow. The body was seriously damaged and the display screen flickered unsteadily."
            },
            {
              "character": "Houtai",
              "line": "Stop...Victor..."
            },
            {
              "character": "Victor",
              "line": "Victor was slightly startled, a complex emotion flashed in his eyes, and his hands trembled slightly"
            },
            {
              "character": "Victor",
              "line": "Houtai...you..."
            },
            {
              "character": "Narration",
              "line": "Just when Victor was distracted, Kate took the opportunity to hack into his mechanical armor. The red energy core flickered unsteadily and the movement became slow."
            },
            {
              "character": "Kate",
              "line": "This time, it's your turn to be unable to resist"
            },
            {
              "character": "Narration",
              "line": "Finally, Kate and Eva found the flaw with their flexible tactics and quickly destroyed Victor's exoskeleton, making him completely incapable of movement."
            },
            {
              "character": "Narration",
              "line": "Finally, Victor was subdued and the battle was over. Only mechanical wreckage and flashing alarm lights remained in the control room."
            },
            {
              "character": "Narration",
              "line": "When the law enforcement team escorted Victor away, he looked at Houtai's broken body for the last time, his tone was low but with a hint of sincerity."
            },
            {
              "character": "Victor",
              "line": "If it's still possible... I hope you can fix it"
            },
            {
              "character": "Narration",
              "line": "Kate and Eva looked at each other and made a decision."
            }
          ]
        }
      ]
    }
  ]
}
