{
  "acts": [
    {
      "version": 1,
      "scene_description": "The Abandoned Factory",
      "content": [
        {
          "node": 1,
          "outline": "Kate was ordered to investigate an abandoned factory, which was suspected to be the base of illegal robot manufacturing activities.",
          "dialogues": [
            {
              "character": "Commander",
              "line": "Kate, we've receive intelligence that an abandoned factory on the outskirts may be a front for illegal android production. Your mission is to infiltrate, confirm the intel, and collect any relevant evidence."
            },
            {
              "character": "Kate",
              "line": "Understood."
            },
            {
              "character": "Commander",
              "line": "The site may be guarded by heavily armed personnel. Avoid direct confrontation unless absolutely necessary. Your priority is gathering evidence."
            }
          ]
        },
        {
          "node": 2,
          "outline": "Kate was discovered by patrol officers when he sneaked into the factory and was attacked by them. He used cover and his superb marksmanship to defeat them one by one.",
          "dialogues": [
            {
              "character": "Patrol Guard A",
              "line": "Do we really have to pull night shifts in this dump? Even the rats won't come near this place."
            },
            {
              "character": "Patrol Guard B",
              "line": "Stop bellyaching. I heard there's an important operation going on. We can't afford any mistakes."
            },
            {
              "character": "Narration",
              "line": "Rustling sounds in the distance…"
            },
            {
              "character": "Patrol Guard B",
              "line": "Did you hear that?!"
            },
            {
              "character": "Patrol Guard A",
              "line": "Relax, it's probably just a rat. This place is crawling with them."
            },
            {
              "character": "Patrol Guard B",
              "line": "No way! Orders are orders—nothing suspicious gets ignored!"
            },
            {
              "character": "Patrol Guard A",
              "line": "Ugh, fine! I'll go check it out. Happy now?"
            },
            {
              "character": "Narration",
              "line": "The ventilation shaft is empty, except for some rat droppings."
            },
            {
              "character": "Patrol Guard A",
              "line": "See? You're just paranoid—wait, what the—?!"
            },
            {
              "character": "Narration",
              "line": "A man in a detective's coat stands by the doorway. A fallen guard lies unconscious beside him."
            },
            {
              "character": "Patrol Guard A",
              "line": "Who the hell are you?! How did you get in here?!"
            },
            {
              "character": "Narration",
              "line": "Before the guards can react, the man smashes the alarm system and pulls out a hacking device."
            },
            {
              "character": "Kate",
              "line": "Sigh... What a pain."
            },
            {
              "character": "Narration",
              "line": "Battle begins. Kate activates her hacking device."
            }
          ]
        },
        {
          "node": 3,
          "outline": "Kate used hacking techniques to erase the patrol officers' short-term memories, then quickly cleaned up the scene and proceeded to the destination.",
          "dialogues": [
            {
              "character": "Patrol Guard A",
              "line": "Ah!!!!"
            },
            {
              "character": "Kate",
              "line": "(In an age where machines and humans coexist, hackers have become a profession that kills people. How ironic... But it doesn't matter. I'll just delete your short-term memory, and it will be restored soon.)"
            },
            {
              "character": "Kate",
              "line": "I'm so sorry, this is all for the greater good..."
            },
            {
              "character": "Narrator",
              "line": "After Kate apologized, he immediately dealt with the scene and headed to his destination."
            }
          ]
        },
        {
          "node": 4,
          "outline": "Law enforcement officer Kate was ordered to investigate an abandoned factory and discovered an unfinished android and a mysterious replacement plan, but was attacked by Victor.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Deeper inside the factory, Kate finds a fully operational assembly line. Half-assembled robots hang from the conveyor belts, lifeless yet eerie."
            },
            {
              "character": "Kate",
              "line": "Looks like these robots aren't complete yet..."
            },
            {
              "character": "Commander",
              "line": "Copy that. Snap some photos for analysis."
            },
            {
              "character": "Kate",
              "line": "On it."
            },
            {
              "character": "Narration",
              "line": "While taking photos, Kate spots a document on a nearby workstation."
            },
            {
              "character": "Kate",
              "line": "Replacement Project?"
            },
            {
              "character": "Narration",
              "line": "Before he can process the information, a man in a suit steps out from the shadows, his gaze filled with disdain."
            },
            {
              "character": "Victor",
              "line": "So, an enforcer, huh? You guys sure have a knack for showing up uninvited. Too bad you're early—our product isn't quite ready yet. But I don't mind giving you a preview."
            },
            {
              "character": "Narration",
              "line": "Victor activates the unfinished robots."
            },
            {
              "character": "Victor",
              "line": "Go on, clean up the mess."
            },
            {
              "character": "Kate",
              "line": "'Half-finished', huh...? "
            },
            {
              "character": "Narration",
              "line": "Kate hacks into the conveyor belt's robotic arms to fight Narration."
            }
          ]
        },
        {
          "node": 5,
          "outline": "Kate was besieged by a brute force at the factory and was rescued Narration to the base after falling into a coma. He discovered that all the evidence had disappeared, leaving only questions about the 'replacement plan' and 'changing the world' lingering in he mind.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "Time passes... When Kate finally regains consciousness, he finds herself Narration at base."
            },
            {
              "character": "Commander",
              "line": "You're awake…"
            },
            {
              "character": "Commander",
              "line": "When we found you in the ruins, all the data you collected was gone. The only things left were you and your hacking device. What exactly happened in that factory?"
            },
            {
              "character": "Narration",
              "line": "Kate remains silent for a moment."
            },
            {
              "character": "Kate",
              "line": "I saw… a lot of robots. Other than that… nothing."
            },
            {
              "character": "Commander",
              "line": "I see. Well, get some rest—you've done enough."
            },
            {
              "character": "Narration",
              "line": "The Commander exits the medical room."
            },
            {
              "character": "Kate",
              "line": "'Replacement Project,'changing the world... Justice... Forget it. Thinking wont change anything. Might as well just rest for now…"
            }
          ]
        },
        {
          "node": 6,
          "outline": "Kate and Eva team up to severely damage the cyborg, but the cyborg is ready to launch the ultimate attack. At the critical moment, the robot Houtai intervened to paralyze the enemy and offered to join them. The three of them reached a tacit understanding and officially formed a team.",
          "dialogues": [
            {
              "character": "Narration",
              "line": "The cyborg was not only fast but could predict attack patterns. His heavy punches shattered street obstacles, making Kate's movements more difficult."
            },
            {
              "character": "Kate",
              "line": "Found his weakness."
            },
            {
              "character": "Narration",
              "line": "Kate aimed at the cyborg's power core and fired a shot through its protective shield. The cyborg paused, and Eva seized the moment, destroying the core with her high-energy electromagnetic cannon."
            },
            {
              "character": "Mysterious Man",
              "line": "You… can't win… I still have… one last…"
            },
            {
              "character": "Narration",
              "line": "Suddenly, the cyborg's Narrationup energy core activated, generating a massive energy surge around him. He stood up, his arms transforming into devastating weapons, preparing to unleash his ultimate attack."
            },
            {
              "character": "Eva",
              "line": "He's still fighting Narration!"
            },
            {
              "character": "Kate",
              "line": "Get ready to cover me."
            },
            {
              "character": "Narration",
              "line": "Just as the cyborg was about to release his attack, a small, unassuming robot darted out from the corner, quickly approaching him. It latched onto his ankle and sent a high-voltage shock through his system, paralyzing him instantly."
            },
            {
              "character": "Narration",
              "line": "..."
            },
            {
              "character": "Houtai",
              "line": "Hey! No need to thank me! Just doing my job!"
            },
            {
              "character": "Narration",
              "line": "The cyborg collapsed heavily, its energy core shutting down, restoring silence to the scene. Kate and Eva stared in shock at the little robot."
            },
            {
              "character": "Eva",
              "line": "What is that?"
            },
            {
              "character": "Houtai",
              "line": "How rude! I'm Houtai! The all-purpose assistant! That move just now was amazing, right? I knew you needed help, good thing I showed up in time!"
            },
            {
              "character": "Kate",
              "line": "Have we met before?"
            },
            {
              "character": "Houtai",
              "line": "Don't be so cold! I saved your life. If I hadn't stalled for time last time, allowing the enforcement squad to find you, you'd be long dead."
            },
            {
              "character": "Kate",
              "line": "…Thanks. What do you want?"
            },
            {
              "character": "Houtai",
              "line": "To join you and stop Victor."
            },
            {
              "character": "Narration",
              "line": "Kate didn't respond immediately but glanced at Houtai, then at Eva. A strange sense of understanding formed between them."
            },
            {
              "character": "Eva",
              "line": "Looks like our team is coming together."
            },
            {
              "character": "Kate",
              "line": "We need to head Narration and request more support."
            },
            {
              "character": "Narration",
              "line": "Houtai and Eva exchanged a glance before following in Kate's footsteps."
            },
            {
              "character": "Eva",
              "line": "By the way… has anyone ever told you that your name is really strange?"
            },
            {
              "character": "Houtai",
              "line": "To join you and stop Victor.How rude!"
            }
          ]
        }
      ]
    }
  ]
}